{"article_publication_date": "01-13-1988", "fulltext": "\n\t\t\t", "proc_id": "73560", "abstract": "<p>We present an algorithm for updating data flow information derived from a program, in response to program edits. Our algorithm, applicable to intraprocedural or interprocedural data flow problems, is more general than previous methods because it can update any monotone data flow problem defined on a reducible flow graph and can handle arbitrary program edits.</p><p>Rather than design yet another special-purpose data flow update algorithm, we show how to reduce the class of data flow problems to another class of problems which already has a fast update algorithm. More specifically, we reduce a monotone data flow problem formulated for solution using Graham-Wegman elimination [12] to the problem of constructing and decorating an attributed tree structurally isomorphic to the dominator tree of the program flow graph.</p><p>To update this dominator tree in response to program changes, we first show how to express domination in terms of two local properties of nodes and edges in the flow graph &#8212; niceness and deepness. Domination is then updated in response to an edge addition or deletion by repeatedly performing two local operations on the dominator tree, each operation restoring the local properties violated by the edge change. Second, we extend Reps' attributed tree update techniques [19,21,20] and his complexity analysis, to update attribute values in response to changes in this structure.</p>", "authors": [{"name": "M. D. Carroll", "author_profile_id": "81100112505", "affiliation": "Department of Computer Science, and Center for Computer Aids for Industrial Productivity, Rutgers University, New Brunswick, New Jersey", "person_id": "P177605", "email_address": "", "orcid_id": ""}, {"name": "B. G. Ryder", "author_profile_id": "81100632248", "affiliation": "Department of Computer Science, and Center for Computer Aids for Industrial Productivity, Rutgers University, New Brunswick, New Jersey", "person_id": "PP40036492", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/73560.73584", "year": "1988", "article_id": "73584", "conference": "POPL", "title": "Incremental data flow analysis via dominator and attribute update", "url": "http://dl.acm.org/citation.cfm?id=73584"}