{"article_publication_date": "10-26-2003", "fulltext": "\n Jazz: A Collaborative Application Development Environment Li-Te Cheng, Susanne Hupfer, Steven Ross, \nJohn Patterson IBM Research 1 Rogers Street Cambridge, MA 02142 617-693-7266 {li-te_cheng, shupfer, steven_ross, \njohn_patterson}@us.ibm.com Bryan Clark Clarkson University clarkbw@clarkson.edu  Categories and Subject \nDescriptors D.2.6 [Software Engineering]: Programming Environments Integrated environments, Interactive \nenvironments, Programmer workbench; D.2.3 [Software Engineering]: Coding Tools and Techniques Object-oriented \nprogramming, Program editors; D.2.9 [Software Engineering] Management Programming teams, Software configuration \nmanagement; D.2.2 [Software Engineering] Design Tools and Techniques User interfaces. General Terms \nManagement, Design, Human Factors. Keywords Application development, integrated development environment, \nIDE, collaborative development environment, collaborative software engineering, collaborative computing, \nCSCW, groupware, Java, Eclipse. 1. INTRODUCTION Over the past several years, software developers have \nintegrated collaborative features into a variety of applications. Despite the fact that software development \nis itself a collaborative activity, development tools rarely offer direct support for collaboration. \nUsually collaboration occurs via the source control repository or in applications outside the IDE (e.g. \nemail, instant messaging). As software development teams work under mounting pressure to meet tight deadlines, \nand as these teams are increasingly geographically distributed, the need for tools to enhance their effectiveness \nis growing. In this demo, we will show the current working version of Jazz, a project at IBM Research \naimed at extending development tools with collaborative capabilities, enabling small teams of software \ndevelopers to work together more productively. Copyright is held by the author/owner(s). OOPSLA 03, October \n26 30, 2003, Anaheim, California, USA. ACM 1-58113-751-6/03/0010. Cleidson de Souza University of California, \nIrvine cdesouza@ics.uci.edu 2. THE JAZZ METAPHOR Jazz is based on the metaphor of an open office approach \nto application development. In such a setting, a team of developers works in close proximity at individual \nworkstations, with communal space set aside for team meetings, shared whiteboards, and schedule information. \nA key aspect of this setting is team awareness. Even while focusing on their personal work, team members \nhave a sense of the work, activities, and conversations occurring elsewhere in the room. Communication \namong team members is encouraged in this environment, whether shouting out questions to the team or calling \nover a colleague to consult on an issue at a particular workstation. The Jazz project extends the Eclipse \nJava development environment to capture these collaborative features of an open office environment. Our \ngoal is to elevate the core team a small egalitarian group of developers with common goals and implicit \ntrust in one another to a first-class object in the development environment, and to facilitate awareness, \ncommunication, and coordination among the members of the team. 3. ELEMENTS OF COLLABORATION IN THE JAZZ \nENVIRONMENT The Jazz enhancements to the Eclipse environment focus on increasing the user s awareness \nof people, resources, and activities, and on fostering communication among team members. The most visible \naspect of the Jazz enhancements to Eclipse is the Jazz Band, a small strip along the bottom of the screen \nthat provides the user with peripheral awareness of the other developers. A small icon in the Jazz Band \nrepresents each team member. At a glance, one can tell whether a team member is online, active at his/her \nworkstation, and engaged in his/her own Jazz-enhanced Eclipse environment. Clicking on or hovering over \nicons reveals further details about developers activities and the files they have checked out of source \ncontrol. The Jazz Band provides easy access to and awareness of the Team Jam, a team-centric discussion \nboard. A user can leave a message or question for the entire team on the Team Jam, or can initiate an \ninstant-messaging style chat with a particular team member through the Jazz Band. At the conclusion of \nany such chat, the chat contents may optionally be posted to the Team Jam for the benefit of the other \nteam members. Both synchronous chats and asynchronous messages in the Team Jam can be associated with \na place in a code file, allowing easy linkage from the code to the discussion or from the discussion \nto the code. The Team Jam also provides access to a log of team events, such as the check-ins and check-outs \nof files from source control. Beyond asynchronous discussions in the Team Jam and synchronous chat discussions, \nJazz will also allow a user to share his/her screen with other team members to support activities such \nas pair programming, joint debugging, code walkthroughs, and consulting. In addition to people-centered \nawareness, the Jazz project provides resource-centered awareness through extensions to the Eclipse package \nexplorer. Decorators on the file names in the package explorer indicate which files are checked out, \nwhich have been subsequently modified, and which have been checked in, rendering the current files on \nthe workstation out-of-date. An author property added to the explorer shows which individual team members \nhave stakes in particular files. Resource-centered awareness continues downward from the package explorer \ninto the code editor itself. Markers along the left margin of the code indicate where other team members \nhave made modifications. Other markers show the location of code-based annotations left by a team member, \nand also code-based discussions between developers about a particular region of code. The contents of \nthese annotations and chats are easily accessible through these markers. In this manner, developers maintain \nawareness of where other team members are working in the codebase and what issues center on particular \nareas of code. In this manner, they can coordinate their efforts and avoid conflicts. 4. FUTURE DIRECTIONS \nThe goal of the Jazz-enhanced Eclipse environment is to provide easy, in-context access to as much of \nthe team information as possible, without hindering the user s work unnecessarily. Annotations, questions, \nanswers, chats, screen shares, and file reservations are all stored in the Team Jam, and are also accessible \nfrom editor markers, personal icons on the Jazz Band, and the Package Explorer. We will be experimenting \nwith cross­linking these artifacts, so that, for example, file reservations will specify an associated \ntask, tasks can refer to locations in the code, code can contain references to annotations, questions, \nand answers, etc. The goal is to produce a web of related information that knits the members of the team \ninto a well-coordinated, productive working group. We have also conducted a series of interviews with \nprofessional developers discussing the management of interdependencies across teams and gathered their \nreactions to Jazz. We plan to publish the results of this study and use them to inform the design of \nour next iteration of Jazz.  \n\t\t\t", "proc_id": "949344", "abstract": "", "authors": [{"name": "Li-Te Cheng", "author_profile_id": "81100098077", "affiliation": "IBM Research, Cambridge, MA", "person_id": "PP14044235", "email_address": "", "orcid_id": ""}, {"name": "Susanne Hupfer", "author_profile_id": "81100100222", "affiliation": "IBM Research, Cambridge, MA", "person_id": "P272367", "email_address": "", "orcid_id": ""}, {"name": "Steven Ross", "author_profile_id": "81100265452", "affiliation": "IBM Research, Cambridge, MA", "person_id": "PP14100565", "email_address": "", "orcid_id": ""}, {"name": "John Patterson", "author_profile_id": "81100562339", "affiliation": "IBM Research, Cambridge, MA", "person_id": "PP31047808", "email_address": "", "orcid_id": ""}, {"name": "Bryan Clark", "author_profile_id": "81330489032", "affiliation": "Clarkson University", "person_id": "PP29029566", "email_address": "", "orcid_id": ""}, {"name": "Cleidson de Souza", "author_profile_id": "81100489279", "affiliation": "University of California, Irvine", "person_id": "PP14171304", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/949344.949370", "year": "2003", "article_id": "949370", "conference": "OOPSLA", "title": "Jazz: a collaborative application development environment", "url": "http://dl.acm.org/citation.cfm?id=949370"}