{"article_publication_date": "10-26-2003", "fulltext": "\n Panel Object-Oriented Success Stories Learning from Our Failures Joseph W. Yoder (Chair) Ralph Johnson \nSteven R. Wingo The Refactory, Inc. The University Of Illinois Southern Company Ron Jeffries XProgramming.com \n ABSTRACT Beneath the buzz around methodologies, languages and technolo­gies, the last seventeen years \nat OOPSLA have seen countless object-oriented success and failure stories, large and small. Last year \nat OOPSLA there was great enthusiasm over the telling of object-oriented success stories. However, we \nbelieve that one often learns more from failures than successes. This fishbowl will provide OOPSLA attendees \nto bear witness to these failure sto­ries, and tell these tales at last. Categories &#38; Subject Descriptors: \nK.6.1 Project and People Management: Management techniques K.6.3 Software Management: Software development/process \nK.7.4 Professional Ethics: Codes of good practice General Terms: Design, Human Factors, Reliability Keywords: \nObject-Oriented, Successes, Failures  1. Overview OOPSLA 2002 featured a fishbowl focused on Object-Oriented \nsuccess stories. This fishbowl was well received with much audi­ence participation. After the initial \ndiscussion was seeded with a few stories by the organizers, audience members participated by sharing \ntheir personal success stories. This year we intend to examine object-oriented project failures. Our \npremise is that sharing failure retrospectives can lead to greater learning than simply sharing successes \nstories. A stigma is often associated with failures, thus inhibiting the shar­ing of stories. To overcome \nthis apparent inhibition, the session will start with failure stores from industry luminaries with the \nhope that this will inspire audience participation. If absolutely necessary (to protect the identity \nof audience participants) paper bags will be supplied. Alternatively, stories will be solicited by the \nfishbowl chair (Joseph W. Yoder joeyoder@joeyoder.com) prior to OOPSA and shared anonymously. What worked \nvery well last year was the casual conversational story telling format. This is very similar to what \nhappens when Copyright is held by the author(s)/owner(s). OOPSLA 03, October 26-30, 2003, Anaheim, California, \nUSA. ACM 1-58113-751-6/03/0010. Linda Rising Independent Consultant you are in between events talking \nto someone about a good story. You tell some of your story, they ask questions, you go back and forth \ndialoging so that a better rendition of the story is presented. This dialog helps present a better version \nof the story and a more understandable version of the story is revealed. The successes were easy to keep \nfocused last year since once we boot strapped it with a couple of good successes, it was easy for Johnson \nto work the audience in order to motivate people to join the bus bench to relate their story, or to help \nwith the ques­tioning. We felt the failures will be harder to get people to tell their story. The primary \ninteraction format of this fishbowl will be that of a bus bench. Participants will relate their story \ncasually as if they were on a bench waiting for a bus or standing in a hallway at a conference conversing \ncasually with colleagues. Yoder, Wingo, and Johnson will facilitate the fishbowl by fostering audience \nparticipation through dialogue and questions. Initially, Ron Jeffiries and Linda Rising will share their \nstories and then offer perspectives to keep the session focused. One goal of this panel will be to open \npeople up to having candid discussions about speed bumps, pitfalls and mistakes. Good judgment comes \nfrom experience and experience comes from bad judgment. Or as Rechtin in 1991 stated: Success comes from \nwisdom. Wisdom comes from experience. Experience comes from mistakes. We want people to learn from past \nfailures, and to be comfortable talking about them. Embrace failure before failure embraces you. 2. \nJoseph W. Yoder, joeyoder@joeyoder.com Joseph W. Yoder has worked on the architecture, design, and implementation \nof various software projects dating back to 1985. These projects have incorporated many technologies \nand range from stand-alone to client-server applications, multi-tiered, data­bases, object-oriented, \nframeworks, human-computer interaction, collaborative environments, and domain-specific visual-lan­guages. \nJoseph W. Yoder has assisted many companies with the develop­ment of software applications, specifically \nobject-oriented and web-based systems. Joe has mentored object-oriented developers and provided internal \ntraining on using patterns to assist with object-oriented development. Recently he has been teaching \nJava, Smalltalk, Patterns, Frameworks, Object-Oriented Analysis and Design and has mentored analysts \nand developers on many of their applications. He was also involved in the management and development \nof a reusable Enterprise Class Libraries. Joe is the author of over two-dozen published patterns and \nhas been working with patterns for a long time, writing his first pat­tern paper in 1995, and was the \nconference chair for the PloP 97, conference on software patterns and was the programming chair of The \nSecond Latin American Conference on Pattern Languages of Programming. Joe enjoys building elegant and \nsuccessful systems, helping peo­ple succeed, and learning new things. He wants to continue to provide \nanalysis, design, and mentoring and to write papers that reflect these experiences. 3. Ralph Johnson, \njohnson@cs.uiuc.edu Ralph Johnson is a professor of computer science at the Univer­sity of Illinois. \nFor the past 20 years, Ralph has been studying object-oriented technology and how it changes the way \nsoftware is developed. In particular, he has been interested in how to use and develop frameworks, which \nhe has come to believe is a key way of reusing designs and code using objects. He has been involved in \nthe development of an object-oriented operating system (Choices), compiler (Typed Smalltalk), structured \ndrawing framework (HotDraw), music synthesis system (Kyma), and am currently working on frameworks for \nbusiness transaction process (i.e. accounting, payroll, inventory) and other business computing. Not \nsurprisingly, this caused Ralph to develop some opinions about how to develop reusable software, which \nin turn motivated him to write many papers. Designing Reusable Classes (with Brian Foote) has a set of \ndesign heuristics and was the first paper in which they talked about frameworks. Frameworks are a way \nof reusing the design or architecture of a system using object-ori­ented technology. Reusing Object-Oriented \nDesign (with Vince Russo) describes frameworks in more detail. Frameworks led Ralph to work on patterns, \nwhich are a way of documenting design expertise. You can use them to document how to use a framework, \nhow a framework is designed, and how to extend it. This led to the Design Patterns book. For examples \nof how to document frameworks with patterns, see Documenting Frameworks with Patterns, Patterns Generate \nArchitectures, and A Framework for Network Protocol Software. Ralph also teaches a course on patterns \nfor various companies. Obviously Ralph s framework, patterns, and reuse work has been focused on what \nworks or what we are calling object-oriented successes. But as much as successes, Ralph believes that \nit is im­portant to examine failures. Understanding failures can be very valuable to make one more successful. \n 4. Steven Wingo, RSWingo@southernco.com Steve Wingo is the Project Lead on a Transmission Settlement \n(Billing) Application for the Southern Company. Prior projects include developing the server application \nfor the OASIS Trans­mission Reservation System and implementing the Available Transmission Capacity Application. \nSteve has seen first hand the benefits of an object-oriented ap­proach. His current project, presented \nas an Object-Oriented Suc­cess Story before this panel last year, started in 1998 and, as is all active \nExtreme Programming (XP) projects, is still in develop­ment. Steve credits the success of the project \nto the talented ob­ject-thinking team members on his development team, XP prac­tices, testing-testing-testing, \nand to those in academia and industry who paved the way in objects. The success of a project goes beyond \nproducing the correct an­swers. In developing his current system, Steve found that using an object-oriented \napproach can allow broad sweeping changes to be made without breaking things; that big design problems \nsolved with small extensions to the object model; and that new features can be easily added to a big \napplication without hitting the wall . 5. Ron Jeffries, ronjeffries@acm.org Ron Jeffries has been involved \nin failing projects longer than most people have been alive. Fortunately for his self-esteem, he has \nalso been involved in a few that succeeded. Ron has cycled from solo programmer to manager of many programmers \n-- and back -­many times. Each time, he has tried to learn a bit from what has happened to him, and to \ntreat each event as something that he caused, rather than to perceive himself as the victim of enemy \naction. Sometimes he has succeeded. In this fishbowl, however, he'll tell us about his failures. Ron \nwas the first on-site coach in Extreme Programming, is the primary author of Extreme Programming Installed, \nand the pro­prietor of www.XProgramming.com. He is presently working on a book about learning while making \nprogress, with the working title of Adventures in C#. 6. Linda Rising, risingl@acm.org Linda Rising \nhas a Ph.D. from Arizona State University in the area of object-based design metrics. Her background \nincludes university teaching as well as work in industry in telecommunica­tions, avionics, and strategic \nweapons systems. She is the author of numerous articles and has published three books: Design Pat­terns \nin Communications, The Pattern Almanac 2000, and A Pat­terns Handbook. She is currently writing a book \nwith Mary Lynn Manns: Introducing Patterns (or any Innovation) into Organiza­tions, to appear in Fall \n2003. What we often forget in our industry is that the greatest success always includes some elements \nthat could be improved and the most miserable failure always includes some elements that worked well. \nWhen we avoid examining our failures, we miss a lot of good stuff! Since Linda facilitates a lot of postmortems \n(many of them failures) she sees the beginnings of wonderful patterns that help organizations improve \nand benefit from even the most devas­tating disasters. Linda will dialog some of these stories and dis­cuss \nsome of the patterns for improvements for when you are addressed by these problems in your organization. \n \n\t\t\t", "proc_id": "949344", "abstract": "Beneath the buzz around methodologies, languages and technologies, the last seventeen years at OOPSLA have seen countless object-oriented success and failure stories, large and small. Last year at OOPSLA there was great enthusiasm over the telling of object-oriented success stories. However, we believe that one often learns more from failures than successes. This fishbowl will provide OOPSLA attendees to bear witness to these failure stories, and tell these tales at last.", "authors": [{"name": "Joseph W. Yoder", "author_profile_id": "81100257036", "affiliation": "The Refactory, Inc.", "person_id": "PP39034780", "email_address": "", "orcid_id": ""}, {"name": "Ralph Johnson", "author_profile_id": "81330492373", "affiliation": "The University Of Illinois", "person_id": "PP39043454", "email_address": "", "orcid_id": ""}, {"name": "Steven R. Wingo", "author_profile_id": "81100303231", "affiliation": "Southern Company", "person_id": "P643489", "email_address": "", "orcid_id": ""}, {"name": "Ron Jeffries", "author_profile_id": "81100493018", "affiliation": "XProgramming.com", "person_id": "PP43120511", "email_address": "", "orcid_id": ""}, {"name": "Linda Rising", "author_profile_id": "81100569557", "affiliation": "Independent Consultant", "person_id": "PP14197318", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/949344.949411", "year": "2003", "article_id": "949411", "conference": "OOPSLA", "title": "Object-oriented success stories: learning from our failures", "url": "http://dl.acm.org/citation.cfm?id=949411"}