{"article_publication_date": "12-01-1992", "fulltext": "", "proc_id": "157709", "abstract": "<p>A Case Study of Domain Analysis: Health Care<br>Martin Fowler &amp; Thomas Cairns, St Marys Hospital Medical School, England</p><p>Three years ago the UK National Health Service decided todevelop a generic model to describe all aspects of its managementand operation. Several projects were launched to describe thehealth care process using the object-oriented modeling techniquePtech (now published by James Martin and Jim Odell). One of theseprojects, the Cosmos project, produced the Cosmos Clinical ProcessModel (or CCPM), which describes the medical record. The CCPMcontains approximately 70 object types in a highly abstractstructure describing clinical procedures, observations, evidenceand assessment, accountabilities and contracts, care planning, andclinical knowledge. The model has gained widespread interest inboth the UK and Europe and will be used as the focus for a numberof EEC sponsored projects, and is taking a leading standardizationrole in Europe.</p><p>The CCPM is an example of the result of domain analysis. Its useof abstractions, some of which are applicable outside health care,and its use of an operational/knowledge divide can guide thoseworking on large-scale generic models in other areas. The tutorialdescribes the relationship between generic and specific modelssince these issues are key in the acceptance of a highly genericapplication area model by those with specific applications todevelop. The question of adapting an object-oriented method forparticular needs is also addressed.</p>", "authors": [{"name": "Martin Fowler", "author_profile_id": "81100062314", "affiliation": "", "person_id": "PP14032421", "email_address": "", "orcid_id": ""}, {"name": "Thomas Cairns", "author_profile_id": "81100099751", "affiliation": "", "person_id": "P280380", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/157709.157779", "year": "1992", "article_id": "157779", "conference": "OOPSLA", "title": "A case study of domain analysis (abstract): health care", "url": "http://dl.acm.org/citation.cfm?id=157779"}