{"article_publication_date": "12-01-1992", "fulltext": "", "proc_id": "157709", "abstract": "<p><i>The Universities of Kaiserlautern and Karlsruhe arecooperating with the CEC Karlsruhe, a research center of DigitalEquipment CmbH, in the area of software engineering for distributedapplications.</i></p><p>This demonstration will showcase DOCASE, a software engineeringenvironment for distributed applications, using object-orientedtechnology. The demonstration will provide insight into themethods, languages, tools and environments used in the life-cycleof distributed applications. With the term distributedapplications, we put an emphasis on structured parallelism (whichcomes more or less naturally with the logical structure andinherent parallelism and distribution of an application), not somuch on the fine-grained parallelism exploited by applications suchas image processing etc.</p><p>With more and more complex (dynamic, multiparty, cooperative)distributed applications to be developed in computer integratedmanufacturing, office automation, CSCW, and other domains, we thinkthat this topic is both very much up to date and a topic which isnot sufficiently taught.</p><p>The live demonstration will show a distributed application whichwill allow researchers of arbitrary disciplines to coordinate theirwork with other members of a research team. The underlying metamodel is generic and instantiated by developing a set of concreteobject types together with a GUI.</p>", "authors": [{"name": "Max Muhlhauser", "author_profile_id": "81100305085", "affiliation": "", "person_id": "PP14111901", "email_address": "", "orcid_id": ""}, {"name": "Lutz Heuser", "author_profile_id": "81100317188", "affiliation": "", "person_id": "PP37037813", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/157709.157802", "year": "1992", "article_id": "157802", "conference": "OOPSLA", "title": "Object-oriented engineering of distributed applications (abstract)", "url": "http://dl.acm.org/citation.cfm?id=157802"}