{"article_publication_date": "10-01-1999", "fulltext": "\n\t\t\t", "proc_id": "320384", "abstract": "<p><italic>Traditional implementations of multiple inheritance bring about not only an overhead in terms of run-time but also a significant increase in object space. For example, the number of compiler-generated fields in a certain object can be as large as quadratic in the number of its subobjects. The problem of efficient object layout is compounded by the need to support two different semantics of multiple inheritance:</italic> shared, <italic>in which a base class inherited along distinct paths occurs only once in the derived class, and</italic> repeated, <italic>in which this base has multiple distinct occurrences in the derived. In this theoretical and foundational paper, we introduce two new techniques to optimize memory layout for multiple inheritance. The main ideas behind these techniques are the inlining of virtual bases and bidirectional memory layout. Our techniques never increase time overhead, and usually even decrease it. We show that in some example hierarchies, more than ten-fold reduction in the space overhead can be achieved. We analyze the complexity of the algorithms to apply these techniques, and give theorems to estimate the efficacy of this application. For concreteness, techniques and examples are discussed in the context of C++.</italic></p>", "authors": [{"name": "Peter F. Sweeney", "author_profile_id": "81332530743", "affiliation": "IBM T. J. Watson Research Center, P.O. Box 704, Yorktown Heights, NY", "person_id": "PP43117531", "email_address": "", "orcid_id": ""}, {"name": "Joseph (Yossi) Gil", "author_profile_id": "81100349003", "affiliation": "Department of Computer Science, Technion-IIT, Haifa 32000, Israel", "person_id": "P149595", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/320384.320408", "year": "1999", "article_id": "320408", "conference": "OOPSLA", "title": "Space and time-efficient memory layout for multiple inheritance", "url": "http://dl.acm.org/citation.cfm?id=320408"}