{"article_publication_date": "10-01-1999", "fulltext": "\n\t\t\t", "proc_id": "320384", "abstract": "<p>In this paper we present the Generic Graph Component Library (GGCL), a generic programming framework for graph data structures and graph algorithms. Following the theme of the Standard Template Library (STL), the graph algorithms in GGCL do not depend on the particular data structures upon which they operate, meaning a single algorithm can operate on arbitrary concrete representations of graphs. To attain this type of flexibility for graph data structures, which are more complicated than the containers in STL, we introduce several concepts to form the generic interface between the algorithms and the data structures, namely, Vertex, Edge, Visitor, and Decorator. We describe the principal abstractions comprising the GGCL, the algorithms and data structures that it provides, and provide examples that demonstrate the use of GGCL to implement some common graph algorithms. Performance results are presented which demonstrate that the use of novel lightweight implementation techniques and static polymorphism in GGCL results in code which is significantly more efficient than similar libraries written using the object-oriented paradigm.</p>", "authors": [{"name": "Lie-Quan Lee", "author_profile_id": "81100384315", "affiliation": "Laboratory for Scientific Computing, Department of Computer Science and Engineering, University of Notre Dame, Notre Dame, IN", "person_id": "PP39040381", "email_address": "", "orcid_id": ""}, {"name": "Jeremy G. Siek", "author_profile_id": "81100437231", "affiliation": "Laboratory for Scientific Computing, Department of Computer Science and Engineering, University of Notre Dame, Notre Dame, IN", "person_id": "PP31094331", "email_address": "", "orcid_id": ""}, {"name": "Andrew Lumsdaine", "author_profile_id": "81100082403", "affiliation": "Laboratory for Scientific Computing, Department of Computer Science and Engineering, University of Notre Dame, Notre Dame, IN", "person_id": "P18130", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/320384.320428", "year": "1999", "article_id": "320428", "conference": "OOPSLA", "title": "The generic graph component library", "url": "http://dl.acm.org/citation.cfm?id=320428"}