{"article_publication_date": "10-16-2005", "fulltext": "\n\t\t\t", "proc_id": "1094855", "abstract": "This poster tells the story of the introduction of furniture on wheels into a very traditional corporate culture. We've all heard of innovative office environments used by design firms, startups, and skunk works, but what about the rest of us? At a 90-year-old $80-Billion financial institution we attempted to implement and measure the effects of an office environment that would be a logical extension of our existing culture, and would also better support collaborative work and the use of Agile Software Development methodologies. A cross-functional project team received new office furniture on wheels which allowed more team interaction and fast layout reconfiguration. The economics and corporate culture effects of this move were recorded. The team was surveyed on ergonomics and ability to collaborate six months before and six months after the change, and the results compared with a team that did not receive the change over the same period. While the sample size was too small to imply universal results, it did anecdotally indicate the benefits of continuing and expanding the implementation.", "authors": [{"name": "Dean Mackie", "author_profile_id": "81100651262", "affiliation": "Ontario Teachers Pension Plan, Toronto, ON, Canada", "person_id": "P753347", "email_address": "", "orcid_id": ""}, {"name": "Gifford Louie", "author_profile_id": "81100497340", "affiliation": "Ontario Teachers Pension Plan, Toronto, ON, Canada", "person_id": "P97471", "email_address": "", "orcid_id": ""}, {"name": "Jason Rogers", "author_profile_id": "81100174450", "affiliation": "Ontario Teachers Pension Plan, Toronto, ON, Canada", "person_id": "P753369", "email_address": "", "orcid_id": ""}, {"name": "Niall Shaw", "author_profile_id": "81100395627", "affiliation": "Ontario Teachers Pension Plan, Toronto, ON, Canada", "person_id": "P753394", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1094855.1094878", "year": "2005", "article_id": "1094878", "conference": "OOPSLA", "title": "Agile environments...: for the rest of us", "url": "http://dl.acm.org/citation.cfm?id=1094878"}