{"article_publication_date": "10-16-2005", "fulltext": "\n\t\t\t", "proc_id": "1094855", "abstract": "Our goal is to enable rapid production of static and dynamic object models from natural language description of problems. Rapid modeling is achieved through automation of analysis tasks. This automation captures the cognitive schemes analysts use to build their models of the world through the use of a precise methodology. The methodology is based on the use of proposed technique called <i>role posets</i>, and a semi-natural language (called <i>4W</i>). First versions of this tool were used as prototypes to produce early design artifacts for very small (toy) problems. Current version has been successfully used as an educational tool in object oriented software engineering courses. We present the tool with its new complete features and results of its application in learning process. Original problem statements are automatically translated to 4W language. The produced sentences then, are analyzed with role posets to produce static model views. Finally the 4W sentences are used to generate dynamic views of the problem. This set of methods maximizes analysis process agility, promotes reusability and constitutes a valuable tool in the learning process of object thinking. The prototype tool: GOOAL (Graphic Object Oriented Analysis Laboratory) receives a natural language (NL) description of a problem and produces the object models taking decisions sentence by sentence. The user realizes the consequences of the analysis of every sentence in real time.", "authors": [{"name": "H. G. P&#233;rez-Gonz&#225;lez", "author_profile_id": "81100472793", "affiliation": "Universidad Aut&#243;noma de San Luis Potos&#237;, M&#233;xico", "person_id": "P753361", "email_address": "", "orcid_id": ""}, {"name": "Jugal K. Kalita", "author_profile_id": "81100288385", "affiliation": "University of Colorado at Colo. Springs, CO", "person_id": "P150566", "email_address": "", "orcid_id": ""}, {"name": "Alberto Salvador N&#250;&#241;ez Varela", "author_profile_id": "81100235205", "affiliation": "Universidad Aut&#243;noma de San Luis Potos&#237;, M&#233;xico", "person_id": "P753329", "email_address": "", "orcid_id": ""}, {"name": "Richard S. Wiener", "author_profile_id": "81100489255", "affiliation": "University of Colorado at Colo. Springs, CO", "person_id": "PP14171292", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1094855.1094924", "year": "2005", "article_id": "1094924", "conference": "OOPSLA", "title": "GOOAL: an educational object oriented analysis laboratory", "url": "http://dl.acm.org/citation.cfm?id=1094924"}