{"article_publication_date": "01-07-2008", "fulltext": "\n An Approach to Call-by-Name Delimited Continuations Hugo Herbelin INRIA Futurs, France Hugo.Herbelin@inria.fr \nAbstract We show that a variant of Parigot s .µ-calculus, originally due to de Groote and proved to satisfyB¨ \nohm s theorem by Saurin, is canonically interpretable as a call-by-name calculus of delim­ited control. \nThis observation is expressed using Ariola et al s call-by-value calculus of delimited control, an extension \nof .µ­calculus with delimited control known to be equationally equiva­lent to Danvy and Filinski s calculus \nwith shift and reset. Our main result then is that de Groote and Saurin s variant of .µ-calculus is equivalent \nto a canonical call-by-name variant of Ariola et al s cal­culus.Therestofthepaperisdevotedtoa comparativestudyofthe \ncall-by-name and call-by-value variants of Ariola et al s calculus, covering in particular the questions \nof simple typing, operational semantics, and continuation-passing-style semantics. Finally, we discuss \nthe relevance of Ariola et al s calculus as a uniform frame­work for representing different calculi of \ndelimited continuations, including lazy variants such as Sabry s shift and lazy reset calcu­lus. Categories \nand Subject Descriptors F.3.3[Studies of Program Constructs]: Control primitives; F.4.1[Mathematical \nLogic]: Lambda calculus and related systems Keywords Delimited control, Observational completeness,B¨ohm \nseparability, Classical logic. 1. Introduction Control calculi emerged as an attempt to abstractly characterise \nthe semantics of operators like Scheme s call/cc that capture the current continuation of a computation. \nOne .rst such calcu­lus is the .C-calculus of Felleisen et al. (1986). Control opera­tor are connected \nto classical logic, as .rst investigated by Grif­.n (1990). Hence, it is not a surprise that the cleanest \nsuch .­calculus of control, namely .µ-calculus ofParigot (1992) comes from a computational analysis of \nclassical natural deduction: as shown by Ariola and Herbelin (2007), .µ-calculus extended with a single \ntoplevel continuation constant tp providesa .ne-grained calculus able, among other things, tofaithfullyexpress \nthe opera­tional semantics of call/cc, C, etc, including its own operational semantics, a property that \n.C-calculus achieves only at observa­tional level. The reason for this success is that .µ-calculus treats \nevaluation contexts as stand-alone .rst-class objects while.C man- Permission to make digital or hard \ncopies of all or part of this work for personal or classroom use is granted without fee provided that \ncopies are not made or distributed for pro.t or commercial advantage and that copies bear this notice \nand the full citation on the .rst page.To copyotherwise, to republish, to post on servers or to redistribute \nto lists, requires prior speci.c permission and/or a fee. POPL 08, January 7 12, 2008, San Francisco, \nCalifornia, USA. Copyright c &#38;#169; 2008ACM 978-1-59593-689-9/08/0001...$5.00 Silvia Ghilezan Faculty \nof Engineering, University of Novi Sad, Serbia gsilvia@uns.ns.ac.yu ages evaluation contexts through \ntheir rei.cation as regular func­tions. Delimited control and completeness properties If we concentrate \non call-by-value control calculi, the introduction of delimiters can be traced back to Johnson (1987), \nJohnson and Duggan (1988), Felleisen (1988), and Danvy and Filinski (1989). It has then been shown in \ndifferent contexts that adding such delim­iters increases theexpressivenessof control calculi.For instance, \nSitaram and Felleisen (1990) showed how to recover a full abstrac­tion result for call-by-value PCF with \ncontrol by adding a control delimiter.As another strikingexample, Filinski(1994)showedthat delimited \ncontrol is complete for representing concrete monads, hence to simulate side-effects such as states, \nexceptions, etc. Historically, delimited control came with ad hoc operators for composing continuations: \nFelleisen had a calculus that included a delimiter prompt and a control operator control (also respectively \nwritten # and F); Danvy and Filinski hadan operatorshift to com­pose continuations and an operator reset \nto delimit them (these were also written S and \\)). From Filinski (1994), it is known that shift and \nreset are equivalent to the combination of Scheme s call/cc, Felleisen s abort and reset, and hence equivalent \nto C and reset. From Shan (2004), it is known that control and prompt are also equivalent to shift and \nreset, in spite that control is se­mantically more complextostudy than C or shift. The simplicity of \nthe semantics of shift together with its relevance for some program­ming applications contributed to \nset shift asareferencein delimited control. And this is so in spite (it seems that) it has never been \nstud­ied untilnowaspartofa dedicated .-calculus of delimited control. As shown by Ariola et al. (2007), \na .ne-grained calculus of delimited control of the strength of shift and reset is obtained if one starts \nfrom .µ-calculus and extends it .rst by a notation tp for the toplevel continuation, then by a toplevel \ndelimiter. A possible interpretation for this toplevel delimiter is as a dynamic binder of tp, what justi.es \nto interpret the resulting call-by-value calculus, called .µ b tp,asanextensionof call-by-value .µ-calculus \nwith a single dynamically bound continuation variable b tp, where the hat on tp emphasises the dynamic \ntreatment of the variable. A typical analogy for the dynamic continuation variable here is exception \nhandling: each call to b tp is dynamically bound to the closest surrounding b tp binder, in exactly the \nsame way as a raised exception is dynamically bound to the closest surrounding handler. On the call-by-name \nside, we know no explicit mention of de­limited continuations,but two results related toB¨ohm s theorem(a \nform of observational completeness stated as a separability prop­erty) raised interesting questions: \nDavid and Py (2001) showed thatParigot s .µ-calculus does not satisfyB ¨ ohm s theorem while Saurin (2005)showedthatan \napparentlyinoffensivevariantof .µ­calculus due to de Groote (1994) does satisfyB ¨ ohm s theorem. Until \nSaurin s result, de Groote s variant of Parigot s .µ­calculuswasmerely consideredintypedsettings,andmoreparticu­larly \nin settings where the continuation calls had type . (de Groote ß :(.x.M) N . M[N/x] µapp :(µa.c) N . \nµß.c[[ß](D N)/a] ß fresh µvar :[ß]µa.c . c[ß/a] Figure 1. Reduction rules of .µ-calculus 1994; Ong 1996; \nOng and Stewart 1997; Selinger 2001, non ex­austive list). But in such a typed setting, de Groote s calculus \nis equivalent1 to Parigot s .µ-calculus extended with a single con­tinuation constant of type .. Hence, \nSaurin s result is the .rst result revealing that de Groote s calculus is strictly stronger than Parigot \ns one in the untyped setting. In our opinion, this justi.es to refer to this calculus as de-Groote Saurin \ns calculus. Our main result then is that de-Groote Saurin s calculus can be interpreted as a canonical \ncall-by-name variant of call-by-value .µ b tp. Capitalising on the equational correspondence between \ncall-by­value.µ b tp and an axiomatic of Danvy and Filinski sshift and reset givenby (Kameyama and Hasegawa \n2003), we can then assert that the calculus with shift and reset and de-Groote Saurin s calculus aretwofacetsofthevery \nsame notionof delimited control. Outline of the paper Section2isa brief surveyofParigot s .µ and de Groote \ns variant of .µ, including the separability properties studied by David and Py, and by Saurin. Section \n3 presents call-by-value .µ b tp and its relation with shift and reset. It reviews the results by Ariola \net al. (2007) and completes them by a formal presentation of the opera­tional semantics of call-by-value \n.µ b tp. In Section4we introduce a call-by-name .µ b tp and show that it is equivalent to de-Groote Saurin \ns calculus. Especially, it directly inherits separability from it. We study call-by-name .µ b tp in comparison \nwith the call-by­value .µ b tp: we propose a system of simple types for which sub­ject reduction holds \nand we study the operational and continuation­passing-style semantics.Afurther analysisof .µ b tp leads \nto a clas­si.cation of four calculi of delimited continuations which is dis­cussed in Section 5. Concluding \nremarks are given in Section 6. 2. Parigot s .µ-Calculus and Saurin s .µ-Calculus Failure of separability \nin .µ-calculus The .µ-calculus (Parigot 1992), for short .µ, is an untyped calculus designed to computa­tionally \ninterpret proofs of classical natural deduction. Its syntax is de.ned by the following grammar: Parigot \ns.µ-calculus M ::= x | .x.M | MM | µa.c (terms) c ::= [a]M (commands) where x, y, z and their notational \nderivatives range over an in.nite set of term variables and a, ß, ., d and their notational derivatives \nrange over an in.nite set of continuation variables (also called evaluation context variables). Expressions \ncontain terms (called unnamed terms in Parigot) and commands (called named terms in Parigot). The operators \n. and µ are binders. Free and bound variables are de.ned as usual and we reason modulo renaming of boundvariables.Atermor \ncommandis closed if it contains no free variables. The calculus is equipped with the call-by-name reduction \nrules shown in Figure 1. The notations M [N/x] and c[ß/a] denote usual capture-free substitutions, whereas \nthe expression c[[ß](D N)/a], 1If we call tp. the continuation constant of type ., then µa.t and [a]t \nin de Groote s calculus are respectively equivalent to µa.[tp.]t and µd.[a]t (d fresh)inParigot s calculus. \nß : (.x.M) N = M[N/x] µn : [ß](En[µa.c]) = c[[ß]En/a] .µ : µa.[a]M = M if a not free in M . : .x.(M x) \n= M if x not free in M Figure 2. Equational theory of .µ-calculus called structural substitution, denotes \nthe capture-free substitu­tion of every subterm of the form [a]M in c by [ß](MN). For instance, we have \n([a](x .y.µß.[a]y))[[.](D N)/a] = [.](x .y.µß'.[.](yN) N) where the binder ß has been renamed to avoid \nthe capture of possible free occurrences of ß in N. Note that the substitution c[q/a] coincides with \nthe structural substitu­tion c[[q]D/a].Aterm that contains no redex is called normal.We know from Baba \net al. (2001) that call-by-name reduction system is con.uent. The syntax of call-by-name evaluation contexts \nis de.ned by En ::= D | En[D M] where D denotes the hole of the con­text. We write E[M] for the term \nobtained by substituting M in the hole of E and structural substitution extends straightforwardly into \na substitution of the form c[[ß]E/a].We equip .µ with the equational theory given in Figure 2. Up to \nthe use of (.µ), the rule (µn) is equivalent to the combination of (µvar ) and (µapp) so that the equational \ntheory is correctly an extension with .-rules of the re.exive-symmetric-transitive closure of .. David \nandPyinvestigatedB¨ohm s separability for the equa­tional theory of .µ and showed that it does not satisfyB¨ohm \ns separability2. PROPOSITION 1 (David andPy 2001). There are two closed nor­mal terms W0 and W1 that \narenot equatedbythe equational theory inFigure2andofwhichthe observational behaviourisnotsepara­ble, \ni.e., for distinct fresh variables x and y, there is no applicative context En, suchthat En[W0]= x and \nEn[W1]= y. Separability in .µ-calculus Saurin (2005) showed that com­pleteness can be recovered by relaxing \nthe syntax of .µ so that the category of commands (i.e. named terms) becomes a subcategory of the oneof \nterms. The syntax usedby Saurinwas already consid­eredbyde Groote (1994),Ong (1996), Selinger (2001). \nThis syntax was considered as an alternative toParigot s original .µ. Saurin s result sheds new light \non the relation between the two calculi.Fol­lowing Saurin, we call .µ the calculus based on de Groote \nssyntax equipped with the same reduction rules and equational theory as in .µ. The syntax is3: .µ-calculus \nM ::= x | .x.M | MM | µa.M | [a]M In .µ, there are more evaluation contexts. Theyare de.ned by: Dn ::= \nD | Dn[[a]En]. THEOREM 2 (Saurin 2005). If the closed normal terms M and N in .µ are not equatedby the \nequational theoryinFigure2, then theyare separable, i.e., for any two variables x and y, there exists \na context Dn, suchthat Dn[M]= x and Dn[N]= y. 2David and Py actually had (µvar ) and (µapp ) instead \nof (µn) and their rules were oriented as rewrite rules. They also considered the rule . : µa.c . .x.µa.c[[a](D \nx)/a] but this rule is redundant for equational reasoning as it derives from (µn) and (.). The initial \nmotiva­tion for (.) was to turn their system of reduction rules (ß), (.), (µapp), (µvar ) and (.µ) intoa \ncon.uent systemof reduction.Infact, (.) hides an .-expansion and it is enough to formulate (.) in the \nexpansion way to get a con.uent system, without anyneed for (.). 3Saurin ssyntaxisabitdifferentashe writes \nMa for what we write [a]M but that is really here a matter of notation. This may look strange as the \nonly change is a change in the syntax of the terms. Infact, the difference lies in the rule (µvar ) which \nin the case of .µ can only occur in a con.guration of the form: M(µ..[ß]µa.c) . M (µ..c[ß/a]) while in \nthe case of .µ, it can also occur in a con.guration of the form: M ([ß]µa.c) . M (c[ß/a]) so that the \ncomputational effect of any µa.c can be cancelled if we succeed in putting it in a context of the form \n[ß]D. This last property is the main reason why Saurin s completeness theorem works. 3. A Review of Call-by-Value \n.µttp-Calculus The .C b-calculushasbeenintroducedby Ariolaetal. (2007).Itis tp an extension of the call-by-value \nvariant of .µ obtained by adding a single dynamically bound continuation variable b tp. Ariola et al \ns .C bis a .ne-grained calculus of delimited continuations in which, tp asanexample,the semanticsofDanvyand \nFilinski sshift and reset operators can be simulated. In the original formulation of .C b, the tp control \noperator of the language was called C in spite that .C bis tp based onParigot s structural substitution, \nas in .µ, rather than on substitution of continuations rei.ed as ordinary functions, as it is the case \nin Felleisen .C-calculus. Here we rede.ne .C busing the tp µ notation instead of a C notation. The so-reformulated \ncalculus is called the call-by-value .µ b tp. 3.1 Syntax and reduction rules M, N ::= V | MM | µq.c (terms) \nV ::= x | .x. M (values) c ::= [q] M (commands) q ::= tp a | b(ev. context variables) Figure 3. Syntax \nof .µ b tp The syntax of .µ b tp isgivenin Figure3.We also de.ne call-by­valueevaluation contextsby Ev \n::= D | Ev[D M] | Ev[V D] (eval. contexts) Dv ::= D | Dv[[q]Ev[µ b(nested eval. context) tp.D]] and the \nnotations Ev[M] and Dv[c] stand for the terms and com­mands obtained by plugging M into Ev and c into \nDv seen as expressions with one place-holder. ßv :(.x. M) V . M[V/x] µapp :(µa. c) M . µß.c[[ß](D M)/a] \nß fresh µapp ' : V (µa. c) . µß.c[[ß](V D)/a] ß fresh µvar :[q]µa.c . c[q/a] .bµ btp] VV tp occurs in \nV tp : tp.[ b. even if b Figure 4. Reductions of call-by-value .µ b tp The reduction semantics of call-by-value \n.µ b tp is given in Fig­ure 4. The notation c[[q]E/a] stands for structural substitution of evaluation \ncontexts as in .µ (see Section 2). The substitutions are capture-free for term and continuation variables \nbut b tp gets captured (e.g. the substitution of x by h (µd.[ b tp]y)(µd.[ß]z) in [a](f µß.(gµ btp]x))) \ngives as result the expression tp.[ß](g µ..[ b[a](f µß ' .(gµ b](g µ..[ btp]y)(µd.[ß]z)))))). tp.[ß ' \ntp](h (µd.[ b Asimple analysis of the syntax and rules shows that the unique context lemma (see Felleisen \nand Friedman 1986) holds:anyclosed command which is not of the form [ b tp].x.M has a unique decom­position \nas Dv[[ btp]Ev[M] isa re­ tp]Ev[M]] where either M or [ bdex. Hence the reduction system is complete \nfor the evaluation of closed programs.Aterm that contains no redex at all is said to be normal. 3.2 \nEquational theory ßv :(.x. M) V = M[V/x] µv :[q](Ev[µa. c]) = c[[q]Ev/a] .bµ btp] V = V tp : tp.[ b \nµtpb: tp](µ b= [ btp.c) c µb: µ btp.c)) = (.x.µ btp.c) let tp.[q]((.x.M)(µ btp.[q]M)(µ b tp µ let : \nµa.[q]((.x.N) M) =(.x.µa.[q]N) M 1 .µ : µa.[a] M = M 1 .v : .x.(Vx)= V 2 ßO :(.x.Ev[x]) M = Ev[M] 3 \n 1 a not free in M 2 x not free in V 3 x not free in Ev Figure 5. CPS-complete theory of call-by-value \n.µ b tp The equational theory of .µ b tp is given in Figure 5. Note that the equation (µv) generalises \nthe effect of the rules (µapp), (µapp' ) and (µvar ) (up to the use of (.µ)). 3.3 Simple typing X . \nTypeConstants A, B, T, U ::= X | AT . BU G ::= ·| G,x : A . ::= ·| .,a : AT Ax G,x : A f x:AT ; .; b \ntp : T G,x : A f M : BU ; .; b tp :T .i G f .x.M :(AT . BU )T , ; .; b' tp : T G fM :(AT1 .BU2)U1 ; .; \ntpb:T2 G fN :AT1 ; .; b tp:U1 .e G f MN : BU2 ; .; b tp:T2 G f c :. ;.,a : AU ; tpb: T G f c :. ; .; \nb tp : A G f µa.c: AU ; .; bG f µ btp : T tp: T tp.c : AT ; .; b G f M : AU ;.,a : AU ; tpb: T G f M \n:UU ; .; b tp: T G f [a]M :. ;.,a : AU ; tpb: T tp]M :. ; .; b G f [ btp : T Figure 6. Simple typing \nof call-by-value .µ btp-calculus The calculus .µ b tp is basically an untyped calculus. Still, it is \npossible to constrain it with a type system. Ariola et al s adaptation of Danvy and Filinski s system \nof simple types (Danvy and Filinski 1989) is given in Figure 6. As in Parigot, the typing context of \ncontinuation variables is on the right of the sequent. We use the symbol . in the typing judgements of \ncommands to emphasise that theyhave no type. A continuation of type AT is a continuation whose own con­tinuation \nis a call to a toplevel continuation b tp expected of type T , i.e. whose own continuation is expected \nto be called in a con­text where the surrounding µ b tp has type T .Ajudgement G f M : AT ; .; b tp : \nU says that M is a term which expects a continuation of type AT :the possible capturebyM of itsevaluation \ncontext will be dispatched in contexts where the dynamically closest surround­ing µ b tp is of type T \n. In the judgement, U is the type of the actual closest surrounding toplevel µ b tp.To propagate the \ntype informa­tion of the dynamically bound b tp, arrows have effects: a term of type AT . BU isaterm \nthatexpectsavalueof type A and returns a code of type B which: may capture its surrounding context and \nmove it in a place where the toplevel has type U,  eventually itself calls the toplevel continuation \nwith a value of type T .  3.4 Continuation-passing-style semantics x+ ! x (.x. M)+ ! .k.....x. [ M] \nk . [ V ] k . ! k . V + [ M N] k . ! [ M] (.. ' ..f. [ N] (f k) . ' ) . [ µa.c] k . ! ([[c] .)[k/a] [ \nµ btp c] k . ! [ c] (k .) [[[ btp] M] . ! [ M] (.k. k) . [[[a]M] . ! [ M] a . Figure 7. Call-by-value \nCPS translation of .µ b tp Wegivein Figure7a continuation-passing-style (CPS) seman­tics in Fischer style \n(see Fischer 1972) for call-by-value .µ b tp. Ari­olaetal.(2007))showedthatthisCPS translationcanbefactorised \n(up to currying and .-conversion)asthe composition .rstofastate­passing-style transformation to call-by-value \n.µ with subtraction, then of a standard call-by-value CPS translation to .-calculus with pairs. 3.5 Equational \ncorrespondence with Kameyama and Hasegawa s axiomatisation of a calculus with shift and reset Danvy and \nFilinski originally de.ned the operators shift and reset by their continuation-passing-style semantics.Weshowinthis \nsec­tion that call-by-value .µ b tp contains shift and resetin the sense that theycontain operators of \nwhich the CPS semantics is the de.ning semantics of shift and reset. In a second step, we show that call-by-value \n.µ b tp contains no more than call-by-value .-calculus extended with shift and reset. This is shown by \nexhibiting an equational correspondence with Kameyama and Hasegawa s theory of call-by-value .-calculus \nwith shift and reset, a theory known to exactly capture the CPS semantics of .-calculus with shift and \nreset (Kameyama and Hasegawa 2003). The operators shift and reset are de.ned as follows: S M tp](M .x.µ \nb µa.[ btp.[a]x) \\M) tp.[ b µ btp]M The justi.cation that these encodings de.ne shift and reset is given \nby the following proposition taken from Ariola et al. (2007): PROPOSITION 3 (Simulationofshift and reset \nin .µ b tp). The CPS semantics of S M and \\M) are: [ S (.q. M)]] k. =[ M] [.k ' .... k (k ' .)/q](.k.k) \n. [ \\M )] k. =[ M] (.k.k)(k.) whichcoincide with the de.ning CPS semantics of shift and reset in Danvy \nandFilinski (1989). Let now(.S , = KH ) be .-calculus equipped with shift and reset and with the axiomatics \nof Kameyama and Hasegawa (2003). Let (.µ btp equipped with the axioms given tp, =) be call-by-value .µ \nbin Figure 5. Let .µtpb0 be the subset of expressions of .µ b tp that do not contain free continuation \nvariables.We de.ne (.µ b0 , =) tp as the restriction of (.µ btp 0 tp, =) to the expressions of .µ b. \nThe interpretation of .µ b tp in Kameyama and Hasegawa s cal­culus works as follows: each continuation \nvariable a is injectively mapped to a fresh ordinary variable ka, µ btp]t is interpreted tp.[ bas \\M), \nµtpb.[a]t as \\ka M), µa.[ß]M as S(.ka.kß M) and µa.[ b tp]M as S(.ka.M). The next theorem expresses the \nequa­tional correspondence (in the sense of Sabry and Felleisen 1993) between call-by-value .µ b0 and \nKameyama and Hasegawa s cal­ tp culus: THEOREM 4 (Ariola et al. 2007). The theories (.S , = KH ) and \n(.µ b0 , =) are isomorphic. tp COROLLARY 5 (Ariola et al. 2007). The theory (.µ b tp, =) is com­plete \nwithrespectto ß and . through the CPS semantics of call-by­value .µ b tp. The addition of a continuation \ndelimiter was used in Sitaram and Felleisen (1990) to recover some completeness property that was lost \nin the move from .-calculus to .C-calculus. Our analysis of Saurin s separability result for call-by-name \n.µ in Section 4.3 shows thatB¨ ohm s theorem, which amounts to observational com­pleteness for normal \nterms, is also recovered by the addition of a continuation delimiter. This suggests the following conjecture: \nCONJECTURE 6. The theory (.µ bohm s theorem, tp, =) satis.esB¨i.e., for any equationally distinct closed \nnormal forms M and N, there is a context Dv[[q]Evtp.Dv[M])] = x ] suchthat µ b[[q](Evand µ b tp.Dv[[q](Ev[N])] \n= y.  3.6 Operational semantics The operational semantics in natural style is characterised by a deterministic \napplication of the reduction rules at the head of a computation (so-called weak-head reduction). It is \ncommon to formulate the operational semantics on terms but we rather do it on commands what allows for \na more uniform characterisation of normal forms. Typically, when formulated on terms, a term like µa.[a]V \ncan be reduced further to V only if a does not occur in V but it cannot be reduced further if a does \noccur. To the contrary, if the same term is reduced as part of a command, as in [ß]µa.[a]V , then the \nresulting command uniformly reduces to [ß](V [ß/a]) independently of whether a occurs or not in V . The \noperational semantics, that we do not only de.ne on closed terms asitis commonbut also on terms with \nfreevariables,isgivenby the equations: ß : Dv[[q]Ev[(.x.M) V ]] . Dv[[q]Ev[M[V/x]]] µv : Dv[[q]Ev[µß.c]] \n. Dv[c[[q]Ev/ß]] .bDv[[q]Ev[µ btp]V ]] . Dv[[q]Ev[V ]] tp : tp.[ b Obviously . is included in . of which \nit constitutes on com­mandsa convenientlevelof abstraction.We say that c is a weak­head normal command \nif for no c ' , c . c '. Weak-head normal commands are either of the form [ b[[a]V ], tp]V , or of the \nform Dvor of the form Dv[[q]Ev[xV ]]. Operational semantics can be also described by using an ab­stract \nmachine. Evaluation in an abstract machine is closely re­lated to cut-elimination in Gentzen ssequent \ncalculus (see e.g. Her­belin 1995, 1997; Danos et al. 1996) while, contrastingly, oper­ational semantics \nin natural style is related to Gentzen s natu­ral deduction. Sequent calculus proofs can be represented \nin .µµe­calculus (Curien and Herbelin 2000; Herbelin 2005) extended with K ::= q[e] | M[e] · K | µ o.\\W \nI o · K) (evaluation contexts) [S] ::= tp = K; S] [] | [ b(dynamic environment) W ::= V [e] (closure \nof value) [e] ::= [] | [x = W ; e] | [a = K; e] (environments) s ::= \\W || K)cont [S] | \\M [e] || K)eval \n[S] | \\V [e] || W · K)logic [S] (states) \\W \\W \\W \\W \\W \\W \\V \\MN \\µa.[q]M \\µ b tp.[q]M \\.x.M \\x \\x \nFigure 8. Speci.c components of the abstract machine for call-by-value .µ b tp-calculus Control owned \nby the evaluation context || N[e] · K )cont [S] .\\N [e] || µ o.\\W I o · K))eval || µ o.\\V [e] I o · K))cont \n[S] .\\V [e] || W · K )logic || b)cont [ b.\\W || K )cont tp[e] tp = K; S] || a[e] )cont [S] .\\W || K )cont \n|| tpb[e] )cont [] . stop on [ b tp]W || a[e] )cont [S] . stop on S [[a]W ] Control owned by the term \n[e] || K )eval [S] .\\V [e] || K )cont [e] || K )eval [S] .\\M [e] || N[e] · K )eval  [e] || K )eval \n[S] .\\M [a = K; e] || q[a = K; e] )eval [e] || K )eval [S] .\\M [e] || q[e] )eval  Controlownedby thevalue \n[e] || W · K )logic [S] .\\M [x = W ; e] || K )eval [e] || W · K )logic [S] .\\V [e ' ] || W · K )logic \n[e] || W · K )logic [S] . stop on S [K [xW ]] To evaluateM, the machine starts with the following initial \nstate: \\M [] || b tp[])eval [] [S] [S] [S] [S] if e(a)= K  if a not bound in e [S] [S] [S] [ b \ntp = K; S] [S] [S] if e(x)= V [e ' ] if x not bound in e  Figure 9. Abstract machine for call-by-value \n.µ b tp acalculusofexplicit substitutions(seee.g. Herbelin2001)to repre­sent closures and environments, \nin the spirit of Hardin et al. (1996). The language of the abstract machine for call-by-value .µ b tp \nis showninFigure8andthe reductionstepsaregiveninFigure9.The syntax for evaluation contexts and states \nis reminiscent of .µµe­calculus. Stacks are identi.ed with evaluation contexts. The con­struction q[e] \nrefers to the continuation bound to q in the environ­ment e. The construction M[e] · K denotes the continuation \nwhich .rst applies M[e] before continuing with continuation K. The con­struction µ o.\\V [e] I o · K) \ndenotes the continuation that binds to o the current result, say W , so that computation continues with \ncode V in environment e and continuation W ·K. The construction \\M I K) denotes the interaction of a \nterm M in context K. This construction comes in three .avours. In \\M [e] || K)eval [S], the term M in \nenvironment e has the control on what is going next. At some point of the evaluation process, the term \ngets evaluated and the control is transfered to the evaluation context. This cor­responds to a state \n\\W || K)cont [S]. At some point, both the termandtheevaluation context arein evaluated formanda log­ical \ninteraction happens. This corresponds to states of the form \\V [e] || W · K)logic [S]. Speci.c evaluation \nrules correspond to eachof these differentstates.We write e(a) for the binding of a in e and similarly \nfor e(x). The dynamically bound variables are bound in an environment S that remains global (it is not \nstored in breferred to, not only the continuation bound to b closures). Note that when the dynamic continuation \nvariable tp is tp is restoredbut the binding is removed so that the next call to b tp will refer to the \nnext binding of the global environment. Observe that the abstract machine is designed to return the weak-head \nnormal form not only of closed programs but also of terms with free variables (see the stop transitions). \nFinal result reconstruction in terminal states turns explicit substitutions into ef­fective substitutions. \nResult reconstruction turns closures of values into ordinary values. It also uses the operation S thatbuilds \ncon­texts for command of the form Dv and the operation K thatbuilds contextsof theform [q]Ev. These operations \nare de.nedbythe fol­ lowing clauses: [a[e]] K if e(a) = K [a[e]] [a](D) otherwise [ btp[e]] [ btp](D) \n(M[e] · K) K [D M[e] ] ( µo.\\W I o · K)) K [W D] [ ] D [ btp = K; S] S [K [µ btp.D]] M[x = W ; e] \n M[W /x][e] M[a = K; e] M[K /a][e] PROPOSITION 7. If c isaweak-head normal form, then, [ b tp]M. c \niff the evaluation starting from \\M [] || b tp[])eval [] stops with result c. To make a comparison with \nthe operational semantics of shift and reset given in Biernacka et al. (2003), we show how (the encoding \nof) shift and reset in .µ b tp operationally reduce on closed terms. Using the abbreviation Cv ::= Dv[[ \nb tp]Ev], we get: Cv[\\Ev[S(.k.M)])] . Cv[\\M[.x.\\Ev[x])/k])] Cv[\\V )]] . Cv[V ] which coincide with the \nrules (S.) and (val) in Biernacka et al. (2003, Section 4.4) through the identi.cationof C2# with Dv \nand of C1 with, [ bif in position of context, or .x.\\Ev[x]) if in tp]Ev position of term. As for the \nrules (ß.) and (ßctx ) in Biernacka et al. (2003) theyboth are instances of (ß).  3.7 Expressiveness \nCall-by-value .µ b tp is .ne-grained enough to directly simulate the operational semantics of most standard \ncontrol operators. Let C and A be Felleisen s C and abort operators4. Let call/cc be the implementation \nof call-cc in Scheme. Let M handle patterns and raise M be the constructions of the exception mechanism \nin SML (i.e. of try M with patterns and raise M in O Caml). Let Val be a special exception with one argument. \nIn addition to the de.nition of S M and \\M) above, we have the following encodings: A M µ .[ btp]M C \n(.k.M ) µak.[ btp](M .x.µ .[ak]x) call/cc (.k.M) µak.[ak](M .x.µ .[ak]x) raise M µ .[ btp]M M handle \npatterns case µ btp.[ btp](Val M) of | Val x . x | patterns | x . µ .[ btp]x Let us show for instance \nhow the operational semantics of Scheme s call/cc is faithfully simulated5. Thanks to structural substitution, \nwe have: Ev[call/cc .k.M] . Ev[M[.x.A Ev[x]/k]] while any other encoding from C (e.g. call/cc (.k.M) \nC(.k.k M))or from S (e.g. call/cc (.k.M) S(.k.k M ' ) with M ' M[.x.A (kx)/k])would give the following \nwrong semantics: Ev[call/cc .k.M] . (.x.A Ev[x]) M[.x.A Ev[x]/k] . Structural substitution also brings \nnew behaviours. Here are a few examples: (i): µa.[a](... µ.[a]M ... µ.[a]M ' ...) (ii): µa.[ bµ b... \ntp.[a]M ' tp](... tp.[a]Mµ b...) (iii): µa.[ bµ b... µ.[a]M ' ...) tp](... tp.[a]M (iv): µa.[ bµß.[a](... \n... ' ...) tp](... [ß]M [a]M ...) 4As usual, A can be used itself to simulate break or return in imperative \nlanguage, assuming that a () marker has been inserted around the related block. 5Note that the SML variant \nof call/cc is not directly simulatable as it rei.es the whole undelimited continuation including theexception \nhandlers, which would mean that .µ b tp semantics would have to support the capture of the µ b tp markers, \nwhat it does not. Hence, only the Scheme s variant of call/cc, which does not interfere with exception \nhandling, is simulatable. Example (i) is an optimised variant of call/cc that does not need to wait that \nthe argument of the continuation is evaluated be­fore to reinstall the continuation (compare (.x.µ .[a]x) \nM with µ.[a]M). Example (ii) is a similarly optimised variant of shift. Example (iii) is anhybrid operator \nwhichis compositional on the left call to a (like shift)and abortive on the right call toa (like C). \nFinally, example (iv) shows how a call to continuation a in the body of a call to another control operator \ncan be contracted (compare µß.[ b tp]((.x.µ [a]x) M), as in, e.g., the interpretation of S(.kß .ka M), \nwith µß.[a]M). More generally, see Ariola and Herbelin (2007) for an analysis of the advantages of structural \nsub­stitution of evaluation contexts over substitution of continuations as regular functions. Thanks \nto Filinski s result on the ability of shift and reset to en­code monads (Filinski 1994), one can also \nsimulate, as anexample, reading and writing to a memory cell: read .().µa.[ btp.[a]s) s) tp].s.((µ bwrite \n.s.µa.[ btp.[a]()) s) tp]..((µ b so that the code (µ btp]M) which may refer to read and tp.[ bv0 write \nbehaves as a program M reading and writing to a global memory cell initialised to value v0. 4. Call-by-Name \n.µ ttp-Calculus In this section we introduce a call-by-name variant of .µ b tp. We formalise a reduction \nsemantics, an equational theory, a system of simple types, a continuation-passing-style semantics and \nan oper­ational semantics. Call-by-name .µ b tp is an extension of .µ that we show to be isomorphic to \n.µ. From the programming point of view, call-by-name .µ b tp, is a bizarre calculus. In an attempt to \nclarifyhowit behaves, we end the sectionby anexample. 4.1 Syntax and reduction rules The syntax of .µ \nb tp was given in Figure 3. The reduction rules of the call-by-name variant of .µ b tp are in Figure \n10. Theyextend the reduction rules of .µ in Figure1by one rule, called (.b), that is tp similar to the \nequation (.µ) but without anyconstraints on whether b tp occurs or not in M. ß :(.x. M) N . M [N/x] µapp \n:(µa. c) M . µß.c[[ß](D M)/a] ß fresh µ n :[ß]µa.c . c[ß/a] var .n µ btp] M tp occurs in M tpb: tp.[ \nb. M even if b Figure 10. Reductions of call-by-name .µ b tp We say that a term or a command is normal \nif it contains no redex. Call-by-name evaluation contexts are de.ned as follows: En ::= D | En[D M] (linear \neval. contexts) Dn ::= tp.D]] D | Dn[[a]En[µ b(nested linear eval. context) Call-by-nameevaluation contexts \nare called linear because theydo not erase nor duplicate the term theyexpect in their hole. An analysis \nof the syntax and rules shows that a form of unique context lemma holds: anycommand with a as only free \nvariable is either of the form Dn[[a].x.M], or of the form [ b tp]M, or, of the form Dn[[a](En[M])] with \neither M or [a](En[M]) a redex. This isinfacta curious result: b tp blocks the reduction and there is \nnot much hope to compute something interesting without at least one free continuation variable at hand. \n 4.2 Equational theory The equational theory of call-by-name .µ b tp extends the equational theory of \n.µ with (µb) (an analog of the rule (µvar ) for the special tp b continuation tp) and with (.b) seen \nas equation. It is given in tp Figure 11. ß :(.x.M) N = M[N/x] µn :[ß](En[µa.c]) = c[[ß]En/a] .µ : µa.[a]M \n= M if a not free in M . : .x.(Mx)= M if x not free in M µbtp]µ b= tp :[ btp.c c .btp.[ b= tp : µ btp]MM \nFigure 11. Equational theory of call-by-name .µ btp-calculus 4.3 Equational correspondence with .µ The \ncalculus .µ is derived from .µ by relaxing the syntax and keeping the same theory.We now show how.µ can \nbe contrast­ingly restatedasastrictextensionof .µ. Thisextensionis precisely our call-by-name variant \nof .µ b tp. Embedding of .µ into call-by-name .µ bAnaive way to inter­ tp pret .µ in .µ, actually in \nits extension .µ b tp, is to interpret any .µ-term µa.M as the .µ-term µa.[ b tp]M and to interpret any.µ­term \n[a]M as the .µ-term µ b tp.[a]M.Formally, this corresponds to the following embedding . of .µ into .µ \nb tp: .(x) x .(.x.M) .x..(M) .(MN) .(M) .(N) .(µa.M) µa.[ b tp].(M) .([a]M ) µ b tp.[a].(M) This translation \nis not de.ned on continuation variables, since theyare not part of the formal syntax. Nevertheless we \ncan derive the following property: LEMMA 8. .(M[ß/a]) = .(M)[ß/a] We then check that all rules of.µ can \nbe simulated in .µ, all but the(µvar )rule. Indeed, .([ß]µa.M) = tp.[ß]µa.[ b µ btp].(M) .µvar µ btp].(M)[ß/a] \ntp.[ b= µ btp].(M[ß/a]) tp.[ b butµ btp]..(M[ß/a]) has no reason to be equal to .(M[ß/a]) tp.[ bin .µ. \nThis is actually expected since .µ is observationally com­plete for normal termsbut .µ is not.However,in \ntheextended cal­culus .µ b tp, this equality holds. Indeed, we now have: PROPOSITION 9. If M = N in .µ \nthen .(M) = .(N) in .µ b tp. Embedding of call-by-name .µ bWe now want totp into .µ show that our call-by-name \n.µ btp) tp, i.e. .µ extended with rules (µband (.b), is indeed equivalent to .µ. Let us de.ne the following \ntp converse translation: S(x) x S(.x.M) .x.S(M) S(MN ) S(M ) S(N) S(µa.[ß]M) µa.([ß]S(M)) S(µa.[ bµa.(S(M)) \ntp]M) S(µ b[a]S(M) tp.[a]M) S(µ btp]M) tp.[ bS(M ) PROPOSITION 10. If M = N in call-by-name .µ b tp,thenS(M)= \nS(N) in .µ. X . TypeConstants A, B ::= X | AS . B G ::= Ø| G,x : AS . ::= Ø| .,a : A S, . ::= .| A · \nS Ax G,x : AS fS x : A;. G,x : AS f. M :B;. .i G f. .x.M :(AS . B); . G f. M :(AS . B);. G fS N : A;. \n.e G f. MN : B;. G fS c :. ;.,a :A G fA·S c:. ;. G fS µa.c :A;. G fS µ b tp.c: A;. G fS M : A;.,a : A \nG fS M :A;. G fS [a]M :. ;.,a : A G fA·S [ b tp]M :. ;. Figure 12. Simple typing of call-by-name .µ btp-calculus \nSince moreover, S(.(M)) = M and .(S(M)) = M (using (µb)), we get: tp THEOREM 11 (Equational correspondence). \n.µ equipped with the equations of Figure 2 and call-by-name .µ b tp equipped with the equationsofFigure11 \nequationally correspond. REMARK: Call-by-name .µ b tp and .µ form more than an equa­tional correspondence: \ntheir reduction systems are also bisimilar: M. N iff.(M). .(N) and S(M). S(N) iffM. N. In par­ticular, \nnormal forms match. Observational completeness of normal forms in .µ bAs a con­ tp sequence of the isomorphism, \nwe have: COROLLARY 12. Call-by-name .µ b tp is observationally complete for closed normal forms, i.e. \nfor any closed normal forms M and N not equal in call-by-name .µ b tp, there exists an evalua­tion context \nDn, such that, in .µ btp.Dn[[ b= x and tp, µ btp]M] µ btp[N]] = y for x and y arbitrary fresh variables. \ntp.Dn[[ b Interestingly, this shows that ifB¨ohm s theorem in .µ (Theo­rem2)was apparently obtainedbyallowing \nmore contexts (namely contexts of the form D [a]M)which were not allowedinParigot s syntax,itis alternatively \nobtainedbyaddingnotonlymorecontexts butby adding new rules that were hiddenby thefact that.µ and .µ apparently \nshare the same rules. One may wonder whether the equational theory of call-by­name .µ b tp is complete \nwith respect to its CPS semantics. This is answered positively in Section 4.5.  4.4 Simple typing We \npropose a system of simple types for call-by-name.µ b tp. Like for typing .µ,wehavetwokindsofsequents, \noneforeach category of expressions: G fS M : A;. (for terms) G fS c :. ;. (for commands) Like for .µ, \nwe have a context of hypotheses G that assigns types to term variables and a context of conclusions . \nthat assigns types to continuation variables. But we have also to take care of the µ b tp dynamic binder. \nLikefor Ariola et al sadaptation to call-by-value .µ b tp of Danvy and Filinski s typing system in Section \n3.3, we have an extra data to type the dynamic effects. Each use of µ b tp pushes the current continuation \non a stack of dynamically bound continuations. Each call to b tp pops the top continuation from this \nstack. To the contrary of Ariola et al s typing system, the extra infor­mation needed to type the dynamic \nbinding is not a single formula but the ordered listS of the types of the continuations present in the \nstack. Like for Ariola et al s typing system, functions can encapsulate occurrences of b tp that may \nbe called in a different typing context than the one that was active at the time µ b tp was typed.For \ntype consistency, arrows have to remember the types of the dynamic continuation stack that the calls \nb to tp expect to see. We write AS . B for an arrow annotated with the list S of effect types. To the \ncontrary of Ariola et al s typing system, calls to b tp are associated to terms and hence effects are \nassigned to the types of G rather than to the types of .. The typing system is given in Figure 12. Avery \nsimilar systemof simple types has beengivenby Saurin (2007) on top of .µ. In .µ, judgements G fS c :. \n;. are absent since there are no commands in the calculus. Judgements G fS M : A;. are written G, . f \nM : A . S. Moreover, A1 · ... · An is written A1 . ... . An . o and AS . B is written (A . S) . B. Intuitively, \nA . B denotes a term that returns an object of type B when applied to a linear evaluation context of \ntype A (astream in Saurin sterminology). Logically,the type A . B is equivalent to ¬A . B,wherethe useofanegation \nemphasises that ¬A is the type of an evaluation context expecting an argument of type A. Hence, A . B \nis logically equivalent to a disjunction. Note that because . isa connectivein Saurin s typing system, \na conversion rule from ((A . S) . B) . . to (A . S) . (B . .) is needed to type abstraction and application. \nThis latter conversion rule has no computational content. In order to prove subject reduction of the \ntype system in Fig­ure 12 we state two auxiliary lemmas (Generation and Substitution Lemma). LEMMA 13 \n(Generation Lemma). 1. G,x : AS f. x : B;. implies . = S and B = A. 2. G f. .x.M : C;. implies C = AS \n. B and G,x : AS f. M : B;.. 3. G f. MN : B;. implies G f. M : AS . B;. and G fS N : A;. for some A and \nS. 4. G fS µa.c : A;. implies G fS c:. ;.,a : A. 5. G fS [a]M : A;. implies . = . ' ,a : A and G fS \nM :. ;.. 6. G fS µ b tp.c : A;. implies G fA·S c:. ;.. 7. G f. [ b  tp]c :. ;. implies . = A · S \nand G fS M : A;.. LEMMA 14 (Substitution lemma). 1. Let G,x : AS f. M : B;. and G fS N :A;.. Then G f. \nM[N/x]: B;.. 2. Let G f. c :. ;.,a : AS . B and G fS N : A;. and let ß be a fresh variable. Then G f. \nc[ß(D N)/a]:. ;.,ß : B. 3. Let G fS c :. ;.,a : A, ß : A. Then G fS c[ß/a]:. ;.,ß :  A. Subject reduction \nfollows directly. PROPOSITION 15 (Subject reduction). (i) If G fS M : A;. and M . N, then G fS N : A;.. \n (ii) If G fS c:. ;. and c . c ', then G fS c ' :. ;..  4.5 Continuation-passing-style semantics De \nGroote (1994) de.ned a CPS transformation to .-calculus for .µ.We give here an alternative CPS transformation \nthat is based ona call-by-nameCPS translationto .-calculus with pairs (Lafont, Reus, and Streicher 1993). \nThe .-calculus with pairs is de.ned by the syntax M ::= x | .x.M | MM | (M, M) | let (y, x)= M in M and \nwe use .(x, y).t as an abbreviation for .z.let (x, y)= z in t for z fresh. In addition to (ß) and (.), \nthe calculus comes with the following reduction rules: . : let (x, y)=(M, N) in M ' . M ' [N/y; M/x] \n.lift :F [let (x, y)= M in N] . let (x, y)= M in F [N] .. : let (x, y)= M in (x, y) . M for F ::= D N \n| let (x, y)= D in M. We assume to have an injectionka from continuation variables to term variables. \nThe CPS transformation is shown in Figure 13. To the exception of some uses of .-conversion, it differs \nfrom de Groote s transformation on .µ only in the application and abstraction cases. * xx (.x.M) * .(x, \nk).M* k (MN) * .k.M* (N*,k) * (µa.c) * .ka.c ([a]M) * M* ka * * (µ b tp.c) c * ([ bM* tp]M) Figure 13. \nCall-by-name CPS translation of .µ b tp The CPS transformation is compatible with the type system. Indeed, \nif we de.ne the following transformation on types: X- ¬X (AS . B)- AS+ . B- AS+ A- . S+ .+ . (A · S)+ \nA- . S+ (Ø)+ Ø G++ (G,x : AS)+ ,x : AS (Ø)- Ø (.,a : A)- .-,a : A- (G fS M : A; .)+ G+ , .- f M * : \nA- . S+ (G fS c :. ; .)+ G+ , .- f c * :S+ then, we get the following compatibility result: PROPOSITION \n16. (i) If G fS M : A;. then (G fS M :A; .)+ . (ii) If G fS c :. ;. then (G fS c :. ; .)+ .  Unfortunately, \nthe CPS above does not simulate the reduction. As it is common, we would have needed a CPS that takes \ncare of administrative redexto geta simulation result. Still, the CPS above is compatible with equality \nin the .-calculus with pairs: PROPOSITION 17. If M . N then M * = N * . We can also state a completeness \nresult (this is an adaptation of standard proofs, see e.g. de Groote 1994; Fujita 2003): PROPOSITION \n18. If M * N * then M = N. =ß...lift .. REMARK: In the very same way as for call-by-value .µ b tp, the \ncall-by-name CPS translation canbefactorised as the composition .rst of a state-passing-style transformation \nto call-by-name .µ extended with an asymmetric disjunction (becausethe typeeffects in call-by-name .µ \nb tp naturally take the form of an asymmetric disjunction; for asymmetric disjunction, see Pym and Ritter \n2001), thenofa call-by-nameCPS translationtothe .-calculus with pairs. 4.6 Operational semantics We \n.rst give the operational semantics of call-by-name.µ b tp as a set of reduction rules applicable to \nthe term as a whole. This kind of operational semantics in natural style is de.ned on commands by the \nfollowing rules: ß : Dn[[a]En[(.x.M) N]] . Dn[[a]En[M[N/x]]] µn : Dn[[a]En[µß.c]] . Dn[c[[a]En/ß]] .n \nb: Dn[[a]En[µ btp]M]] . Dn[[a]En[M]] tp tp.[ b As in the call-by-value case, . is included in . of which \nit constitutes on commands a level of abstraction. We say that c is a weak-head normal command if for \nno c ' , c . c '. Weak-head normal commands are either of the form [ b tp]M, or of the form Dn[[a]En[x]] \nor of the form Dn[[a].x.M]. We then present the operational semantics by means of a call­by-name abstract \nmachine. The language of the abstract machine for call-by-name is shown in Figure 14 and the reduction \nsteps are given in Figure 15. As for the call-by-value machine in Section 3, the language of the machine \nis an extension with explicit environ­ments of the language of .µ b tp. To initiate the computation, \nwe need an extra constant of evaluation context that we write E. As in the call-by-value machine, the \nevaluation rules are split into three categories. However, the control is .rst owned by the evaluation \ncontext, so that the logical steps are controlled not by thevaluebutby the linearevaluation context. \nFinal result recon­struction in terminalstates uses almost the same operations as for the call-by-value \nmachine. [a[e]] L if e(a)= L [a[e]] [a](D) otherwise (M[e] · L) L [D M[e] ] [] D [tpb= L; S] S [L [µ \nb tp.D]] M[x = N[e ' ]; e] M[N[e ' ] /x][e] M[a = L; e] M[L /a][e] PROPOSITION 19. If c isaweak-head \nnormal form, then, [E]M. c iffthe evaluation starting from \\M [] || E[])eval [] stops with re­sult c. \n 4.7 An example How does call-by-name .µ b tp behave on standard examples that uses delimited control?We \nconsider theexampleof list traversal that Biernacki and Danvy (2005) used to emphasise the differences \nbetween operator F (Felleisen 1988) and shift. We extend .µ b tp with a .xpoint operator, list constructors \nand a list destructor: M, N ::= ... | .x.M | [] | M::N | if M is x::y then M else M and we extend call-by-name \nreduction with the rules .x.M . M [.x.M/x] if [] is x::y then M2 else M1 . M1 if M::N is x::y then M2 \nelse M1 . M2[M/x][N/y] if µa.c is x::y then M2 else M1 . µa.c[[a](if D is x::y then M2 else M1)/a] In \ninformal ML syntax, the example is the following let traverse l = let rec visit l = match l with | [] \n-> [] | a::l -> visit (shift (fun k -> a :: k l )) in reset (visit l) in traverse [1;2;3] Translated \ninto.µ, it gives v (n1::n2::n3::[]) where v is .f .(.l.if l is a::l ' then f (µa.a::[a]l ' ) else []). \nTranslated into.µ bv is tp, .f .(.l.if l is a::l ' then f (µa.[ btp.[a]l ' tp]a::µ b) else []) . Let \n. be an arbitrary continuation distinct from b tp.We write li for ni:: ... ::n3::[].We list the steps \nof the reduction of [E](vl1): [E]vl1 . [E](.l.if l is a::l ' then v (µa.a::[a]l ' ) else []) l1 . [E]if \nl1 is a::l ' then v (µa.a::[a]l ' ) else []) . [E]v (µa.n1::[a]l2)  . if (µa.n1::[a]l2) is a::l ' then \nv (µa.a::[a]l ' ) else [] . [E]µa.n1::[a](if l2 is a::l ' then v (µa.a::[a]l ' ) else []) . n1::[E](if \nl2 is a::l ' then v (µa.a::[a]l ' ) else []) . n1::[E](v (µa.n2::[a]l3))  . n1::[E](µa.n2::[a](vl3)) \n . n1::n2::[E](vl3) . n1::n2::[E](µa.n3::[a](v [])) . n1::n2::n3::[E](v []) . n1::n2::n3::[E][]  \nOtherwise said, the list traversal program copies its argument and shifts its continuation to the tail \nof the list. 5. Discussion on a General Framework for Calculi of Delimited Continuations Wereviewbelowtwovariantsofthe \noriginal calculuswithshift and reset.Together with .µ, we then obtain four calculi of delimited continuations.We \nshowhow these four calculi are related. Lazy reset A variant of call-by-value .µ b tp can be obtained \nby considering that terms of the form µ b tp.c arevalues.In this case, one obtains a calculus equivalent \nto the .-calculus with shift and lazy reset,a calculus for which Sabrygave an axiomatisation complete \nwith respect to its CPS semantics (Sabry 1996). Call-by-name shift/reset with lazy toplevel continuation \nThe .rst author onceaskedOlivierDanvy:Whatwouldbea canonical call-by-namevariantof the shift/resetcalculus? \nO. Danvy answered by an abstract machine that modi.es the pure .-calculus part of the machine for shift/reset \nin Biernacka et al. (2003) so that it behaves in call-by-name discipline. Expressed in the language of \n.µ b tp, the resulting calculus differs from the call-by-name variant of .µ b tp studied in the paper \nin that the rules (µvar ) and (.b) are now those tp of call-by-value .µ b tp: µvar :[q]µa.c . c[q/a] \n.bµ btp] V . V tp : tp.[ b Otherwise said, in this lazy call-by-name variant of .µ b tp, the toplevel \ncontinuation behaves asa regular linearevaluation context and it is captured by µa.c as the regular pieces \nof linear evaluation contexts D M, V D and [ß] D are. K ::= tp[e] | L b(evaluation contexts) L ::= a[e] \n| M[e] · L (linear evaluation contexts) [S] ::= tp = L; S] [] | [ b(dynamic environment) [e] ::= [] \n| [x = M[e]; e] | [a = L; e] (environments) s ::= \\M[e] || K)cont [S] | \\M [e] || L)eval [S] | \\.x.M[e] \n|| L)logic [S] (states) Figure 14. Speci.c components of the abstract machine for call-by-name .µ btp-calculus \nControl owned by the evaluation context \\M[e] || L )cont [S] .\\M [e] || L )eval [S] tp[e )cont [ b[e] \n)eval \\M[e] || b' ] tp = L; S] .\\M || L [S] \\M[e] || b' ] )cont [] . tp]M[e] tp[e stop on [ b Control \nowned by the term \\x [e] || L )eval [S] .\\M [e ' ] || L )eval [S] if e(x)= M[e ' ] \\.x.M [e] || L )eval \n[S] .\\.x.M[e] || L )logic [S] \\MN [e] || L )eval [S] .\\M [e] || N[e] · L )eval [S] \\µa.[q]M [e] || L \n)eval [S] .\\M[a = L; e] || q[a = L; e] )cont [S] \\µ b[e] || L [S] .\\M[e] || q[e] )cont tp = L; S] tp.[q]M \n)eval [ b\\x [e] || L )eval [S] . stop on S [L [x]] if x not bound in e Controlownedby the linearevaluation \ncontext '' '' \\.x.M[e] || M [e ] · L )logic [S] .\\M [x = M [e ]; e] || L )eval [S] \\.x.M[e] || a[e ' \n] )logic [S] .\\.x.M[e] || L )logic [S] if e ' (a)= L \\.x.M[e] || a[e ' ] )logic [S] . stop on S [[a](.x.M[e] \n)] if a not bound in e ' To evaluateM, we need a linear toplevel free variables distinct from b tp (which \nis not linear). Let E be this variable. Then, the machine starts with the following initial state: \\M \n[] || E[])eval [] Figure 15. Abstract machine for call-by-name .µ btp-calculus Fundamental critical pair \nof computation (.x.t)(µa.c) , (CBV) (CBN) . (ßv)+(µapp )+(µ ' )+(µvar )+(.b)(ß)+(µapp)+(µ n )+(.b) apptpvar \ntp subsidiary choice subsidiary choice (.x.t)(µ btp]µa.c tp.c)[ b n tp not value) moved to µvar ) , \ntp tp ) (µtpbvalue) ,. (µ b(µ. (.bmoved to .n var b shift/lazy reset shift/reset CBN shift/reset .µ \n(Sabry) (Danvy-Filinski) (Danvy) (de-Groote Saurin) CPS completion (Sabry) CPS completion (Kameyama-Hasegawa) \nohm-completion (Saurin) B¨typed domain -completion (Sitaram-Felleisen) Figure 16. Calculiof delimited \ncontinuations -a classi.cation The four calculi of delimited continuations The four calculi of In each \nvariant, a subsidiary choice has to be made to decide if delimited continuations are classi.ed in Figure \n16. µ btp behaves like a linear continuation tp is a value or not and if bChoosing between call-by-name \nand call-by-value amounts to variable or not. decide the fundamental dilemma of computation (as emphasised, \nIn call-by-value,theextra criticalpairis (.x.t)(µ btp.c tp.c). If µ be.g., in Curien and Herbelin 2000). \nChoosing call-by-value requires is considered as non evaluated, the call-by-value discipline expects \nto restrict ß-reduction into ßv-reduction and to add a rule (µapp' ) that priorityisgiventoitand one \nobtainsthe original shift and reset forincremental substitutionofthenewkindof context (.x.M) D. calculus \nfrom Danvy and Filinski. If otherwise µ b tp.c is considered asevaluated,ityieldsits prioritytoitsevaluation \ncontext,i.e.tothe function, and ß is applicable. One then obtains the calculus with lazy reset that was \nstudied in Sabry (1996). In call-by-name, the extra critical pair is [ b tp]µa.c. If priority is given \nto the evaluation context, i.e. b tp, one has .rst to know to what it is bound before to continue the \ncomputation. One then obtains the semantics of .µ. If otherwise b tp is considered as a linear continuation \nvariable, it yields the priority to its argument and its capture is made possible. One then obtains Danvy \ns call-by­name variant of the shift and reset calculus. 6. Conclusions Summary We showed that de Groote \nvariant of .µ-calculus, here called .µ after Saurin, while apparently similar to Parigot s .µ, can be \ninterpreted as an extension of .µ with call-by-name delimited control. Especially, we showed the following \npoints: .µ canbe interpretedasa call-by-namevariantof Ariolaetal s extension of call-by-value .µ with \ndelimited control, namely call-by-value .µ b tp. The abstract machine for .µ relies on a global stack \nfor the dynamic continuation as the abstract machine for call-by-value .µ b tp does. There is a system \nof simple types with effects for .µ for which subject reduction holds. The .µ is a surprising calculus. \nOn one side, its syntax and CPS semantics are very simple, and in particular simpler than the syntax \nand CPS semantics of call-by-value calculi of delimited continuations. On the other side, its canonical \nsystem of types andits operational semanticskeepthe complexityofa calculusof delimited control. The absence \nof an explicit control delimiter in .µ is at .rst glance surprising,but if we admit that the de.nition \nof \\M) is µ btp]M as it is in call-by-value .µ b tp.[ btp,then it is normal that no explicit \\M) is needed \nin .µ since it collapses in call-by­name .µ b tp to an identity operator. Another lesson is that the \nµ operator of .µ is indeed a shift operator6. One could ask whether the syntax of .µ can be used for \ncall-by­value delimited control. The answer is yes if one adds an explicit \\M). Indeed, in .µ extended \nwith \\M), the four combinations µa.[ß]M, µa.[ btp.[a]M and µ btp]M are equivalently tp]M, µ btp.[ bexpressible \nin .µ by µa.[ß]M, µa.M, [a]M and \\M) respec­tively. Section5showed that .µ is not the only call-by-name \ndelimited control. Further investigations into the four different calculi need to be done to better understand \nthe relative strengths of each of the calculi. The separability property in classical logic The .µµe-calculus \nis the calculus of choice to study the kind of duality given in Figure 16. Uniformly investigating the \ncomplete­ness properties of the four calculi and completing the picture in the framework of .µµe-calculus \nwould be interesting. Up to our knowledge, there are no results onB¨ohm s separability property in other \nproof calculi for classical logic.We believe that the sepa­rability property for call-by-name .µ b tp \nwould directly transfer to call-by-name untyped .µµe-calculusbutB¨ohm s separability prop­erty in the \nuntyped call-by-value and in the typed versions of .µµe­calculus are open problems. The question of separability \nin the Dual CalculusWadler (2003)isa topic for future research, as well. 6In passing, this suggests that \nde Groote s use of .µ for representing quan­ti.er scope in linguistic is not sofar from the shift/reset-based \napproach of quanti.er scope by Barker and Shan. An other question is also the investigation ofB¨ohm s \ntheorem in the simply typed fragments of the four calculi (see e.g.B¨ohm s theorem in the simply typed \n.-calculusbyDo.senand Petri´c(2001), Statman (1982), Simpson (1995), Joly (2000)). Finally, howfar the \nstudy ofB ¨ ohm s theorem in call-by-value calculus with control can help for investigating separation \nin Moggi s extension of Plotkin s .v (seePaolini 2001). Acknowledgements We wish to thank Olivier Danvy \nand Alexis Saurin for fruitful discussions we had during thework on this paper. References Zena M. Ariola \nand Hugo Herbelin. Control reduction theories: the bene.t of structural substitution. J. Funct. Program.,2007. \nIncludesaHistorical Noteby Matthias Felleisen.To appear. Zena M. Ariola, Hugo Herbelin, and Amr Sabry. \nAtype-theoretic founda­tion of delimited continuations. Higher Order and Symbolic Computa­tion, 2007. \nTo appear. Kensuke Baba, Sachio Hirokawa, andKen-etsu Fujita. Parallel reduction in type free .µ-calculus. \nElectronic Notes in Theoretical Computer Science, 42:52 66, 2001. Malgorzata Biernacka, Dariusz Biernacki, \nand Olivier Danvy. An opera­tional foundation for delimited continuations. Technical Report 03-41, BRICS, \nUniversity of Aarhus, Denmark, 2003. Dariusz Biernacki and Olivier Danvy. On the dynamic extent of delimited \ncontinuations. Technical Report 05-2, BRICS, University of Aarhus, Denmark, 2005. Pierre-Louis Curien \nand Hugo Herbelin. The duality of computation. In Proceedings of the Fifth ACM SIGPLAN International \nConference on Functional Programming, ICFP 2000, Montreal, Canada, September 18-21, 2000, SIGPLAN Notices \n35(9), pages 233 243. ACM, 2000. ISBN 1-58113-202-6. Vincent Danos, Hugo Herbelin, and Laurent Regnier. \nGame semantics&#38; abstract machines. In Proceedings, 11th Annual IEEE Symposium on Logic in Computer \nScience (LICS 96), pages 394 405. IEEEComputer Society Press, 1996. Olivier Danvy and Andrzej Filinski. \nA functional abstraction of typed contexts. Technical Report 89/12, DIKU, University of Copenhagen, Copenhagen, \nDenmark, August 1989. Ren´eDavidandWalterPy. Lambda-mu-calculusandB¨ohm s theorem. J. Symb. Log., 66(1):407 \n413, 2001. Philippe de Groote. A CPS-translation of the .µ-calculus. In S. Tison, editor, Proceedings \nof the Colloquium on Trees in Algebra and Pro­gramming, CAAP 94, Edinburgh,U.K., April 11-13, 1994, volume \n787 of Lecture Notes in Computer Science, pages 85 99. Springer-Verlag, 1994. ISBN 3-540-57879-X. KostaDo.senand \nZoran Petri´c.ThetypedB¨ohm theorem: ohm teorem. In B¨applications to Computer Science Theory -BOTH 2001 \nCrete, Greece, volume 50(2) of Electronic Notes in Theoretical Computer Science, page 13, 2001. Matthias \nFelleisen. The theory and practice of .rst-class prompts. In Proceedingsofthe 15thACM Symposiumon PrinciplesofProgramming \nLanguages (POPL 88),pages 180 190.ACM Press,NewYork, January 1988. Matthias Felleisen and Daniel Friedman. \nControl operators, the secd ma­chine, and the lambda-calculus. In Formal description of programming concepts-III, \npages 193 217. North-Holland, 1986. Matthias Felleisen, DanielP. Friedman, EugeneKohlbecker, and BruceF. \nDuba. Reasoning with continuations. In First Symposium on Logic and Computer Science, pages 131 141, \n1986. Andrzej Filinski. Representing monads. In Conf. Record 21st ACM SIGPLAN-SIGACT Symp. on Principles \nof Programming Languages, POPL 94,Portland, OR, USA, 17-21Jan. 1994, pages 446 457.ACM Press,NewYork, \n1994. Michael J. Fischer. Lambda-calculus schemata. In Proc.ACM Conference on Proving Assertions About \nPrograms, volume 7(1) of SIGPLAN No­tices, pages 104 109.ACM Press,NewYork, 1972. Ken-etsu Fujita. A \nsound and complete cps-translation for lambda-mu­calculus. In TLCA, pages 120 134, 2003. Timothy G. Grif.n. \nThe formulae-as-types notion of control. In Conf. Record 17th Annual ACM Symp. on Principles of Programming \nLan­guages, POPL 90, San Francisco, CA, USA, 17-19 Jan 1990, pages 47 57.ACM Press,NewYork, 1990. Th´ese \nHardin, Luc Maranget, and BrunoPagano. er`Functional back-ends within the lambda-sigma calculus. In ICFP, \npages 25 33, 1996. Hugo Herbelin. S´equents qu on calcule: de l interpr´etation du calcul dess´equents \ncomme calculde .-termes et comme calcul de strat´egies gagnantes. Th`esede doctorat, Universit´eParis7, \nJanuary 1995. Hugo Herbelin. Games and weak-head reduction for classical PCF. In Philippe de Groote and \nJ. Roger Hindley, editors, Third International Conference on Typed Lambda Calculi and Applications, TLCA \n97, Nancy,France, April 2-4, 1997, Proceedings, volume 1210 of Lecture Notes in Computer Science, pages \n214 230. Springer, 1997. ISBN 3­540-62688-3. Hugo Herbelin. Explicit substitutions and reducibility. \nJournal of Logic and Computation, 11(3):431 451, 2001. Hugo Herbelin. C est maintenant qu on calcule: \nau c ur de la dualit´e. Habilitation `e Paris 11, December a diriger les recherches, Universit´ 2005. \n Gregory F. Johnson. Gl a denotational testbed with continuations and partial continuations as .rst-class \nobjects. In SIGPLAN 87:Papers of the Symposium on Interpreters and interpretive techniques, pages 165 \n176,NewYork,NY, USA, 1987.ACM Press. ISBN 0-89791-235-7. GregoryF. Johnson and Dominic Duggan. Stores \nand partial continuations as .rst-class objectsina language and its environment. In POPL, pages 158 168, \n1988. Thierry Joly. Codages, s´e et repr´eparabilit´esentation de fonctions dans divers .-calculs typ \n´es. Phd thesis, Universit´eParis7, January 2000. Yukiyoshi Kameyama and Masahito Hasegawa. A sound and \ncomplete axiomatization of delimited continuations. In Colin Runciman and Olin Shivers, editors, ProceedingsoftheEighthACM \nSIGPLAN International Conference on Functional Programming, ICFP 2003, Uppsala, Sweden, August 25-29, \n2003,volume 38(9) ofSIGPLAN Notices,pages 177 188. ACM Press,NewYork, 2003. Yves Lafont, Bernhard Reus, \nand Thomas Streicher. Continuations se­mantics or expressing implication by negation. Technical Report \n9321, Ludwig-Maximilians-Universitt, Mnchen, 1993. C.-H. Luke Ong. A semantic view of classical proofs: \ntype-theoretic, categorical, denotational characterizations. In Proceedings of 11th IEEE Annual Symposium \non Logic in Computer Science,pages 230 241. IEEE Computer Society Press, 1996. C.-H. Luke Ong and Charles \nA. Stewart. ACurry-Howard foundation for functional computation with control. In ProceedingsofACM SIGPLAN-SIGACT \nSymposium on Principle of Programming Languages, Paris, January 1997, pages 215 227.ACM Press, 1997. \nLucaPaolini. Call-by-Value separability and computability. In A. Restivo and S. Ronchi dellaRocca, editors, \n7th Italian Conference Theoretical Computer Science, ICTCS 05, volume 2202 of Lecture Notes in Com­puter \nScience, pages 74 89. Springer-Verlag, 2001. Michel Parigot. Lambda-mu-calculus: An algorithmic interpretation \nof classical natural deduction. In LogicProgramming andAutomated Rea­soning: International ConferenceLPAR \n92Proceedings,St.Petersburg, Russia, pages 190 201. Springer-Verlag, 1992. David Pym and Eike Ritter. \nOn the semantics of classical disjunction. Journal of Pure and Applied Algebra, 159:315 338, 2001. Amr \nSabry. Note on axiomatizing the semantics of control operators. Technical Report CIS-TR-96-03, Dept of \nInformation Science, Univ. of Oregon, 1996. Amr Sabry and Matthias Felleisen. Reasoning about programs \nin continuation-passing style. Lisp and Symbolic Computation, 6(3-4): 289 360, 1993. Alexis Saurin. Separation \nwith streams in the .µ-calculus. In Proceedings, 20th Annual IEEE Symposium on Logic in Computer Science \n(LICS 05), pages 356 365. IEEE Computer Society Press, 2005. Alexis Saurin.Typing streamsinthe lambda-mu-calculus.In \n14th Interna­tional Conference on Logic for Programming Arti.cial Intelligence and Reasoning (LPAR 07), \nLecture Notes in Arti.cial Intelligence. Sprin­ger-Verlag, 2007. to appear. Peter Selinger. Control categories \nand duality: on the categorical seman­tics of the lambda-mu calculus. Mathematical Structures in Computer \nScience, 11(2):207 260, 2001. Chung-chieh Shan. Shift to control. In Olin Shivers and OscarWaddell, editors, \nProceedings of the 5th workshop on Scheme and Functional Programming, pages 99 107, 2004. Alex K. Simpson. \nCategorical completeness results for simply typed lambda calculus. In M. Dezani-Ciancaglini and G. Plotkin, \neditors, Typed Lambda Calculus and Applications TLCA 95,volume 902 ofLec­ture Notes in Computer Science, \npages 414 427. Springer-Verlag, 1995. Dorai Sitaram and Matthias Felleisen. Reasoning with continuations \nii: full abstraction for models of control. In LFP 90: Proceedings of the 1990 ACM conference on LISP \nand functional programming, pages 161 175. ACM Press, 1990. ISBN 0-89791-368-X. Richard Statman. Completeness, \ninvariance and .-de.nability. J. Symb. Log., 47(1):17 26, 1982. PhilipWadler. Call-by-value is dual to \ncall-by-name. In Colin Runciman and Olin Shivers, editors, Proceedingsof the EighthACM SIGPLAN In­ternational \nConference on Functional Programming, ICFP 2003, Upp­sala, Sweden,August 25-29, 2003, volume 38(9) of \nSIGPLAN Notices, pages 189 201.ACM, 2003. ISBN 1-58113-756-7.  \n\t\t\t", "proc_id": "1328438", "abstract": "<p>We show that a variant of Parigot's &#955;&#956;-calculus, originally due to de Groote and proved to satisfy Boehm's theorem by Saurin, is canonically interpretable as a call-by-name calculus of delimited control. This observation is expressed using Ariola et al's call-by-value calculus of delimited control, an extension of &#955;&#956;-calculus with delimited control known to be equationally equivalent to Danvy and Filinski's calculus with shift and reset. Our main result then is that de Groote and Saurin's variant of &#955;&#956;-calculus is equivalent to a canonical call-by-name variant of Ariola et al's calculus. The rest of the paper is devoted to a comparative study of the call-by-name and call-by-value variants of Ariola et al's calculus, covering in particular the questions of simple typing, operational semantics, and continuation-passing-style semantics. Finally, we discuss the relevance of Ariola et al's calculus as a uniform framework for representing different calculi of delimited continuations, including \"lazy\" variants such as Sabry's shift and lazy reset calculus.</p>", "authors": [{"name": "Hugo Herbelin", "author_profile_id": "81100052794", "affiliation": "INRIA Futurs, Palaiseau, France", "person_id": "PP43129435", "email_address": "", "orcid_id": ""}, {"name": "Silvia Ghilezan", "author_profile_id": "81100594201", "affiliation": "University of Novi Sad, Novi Sad, Serbia", "person_id": "P494323", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1328438.1328484", "year": "2008", "article_id": "1328484", "conference": "POPL", "title": "An approach to call-by-name delimited continuations", "url": "http://dl.acm.org/citation.cfm?id=1328484"}