{"article_publication_date": "01-07-2008", "fulltext": "\n\t\t\t", "proc_id": "1328438", "abstract": "<p>A <i>lens</i> is a bidirectional program. When read from left toright, it denotes an ordinary function that maps inputs to outputs. When read from right to left, it denotes an ''update translator'' that takes an input together with an updated output and produces a new input that reflects the update. Many variants of this idea have been explored in the literature, but none deal fully with <i>ordered data</i>. If, for example, an update changes the order of a list in theoutput, the items in the output list and the chunks of the input that generated them can be misaligned, leading to lost or corrupted data.</p> <p>We attack this problem in the context of bidirectional transformations over strings, the primordial ordered data type. We first propose a collection of bidirectional <i>string lens combinators</i>, based on familiar operations on regular transducers (union, concatenation, Kleene-star) and with a type system based on regular expressions. We then design anew semantic space of <i>dictionary lenses</i>, enriching the lenses of Foster et al. (2007) with support for two additional combinators for marking ''reorderable chunks'' andtheir keys. To demonstrate the effectiveness of these primitives, we describe the design and implementation of Boomerang, a full-blown <i>bidirectional programming language</i> with dictionary lenses at its core. We have used Boomerang to build transformers for complex real-world data format sincluding the SwissProt genomic database.</p> <p>We formalize the essential property of <i>resourcefulness</i>-the correct use of keys to associate chunks in the input and output-by defining a refined semantic space of <i>quasi-oblivious lenses</i>. Several previously studied properties of lenses turn out to have compact characterizations in this space.</p>", "authors": [{"name": "Aaron Bohannon", "author_profile_id": "81314493648", "affiliation": "University of Pennsylvania, Philadelphia, PA", "person_id": "P792962", "email_address": "", "orcid_id": ""}, {"name": "J. Nathan Foster", "author_profile_id": "81100121184", "affiliation": "University of Pennsylvania, Philadelphia, PA", "person_id": "PP43138824", "email_address": "", "orcid_id": ""}, {"name": "Benjamin C. Pierce", "author_profile_id": "81100303310", "affiliation": "University of Pennsylvania, Philadelphia, PA", "person_id": "PP14111350", "email_address": "", "orcid_id": ""}, {"name": "Alexandre Pilkiewicz", "author_profile_id": "81342507545", "affiliation": "&#201;cole Polytechnique, Paris, France", "person_id": "P925374", "email_address": "", "orcid_id": ""}, {"name": "Alan Schmitt", "author_profile_id": "81326492348", "affiliation": "INRIA Rh&#244;ne-Alpes, Montbonnot, France", "person_id": "PP43123806", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1328438.1328487", "year": "2008", "article_id": "1328487", "conference": "POPL", "title": "Boomerang: resourceful lenses for string data", "url": "http://dl.acm.org/citation.cfm?id=1328487"}