{"article_publication_date": "06-01-1988", "fulltext": "\n\t\t\t", "proc_id": "53990", "abstract": "<p>Practical implementations of real languages are often an excellent way of testing the applicability of theoretical principles. Many stresses and strains arise from fitting practicalities, such as performance and standard compatibility, to theoretical models and methods. These stresses and strains are valuable sources of new research and insight, as well as an oft-needed check on the egos of theoreticians.</p><p>Two fertile areas that are often explored by implementations are<list><item><p>Places where tractable models fail to match practice. This can lead to new models, and may also affect practice (e.g., the average programming language has become more context free over the last several decades).</p></item><item><p>Places where existing algorithms fail to deal with practical problems effectively, frequently because the problems are large in some dimension that has not been much explored.</p></item></list></p><p>The present paper discusses the application of a much studied body of algorithms and techniques [Alle 83, KKLW 80, Bane 76, Wolf 78, Wolf 82, Kenn 80, Lamp 74, Huso 82] for vectorizing and optimizing Fortran to the problem of vectorizing and optimizing C. In the course of this work some algorithms were discarded, others invented, and many were tuned and modified. The experience gave us insight into the strengths and weaknesses of the current theory, as well as into the strong and weak points of C on vector/parallel machines. This paper attempts to communicate some of those insights.</p>", "authors": [{"name": "R. Allen", "author_profile_id": "81100652764", "affiliation": "Ardent Computer Corporation, Sunnyvale, CA", "person_id": "PP14223553", "email_address": "", "orcid_id": ""}, {"name": "S. Johnson", "author_profile_id": "81332506933", "affiliation": "Ardent Computer Corporation, Sunnyvale, CA", "person_id": "PP15032602", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/53990.54014", "year": "1988", "article_id": "54014", "conference": "PLDI", "title": "Compiling C for vectorization, parallelization, and inline expansion", "url": "http://dl.acm.org/citation.cfm?id=54014"}