{"article_publication_date": "06-01-1988", "fulltext": "\n\t\t\t", "proc_id": "53990", "abstract": "<p>A slice of a program with respect to a program point <italic>p</italic> and variable <italic>x</italic> consists of all statements of the program that might affect the value of <italic>x</italic> at point <italic>p</italic>. This paper concerns the problem of interprocedural slicing &#8212; generating a slice of an entire program, where the slice crosses the boundaries of procedure calls. To solve this problem, we introduce a new kind of graph to represent programs, called a <italic>system dependence graph</italic>, which extends previous dependence representations to incorporate collections of procedures (with procedure calls) rather than just monolithic programs. Our main result is an algorithm for interprocedural slicing that uses the new representation.</p><p>The chief difficulty in interprocedural slicing is correctly accounting for the calling context of a called procedure. To handle this problem, system dependence graphs include some data-dependence edges that represent <italic>transitive</italic> dependencies due to the effects of procedure calls, in addition to the conventional direct-dependence edges. These edges are constructed with the aid of an auxiliary structure that represents calling and parameter-linkage relationships. This structure takes the form of an attribute grammar. The step of computing the required transitive-dependence edges is reduced to the construction of the subordinate characteristic graphs for the grammar's nonterminals.</p>", "authors": [{"name": "S. Horwitz", "author_profile_id": "81100357689", "affiliation": "Univ. of Wisconsin-Madison", "person_id": "P254094", "email_address": "", "orcid_id": ""}, {"name": "T. Reps", "author_profile_id": "81100117392", "affiliation": "Univ. of Wisconsin-Madison", "person_id": "PP40036453", "email_address": "", "orcid_id": ""}, {"name": "D. Binkley", "author_profile_id": "81100259861", "affiliation": "Univ. of Wisconsin-Madison", "person_id": "PP40035357", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/53990.53994", "year": "1988", "article_id": "53994", "conference": "PLDI", "title": "Interprocedural slicing using dependence graphs", "url": "http://dl.acm.org/citation.cfm?id=53994"}