{"article_publication_date": "01-01-2000", "fulltext": "\n A Workbench for Quality Based Software Re-engineering Some text in this electronic article is rendered \nin Type 3 or bitmapped fonts, and may display poorly on screen in Adobe Acrobat v. 4.0 and later. However, \nprintouts of this file are unaffected by this problem. We recommend that you print the file for best \nlegibility Ladan Tahvildari and Kostas Kontogiannis Department of Electrical and Computer Engineering \nUniversity of Waterloo Waterloo, Ontario Canada, N2L 3G1 +1 519 885 1211 ltahvild,kostas @swen.uwaterloo.ca \nABSTRACT 2. PROPOSED METHODOLOGY Keywords 1. INTRODUCTION Permission to make digital or hard copies of \nall or part of this work for personal or classroom use is granted without fee provided that copies are \nnot made or distributed for pro.t or commercial advantage and that copies bear this notice and the full \ncitation on the .rst page. To copy otherwise, to republish, to post on servers or to redistribute to \nlists, requires prior speci.c permission and/or a fee. OOPSLA 2000 Companion Minneapolis, Minnesota Copyright \n2000 ACM 1-58113-307-3/00/10 .. 5.00 Target Identifying Design Goal-Driven Architecture Patterns UML \nDiagrams Run-Time Source Code Representation Routines Generic Skeleton Code New Code Evaluation Done \nObject-Orientation 4. CONCLUSIONS 3. EXPERIMENTAL STUDY 5. REFERENCES \n\t\t\t", "proc_id": "367845", "abstract": "<p>This research presents a re-engineering workbench and architecture that allows for legacy systems written in procedural languages to be migrated to new object oriented platforms. This methodology allows for specific design and quality requirements of the target migrant system to be considered during the re-engineering process through an iterative and incremental process. The migration process recovers an object model from the procedural code and incrementally refines it by taking into consideration the design requirements for the migrant system. A case study is presented as a proof of concept.</p>", "authors": [{"name": "Ladan Tahvildari", "author_profile_id": "81100007067", "affiliation": "Department of Electrical and Computer Engineering, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1", "person_id": "PP14015382", "email_address": "", "orcid_id": ""}, {"name": "Kostas Kontogiannis", "author_profile_id": "81100496122", "affiliation": "Department of Electrical and Computer Engineering, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1", "person_id": "PP39045640", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.367929", "year": "2000", "article_id": "367929", "conference": "OOPSLA", "title": "A workbench for quality based software re-engineering (Poster)", "url": "http://dl.acm.org/citation.cfm?id=367929"}