{"article_publication_date": "01-01-2000", "fulltext": "\n Taking advantage of Design Patterns in GIS domain L.Polasek, A.Zambrano S. Gordillo, J. Bazzocco, G. \nTrilla, D. Cano, A. Lliteras LIFIA-Facultad de Informática, UNLP CC 11 (1900) La Plata, Buenos Aires, \nArgentina +54 221 4228252 [pola,arturo, gordillo, jb, gtrilla, dcano, lliteras]@sol.info.unlp.edu.ar \n ABSTRACT Geographic Information Systems (GIS) are used to collect, store, analyze and present information \ndescribing physical and logical aspects of real world entities. They deal with several areas, such as \ngeoreferencing, topology, visualization, representation of continuous information and so on. Most of \nGIS applications are hardly adapted to new requirements, like changing of the reference system, integrating \nvector and raster models, or handling continuous information, among others. This work presents an pattern \ndriven architecture for building GIS applications. The result is a framework that is focused on flexibility \nand adaptability features. Keywords GIS, object orientation, flexibility, design patterns. 1. INTRODUCTION \nGIS [5] refers to any application that works using earth­positioned entities. Thus, the core of GIS systems \nis the positioning system, also known as reference system. The earth representation, the axes orientation \nand shifting, as well as the coordinate system are the essential aspects that have to be considered in \norder to georeference an entity. Besides, it is necessary to determine the shape of a geographical object. \nTopology explains how points, lines, and areas relate to each other and is used as the foundation for \norganizing spatial objects in GIS. Topology provides a basic language for describing geographic features. \nIn many situations, the information related to a geographic area is continuous. By continuous we mean \ninformation that takes several values, along a continuous domain. Examples of this type of information \nare temperature, humidity, among others, measured for example in a country. Continuous information is \nalso known as continuous field. Most of current GIS can not deal with continuous information by themselves. \nGenerally, they have to be helped by mathematical applications. All that information should be shown \nto the end user in a friendly way. Visualization in GISs has a major roll, helping the user to understand \ngeographical phenomena. Permission to make digital or hard copies of all or part of this work for personal \nor classroom use is granted without fee provided that copies are not made or distributed for profit or \ncommercial advantage and that copies bear this notice and the full citation on the first page. To copy \notherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission \nand/or a fee. OOPSLA 2000 Companion Minneapolis, Minnesota (c) Copyright ACM 2000 1-58113-307-3/00/10...$5.00 \nIn this work we present an object oriented architecture that addresses all the above mentioned issues. \nOur design was guided by applying Design Patterns [2], in order to maximize the model's flexibility. \nOur model has been successfully used to build a powerful GIS that allow us to change, in run time, critical \naspects, like the reference system, the representation of continuous information and visualization. \n2. THE ARCHITECTURE Our model was divided in four main pieces. The first is aimed to solve the georeferencing \nproblem. The second is the Topological Model, which allows defining the relationship between geographical \nobjects. The third deals with continuous fields, allowing to define and to operate them. Finally, we \nhave a visualization model that let us customize geographical entities s aspects according to the context. \n2.1 The Reference System Georeferencing is the core of any spatial information system. Georeference an \nobject implies to know the exact object location on the earth. Positioning objects involves considerations \nof: 1- The geometric character of the reference system. 2- Measurements metrics. 3- Types of reference \nsystems (Cartesian or Polar). 4- Nature of the origin (an ellipse, a sphere, a point, or whatever). Due \nto the irregular shape of the earth, there are many ways to represent it. In fact, each country selects \nthe reference systems that fit better to its surface, according to the shape and location of that country \non the earth. The value of the position of geographical entity depends on reference system in use. Most \nof current GISs do not allow automatic translating locations between reference systems. Our model provides \nthis functionality, by decoupling the position of the object from the reference system in use. The positioning \nsystem allows changing dynamically the reference system and recalculating the new position. In this poster \nwe present the way in which we took advantage of several design patterns to obtain a flexible and extensible \nmodel for implementing most of the reference systems currently in use. New RS can be obtained by defining \na Coordinate System (Strategy) and a Datum (Type Object). 2.2 An OO Topological Model Besides its position, \ngeographical entities are commonly described in term of its shape. Three basic elements are used to define \nshapes: point, arc, and polygons. A polygon is defined by set of adjacent arcs; an arc is line between \nto points. The combination of these three elements defines the topological model. The topological model \nallows studying spatial properties, like adjacency, connectivity and containment, among entities. A city \ncan be thought as a polygon, it's streets as arcs, buildings as small polygons that are adjacent to streets. \nThere are entities which must be represented by more than one basic topological element such as disjoint \npolygons or polygons with holes. For instance a country can be represented by a polygon, if the country \nhas islands, the country's shape can be a composite polygon, formed by simpler ones. There is a recursive \ncontainment relationship among them. Our framework makes possible to attach any shape to geographical \nentities, by enabling polygon and arc composition. This recursive data-structure was implemented as a \nComposite. 2.3 Continuous Fields Continuous Fields are one of the most challenging features to implement \nwithin a GIS application [5][6]. Imagine a meteorology application working with data like humidity, temperature \nand winds, all of them defined in a continuous domain. It is impossible to store the value of each feature \nfor all the points that form the sampling region, the usual procedure is to measure that value, only \nfor most significant positions, that is called sample. It will be use later to interpolate the value \nat unknown positions. The sample is organized in a representation, for instance, a regular grid point, \nan irregular grid point, a TIN (triangulated irregular network), and so on. According to selected representation, \nthere are several interpolation methods, for example in a grid point can be used the k nearest-neighbors, \nb-spline or kriging estimation methods. Thus, a continuous field is composed by a set of samples, a representation \nand an estimation method. Our design makes it possible to change the representation and estimation method \nat run time for the same sample set. The representation aspect is a Bridge while the estimation method \nis a Strategy. 2.4 Visualization One of the most important features of a GIS application is the ability \nto show real world entities as they have been defined in the previous sections, i.e., geographical entities \nhaving their positions represented using topology and georeferencing features. In GISs, there are certain \nsituations in which geographic entities have to be displayed in different ways, possibly simultaneously, \nfor instance consider a system that allows the user to view a map at two different scales. The same object \ncan appear in each view showing several dissimilar features. Besides, there are many powerful graphics \nengines, like OpenGL, DirectX, VRML, and so on. Our objective was to construct a flexible micro-architecture \nthat would allows us to attach graphical features to each object in different context and show it trough \nany graphics engine, configuring that on run­time. In order to achieve that, we use the Strategy, Observer, \nBuilder and Strategy Design Patterns [2].  3. CONCLUSION AND FUTURE WORK GIS can benefit from object \norientation to become more flexible and extensible in order to support new requirements. Our future work \nwill be aimed to extend the architecture to support new RSs, Representations and Estimation Methods (for \ncontinuous fields) and eventually construct an object oriented query language on top of this architecture. \n 4. ACKNOWLEDGMENTS We would like to thank Federico Balaguer for useful comments on draft of this extended \nabstract. 5. REFERENCES [1] Aronoff, S. Geographic Information Systems: A Management Perspective . WDL \nPublications, 1991 [2] Gamma, E. ; Helm, R.; Johnson, R.; Vlissides, J. \"Design Patterns. Elements of \nreusable Object-Oriented Software\". Addison Wesley, 1995. [3] Gordillo, S.; Balaguer, F. Refining an \nobject-oriented GIS design model: Topologies and Field Data . ACM­GIS 98. November 6-7, 1998. Washington, \nD.C., USA. [4] Kemp, K. Fields as a Framework for integrating GIS and environmental process models . \nPart 1: Representing spatial continuity . Part 2: Specifying field variables . Transactions in GIS, 1997, \nvol. 1, nº 3, p. 219-234 and 235-246. [5] Laurini, R.; Thompson, D. Fundamentals of Spatial Information \nSystems . Academic Press Professional, 1993. [6] Tomlin, C. D. Geographic Information Systems and Cartographic \nModeling . Prentice-Hall, Inc., 1990. New Jersey. [7] An Arquitecture to handle Continuous Fields in \nGIS. Luis Polasek, Arturo Zambrano, Silvia Gordillo. ASAW 99, Melbourne.  \n\t\t\t", "proc_id": "367845", "abstract": "<p>Geographic Information Systems (GIS) are used to collect, store, analyze and present information describing physical and logical aspects of real world entities. They deal with several areas, such as georeferencing, topology, visualization, representation of continuous information and so on.</p><p>Most of GIS applications are hardly adapted to new requirements, like changing of the reference system, integrating vector and raster models, or handling continuous information, among others.</p><p>This work presents an pattern driven architecture for building GIS applications. The result is a framework that is focused on flexibility and adaptability features.</p>", "authors": [{"name": "L. Polasek", "author_profile_id": "81100352064", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "P167005", "email_address": "", "orcid_id": ""}, {"name": "Arturo Zambrano", "author_profile_id": "81100570736", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "P22254", "email_address": "", "orcid_id": ""}, {"name": "S. Gordillo", "author_profile_id": "81100400051", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "PP40035484", "email_address": "", "orcid_id": ""}, {"name": "J. Bazocco", "author_profile_id": "81100486875", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "P120294", "email_address": "", "orcid_id": ""}, {"name": "G. Trilla", "author_profile_id": "81332532348", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "P92667", "email_address": "", "orcid_id": ""}, {"name": "D. Cano", "author_profile_id": "81332491981", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "PP14206771", "email_address": "", "orcid_id": ""}, {"name": "A. Literas", "author_profile_id": "81100296789", "affiliation": "LIFIA-Facultad de Inform&#225;tica, UNLP, CC 11 (1900) La Plata, Buenos Aires, Argentina", "person_id": "P5798", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.367941", "year": "2000", "article_id": "367941", "conference": "OOPSLA", "title": "Taking advantage of design patterns in GIS domain (poster session)", "url": "http://dl.acm.org/citation.cfm?id=367941"}