{"article_publication_date": "01-01-2000", "fulltext": "\n Some text in this electronic article is rendered in Type 3 or bitmapped fonts, and may display poorly \non screen in Adobe Acrobat v. 4.0 and later. However, printouts of this file are unaffected by this problem. \nWe recommend that you print the file for best legibility. Decompile Java Class Files with Soot! Jerome \nMiecznikowski Sable Research Group School of Computer Science McGill University Montreal, Quebec, CANADA \nH3A 2A7  jerome@sable.mcgill.ca 1. INTRODUCTION . h e e e a e e a e D e e a o a n e m n tNm m n e D \na n e m n atn mem e e o s aNs e o m m r ne o e e e h m eaea mno e a n h ehe e a e o n ahm e o m mne o \ne e a n a o N a e aao a ndmmee n o o e s e sna a o m m m e n n ame m e a m e n e a e e e n t e n e e \ne e n tne enm a e a a o m a na m e e o e o m s e o a nemmete e o m D e e e sma ais e D e o mne e o m \ne o sNm e m e a e o e rm e a e e e a e m erm e taa n sne e e m e m a n o e e a a e e a a m een h eam \ne e t e n a o a m e e o e o a n t e a t e m a Nen m n h a D e mme e nav a D a N e e o s e n tdanm e e \ne e e o r n mv a D an e a n a o a n m e e vm m n e aea v a D a m N n e o m s eaa n a o N a e a a n shn \ne a n a e m e m a n e m n e e a m e re m e om es2 nne m D e s e a a e D e e a ohe n n e e m e s e a n \neee ene e a e n n a n e m n aa n smahs e o m mne o e e ed. h e ata e m m e a a e m nme ato m n o e e \nn e see e n hnn e mm e n h e m am enm e o e a n m n e a e m ehn h e s e o m mne o e e a n Nne e n e e \ne e n o ee m eno m o a oeD a e e a m o e ana n sae e a n e e o n e e e n tto m n n e m omm e e .aNne \ne n e e e e n o e e ane e e m e m e ssa nan h e v e mno ehe ene e a e n n a n e m n o e D e o a e h e \no h e a a n a o o o e a arp r a s s e e a a o m s e erir ne e a a e m n ara e ean h e na t t e e t a \nn e shn m e m e mka n e eme ene e a e n n a n e m nho a o o e sdone e mneah e rn a o o N m e ese e a \nn e e o n e e e n t a o t m e e n h mte a an no e e sfn mCone e mnn m ne m s e o e v a D aha m e e o \ne o m s e e Type Inference Control Flow Restructurer  2. TYPE INFERENCE 2 n n h env a D a m N n e \no m s e e ee e a e n n a n e m nae a e s e n o o a a a S o e a a e n r nn e e m e s e a n e o m mne n \na n e m ntD a o e e aaa e e a n m e e sne n n mhe n n Nne s o m o a oD a e e a m o e aaa n sha n a o \no o m o a n e m n a evm m nrn e a n a e m e m arm N n e o m s e e n n mv e mno ese h e e e n h esn Nne \ne n e e e e n o eha o t m e e n h mme e o m D e e a a n a n e on Ne a e m eav e mno eho m o a o D a e \ne a m o e a e n . h eea o t m e e n h mle m e o asm NCa m a n e a o n e n t n h e n Nne e n e e e e \nn o e ne m m o e mae n n m ahm Thy khhsha e ene e a e n n e s a aha s e e e o n e st e anheeaanaan h \ne ane m m o e mie a ya rr h a e she nna m a e n o e m ene m t e a mn e a n a e m e m a n e m n a p a \ne ede mno e m e n n e sCane a o n e o a o a o t m e e n h mn h a nte o o e e n n o Nna m o D e a o m \nm m m nno a a e a aan h e n an no e e a e o o e e n n ne m t e a mhn e a n a e m e m a n e m n a n mta \ne mno e e Nsh a e sio a a e a e . h e e e a e e n h e e enm e n n arn h a nam a o e n h e t e n e e a \no n Nne n tne m m r o e mTs e o o e o n e h d ian h ene m t e a mnm e n nhane o e S oan a n e e e m e \nn h em N n e o m s e D e e e S o a n e m nea hi mte o n eno e e n h e e e n a n o ets e ean m e n n e \ne re a o e a a a n sah p imn h e o m e e e o n n Nne n t m e a e e a N a e anene mnm a e a nhe e r Permission \nto make digital or hard copies of all or part of this work for personal or classroom use is granted without \nfee provided that copies are not made or distributed for pro.t or commercial advantage and that copies \nbear this notice and the full citation on the .rst page. To copy otherwise, to republish, to post on \nservers or to redistribute to lists, requires prior speci.c permission and/or a fee. OOPSLA 2000 Companion \nMinneapolis, Minnesota (c) Copyright ACM 2000 1-58113-307-3/00/10... 5.00 Etienne Gagnon Sable Research \nGroup School of Computer Science McGill University Montreal, Quebec, CANADA H3A 2A7 gagnon@sable.mcgill.ca \nS o e e n n anm o N n m m e a o n e m e a n h e e e r a n a t eea o t m e e n h m n h a nem Nna a a e \nan h e aeo m mno ee n Nhm Nne e e m e m e n tne m t e a m n e a n a e m e m a n e m n aen h a na e mno \ne e N n h enn Nnene n e e e e n o ene m m o e m ame e n h m e n a mme o n e n tne m rt e a mpa e m a \nn n e o a aee h e nmais e o o e o nho a a e e a e n o m e n n e e e smeaphe ea o t m e e n h mne e e \nm e m ahn e mao e n s aam e n e a n a e m e m a n e m n a e h d inD a e e ra m o eiano e n n e n tda \nn m me o n o e e a n e m n a e n e a aea n sfhine n a e e n e m n m en Nneao a a n a n h a nha e e t \ne a e a n n e e sin m a e o o e e s a n e e n r n e m e e 2.1 Stage 1 . h edS e a nsa n a t eeo m n a \nn e e o n a aas e e e o n e s r t e anh m ene m t e a m o m n a n e a e n n a ea. h e neaee n m e e t \ne aan h e o m n n e o n e sNo m mnm n e n n aam en h est e anhea a n s e e m m D e atn e a n a e n e \nD e o m n a n e a e n n a emh e n a o o N a e nm e e t e ata e n t o eso m n a n e a e n n a ema nnn \nh e anm e n n aae n a e o o e e s ate eha o oD a e e a m o e aih a D e D a o e san Nne a a m eie n e \na e o aie enaeD a e e a m o e h a aan mn Nne a m ene eaahn Nnehe e e m ene a aas e n e o n e sse nin \nh ene m o e a a e 2.2 Stage 2 2 e n h edS e a nsa n a t ehe a e o a n m s e o e D e e ama m o e n e \nm neaan h eha e o m n sa n a t eaan no e e ata D a e e a m o eaano e n n e n t n e a n a e m e m a n \ne m neaaa n sNn h e ne e e e n aaa n a t esdtm nhn h ehn e a n a e m e m e sne m t e a m e aeeth a D \netm n o Ne m e n s m n eaa e n e a n e m nae h e e enD a e e a m o enano e n n e n the a e ee e e e sra \na n sn h a n e a e m e D a e e a m o e a e h e o hia e e a a a e t n e san e e m me o n a h e ee eae \nm e a n a n e m e n n a m ern h ene m e mhif aI e afsrg n i e 2.3 Stage 3 2 e a n a t eae a e o a a \nn h e nNa n a t e pne m o e e s a a a e m o o m e a esa n e e o m n a n e a e n n aat e anhfe a m e e \no n a e h e e e n h e a t e anhfm n o NCe n o m s e a nk yk r g s n saTdo m n a n e a e n n a ee2 nnn \nh e aht e anheank yk r g sid h s o m n a n e a e n n a a e ehn m n e e o m e s e sma a n s e n n e e \ne a o eae n h e e e n a n o eae a e t rn m e e srea2 n m n h e e e m e s a a e a o hae n n e e e a o \ne h a a aNa e n t o ena e e n n n eeeI new e . h e neamn h eho m n a n e a e n n a a N a n e mke aha \nm o D e se a e n tan h e g s k h am T t Tkm s hT ynh naairm ero o a a a e a a n ste n n e e re a o e \na h e h e o hNe a n m ema o e a N a e n ee e i e phn o e a o oaD a e e a m o e a a e ea a a e t n e sha \nn Nne a d h s m Thy kh a e eeo h e o o e s m n e D e e N m e e t e n a ov e mno eea n a n e m e n n a \na n s n Nneeo a a n ara e e a s s e s a a n e e s e s n maa a n re a e N n h eeo m n a n e a e n n a \nea. h eeD e e e Sma m e o e n Nnm e n h e m e e t e n a one m t e a mt e a e a n n e e aan h a n n h \ne a ehe n a e e n e sdo a a n aae e o o a o e a N ana e o o e e sNa ne e n r n e m e e   2.4 Handling \nArrays . mhe n e e e n Ne a e ne m t e a m a e a e n t a e e a N a a e e e n n e m s e o e a e r nne \na Nto m n a n e a e n n aae ntn h e o m n a n e a e n n aat e anhrea. h e nhe e n e a n a e m e mn h \neso m n a n e a e n nst e anhCe n n mea nfee e D a o e n n o m n a n e a e n n a t e anhe e n h m e n \na n N a e e a N o m n a n e a e n n a ea. h e n e e a m o D e n h e n e ene m m r o e mte a e n t n h \neaa o t m e e n h mne e a e n n e semme e m e e edh e n a o o N are eae a en h e a a m o e n e m nNn \nmie n e e enn h ehn Nnehm e a e e a N a a e e D e e a e n tsm e e S e a nn e a n a e m e m a n e m nrea. \nh e a n e a n a e m e m a n e m nne a an no e e s e nnmmm n h a n a t ed a n sia n a t enp a e ean e \ne s e sme   \n\t\t\t", "proc_id": "367845", "abstract": "", "authors": [{"name": "Jerome Miecznikowski", "author_profile_id": "81100552078", "affiliation": "Sable Research Group, School of Computer Science, McGill University, Montreal, Quebec, Canada H3A 2A7", "person_id": "P138905", "email_address": "", "orcid_id": ""}, {"name": "Etienne Gagnon", "author_profile_id": "81100274113", "affiliation": "Sable Research Group, School of Computer Science, McGill University, Montreal, Quebec, Canada H3A 2A7", "person_id": "P79420", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.368004", "year": "2000", "article_id": "368004", "conference": "OOPSLA", "title": "Decompile Java class files with soot! (poster session)", "url": "http://dl.acm.org/citation.cfm?id=368004"}