{"article_publication_date": "01-01-2000", "fulltext": "\n ® Position Paper for OOPSLA '00 Standards Panel: Emerging B2B eCommerce Integration Standards -A Tower \nof Babel? Participant: Marc Breissinger, Director, Product Strategy, webMethods, Inc, The exptosior~ \nof e-commerce and new technologies has heightened competition within every industry. Executives are realizing \nthe urgency of eliminating inefficiencies and aligning their operations more closely with trading partners. \nTo this end, global corporations have made tremendous investments in implementing enterprise systems \nto streamline intemat business processes and develop systems to exchange data electronically with trading \npartners. While these systems provide significant value, companies are recognizing that they can no longer \ncompete on the basis of their enterprise capabilities alone. They must compete on the combined competencies \nof their extended trading network. To leverage the collective strensahs of that community, access to \ninformation must be readily available throughout the trading network. Within the last two years, many \ncompanies and industries (such as the high-tech industry with its RosettaNet initiative) have made considerable \nprogress in electronically linking trading parmers. Simply put, the primary objective of these initiatives \nis to streamline the interactions among trading partners by eliminating redundancies and improving the \nflow o:fcritical information. The first step in accomplishing that objective is the establishment of \nstandards by which partners :in the trading network will exchange infb~Tnation. These standards can take \nmany different forms and have widely varying scope. However, there are certain core components required \nof any standard purporting to establish an industry model .for e-business, including, but not limited \nto: Standard processes that define the interactions between trading partners An implementation framework \nthat describes a protocol for networked applications A vocabulary defining information flowing between \npartners  Standard data dictionaries defining ranges of shared data values for enumerated elements. \n An organization capable of maintaining the standard and providing certification services for vendors \nwishing to implement the standard  While the goal of standards to ensure interoperability between heterogeneous \nentities is generally accepted, the current proliferation of incompatible standards is extremely detrimental \nto that goal. In order for the potential of e-business to be realized, there must be significant convergence \nin the standards world. That convergence will require two fundamental changes in the technology industry: \nsoftware vendors must set aside their arrogance and work together to stabilize the technology base and \nindustry organizations must abandon their overly academic approach to standards creation in favor of \na much more pragmatic methodology. Permission to make digital or hard copies o fall or part of this workJbr \npersonal or classroom use is granted without fee provided that copies are not made or distributed for \npro/~t or commercial advantage and that copies bear this notice and the j~lI citation on the first page. \nTo copy otherwise, to republish, ro post on servers or to redistribute to lists, requires prior specific \npermission and~or a fee. OOPSLA 2000 Companion Minneapolis, Minnesota. Copyright A CM 2000 1-58 t 13-307-3/00/10... \n$5.00.\n\t\t\t", "proc_id": "367845", "abstract": "", "authors": [{"name": "Marc Breissinger", "author_profile_id": "81100428256", "affiliation": "Product Strategy, WebMethods, Inc.", "person_id": "P187292", "email_address": "", "orcid_id": ""}, {"name": "Lougie Anderson", "author_profile_id": "81100101031", "affiliation": "", "person_id": "P173388", "email_address": "", "orcid_id": ""}, {"name": "Chris Beall", "author_profile_id": "81100232244", "affiliation": "", "person_id": "P45914", "email_address": "", "orcid_id": ""}, {"name": "Thomas Joseph", "author_profile_id": "81332507517", "affiliation": "", "person_id": "PP31083584", "email_address": "", "orcid_id": ""}, {"name": "Mary Loomis", "author_profile_id": "81100091003", "affiliation": "", "person_id": "PP39075396", "email_address": "", "orcid_id": ""}, {"name": "Stewert Allen", "author_profile_id": "81100651766", "affiliation": "", "person_id": "P270567", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.367900", "year": "2000", "article_id": "367900", "conference": "OOPSLA", "title": "Emerging B2B eCommerce integration standards - a tower of Babel?", "url": "http://dl.acm.org/citation.cfm?id=367900"}