{"article_publication_date": "01-01-2000", "fulltext": "\n Active Learning For Object-Oriented Design Some text in this electronic article is rendered in Type \n3 or bitmapped fonts, and may display poorly on screen in Adobe Acrobat v. 4.0 and later. However, printouts \nof this file are unaffected by this problem. We recommend that you print the file for best legibility \nRobert Biddle Computer Science Victoria University of Wellington Wellington, New Zealand robert@mcs.vuw.ac.nz \n ABSTRACT 1. INTRODUCTION  2. WORKSHOP INTRODUCTION  3. WORKSHOP OUTLINE Themes Permission to make \ndigital or hard copies of all or part of this work for personal or classroom use is granted without fee \nprovided that copies are not made or distributed for pro.t or commercial advantage and that copies bear \nthis notice and the full citation on the .rst page. To copy otherwise, to republish, to post on servers \nor to redistribute to lists, requires prior speci.c permission and/or a fee. OOPSLA 2000 Companion Minneapolis, \nMinnesota (c) Copyright ACM 2000 1-58113-307-3/00/10 5.00 Goals 7. REFERENCES Agenda 4. RELATED WORK \n 5. WORKSHOP ORGANIZERS 6. WORKSHOP WEB SITE   \n\t\t\t", "proc_id": "367845", "abstract": "<p>This poster will present the work of Oopsla 2000 workshop 13, on &#8220;Active Learning For Object-Oriented Design&#8221;. Many people are introduced to OO concepts, hut only learn the words. This workshop will explore &#8220;active learning&#8221; techniques for OO design, where innovative teaching strategies are used to allow learners to be actively engaged in design work right from an early point. Our focus is on design mentoring and innovative active strategies. The workshop invites submissions on new techniques, new applications or extensions of well-known techniques, and case studies. The workshop will consist of presentations on these topics, and immediate active experimentation using the techniques.</p>", "authors": [{"name": "Robert Biddle", "author_profile_id": "81100135223", "affiliation": "Computer Science, Victoria University of Wellington, Wellington, New Zealand", "person_id": "PP14058058", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.368045", "year": "2000", "article_id": "368045", "conference": "OOPSLA", "title": "Active learning for object-oriented design (poster session)", "url": "http://dl.acm.org/citation.cfm?id=368045"}