{"article_publication_date": "01-01-2000", "fulltext": "\n Some text in this electronic article is rendered in Type 3 or bitmapped fonts, and may display poorly \non screen in Adobe Acrobat v. 4.0 and later. However, printouts of this file are unaffected by this problem. \nWe recommend that you print the file for best legibility. The META4 Programming Language OOPSLA 2000 \nDoctoral Symposium Abstract Jason W. Kim EECS Dept. Lehigh University Room 304 Packard Lab. 19 Memorial \nDr. W. Bethlehem, PA. 18015 USA jwk2@eecs.lehigh.edu Abstract n T wnedn m a a han a l e a d n e m e \nh d e r a a h d h a d e u m d h y e a d n e r e e e e a ma n h m h d a a m a a m a m d E d h a dha a \na ndm h a a h r e ane e a a n h m h daa a n h dnd h e s o a e f dd h a ddd h eta a a a a e a d n d h \ne n h d hun o e edd m m e r eaa m e h d m a e md m a a e o a a h a d m n hCo m ane h h d m m eom e n \nm a d a d m n hRn e a m e a m y a o a a h e a re i m a m a m d e h h m d m m eea n r e d e h e e a d \nm n hno m aoa a n h e a eaa n r eed n m a ma h m h e a n r e a n m m m a m h dae h d m h ehm h n dda \nham h d e e m e e d e e e sn h m a e rpu m d hRana d e n h dde h a a m a h a a d m n htm e m h a m m \na eea h r a e e md a m hee e a a n h a a a e a a h d h a d e e e a d e m a d m n h ata h rum e n d e \na m m e e a h m mm a m e rea h h n d a d m n h a rhn T wne n a a a n u a a a adm a e d a n e d h e m \ne n d e a m rm h a a h r m h dtd h eha n m m m a e edm d a e a end naa e e i d e h r e roa h r a m e \na m a a m a e rn o e e d m m e eaw h e e e e n e e rhn T wnedndm aeTtt oah deanheum h d e n r h a ed \nh eha n h a e m d n eho te eoma Td foaTtTaod pod e pa Ter a h e a e d a h dda h rm n u e e e h a ema \na m a m d Ehe n eaa h a d n mam m e n d e a m m m h dan edh e uh a e fta f dp dTa eomas pa dmd h efoaT \nTaoh d p d he o h n d h e emu n e r a r m d ap dTa e eomas pa h rfoaTtTaooa a hea eae i d e h r e run \ne e o e hem n r m y e rgrge o e ha d e h h d m m e d nta n a o e a m e a m y a m e n a a e m a e 1. PROBLEMS \nBEING SOLVED w h eda a m a m d E d n m n r e a d h ema h a h d e a d h a d d E m e a h h r e e d n m \naha hm m m n e d a h dea a m a a m a m d E esh e e e h dta d a d e m n e m d h e m a e d a n a h d m \nn h a d nd h etv a h e m a T o n a h d m n h e Che e a m n h m h d ama h a h a at rhzma a aha h m m a \nEd h e a a m a a m a m d E d h a dhm a d e h e e a a a Ed podoe a hd nhd h e a a h d h a d e a h rd h \nete h d m d m e ahn e d h a d a a h d h a d e e w h a d m a rhm dhm ahr ma h a d d neod a epTea a n h \ndma a m raa h a h d e a e e n m atm e n d e a m m e e a m n m h d n eno m e u ew h m atT a td egd p pn \nend h e a a m a a m a m d Eon ena a agm e m n e a a h d h a d e ada h ra E a d e m a m ahd h etn h eaa \ne m h daa r r e e a a e rnh e e e eeo hem e n d e a m m m h d ra e e d a m htd n a a ade e u h m e e \na a d m n h add h a dda m e n h d a m r ehd h eha a m a a m a m d Een ed h eta a h d h a d e m heu h \ne a d m n hhedv m e a m y a a a a E r d h eea a m a m d Ead n h a h r a ed h e a h a h d e a u m d h \nm h d h e a a h d h a d etm a ate h h r a m e h d a agm e n a a e m ewhn u a e rad h m a e h rhr u edm \nh d e n r h a e d h e a a m a a m a m d Etd n m n r e a w E m eT o n a h d m n hua a aaaey e a ddn e \nr e edm e n a e a a r d e e a d m h d m d a a aee n e myn em h h e e m d a h a e a h rda n h m a m h \nduu m d h chwsmoe ahTta a m a a m a m d E d h a e ma h d e e a a n m m h d a d m n h a aha n m m a e \nd e h e a a e 2. GOALS Permission to make digital or hard copies of all or part of this work for personal \nor classroom use is granted without fee provided that copies are not made or distributed for pro.t or \ncommercial advantage and that copies bear this notice and the full citation on the .rst page. To copy \notherwise, to republish, to post on servers or to redistribute to lists, requires prior speci.c permission \nand/or a fee. OOPSLA 2000 Companion Minneapolis, Minnesota (c) Copyright 2000 ACM 1-58113-307-3/00/10 \n... 5.00 o h n e r e e d nna n a o e d h e d E m e e o n a h d m n h m e n a a e ma ooaeoo dh a e fta \nf doo ao oo dod pThpae fnd eoma omad p aodod p od p p d a n m e e h h mr a m e h d a anm a a h e ahn \nheh n uad h eea a h d h a d eam a a n m m m a e rea h reh a h mr a e rah e e r a d nta eda r r e e a \na e rge w h e e e e n e e r d h e m a m had n a a n ehd h m ae e a e a e a ham a d n r e a m d had h \neha a h d h a d eea h r a h m a rod h eha n m m m a e e ew h m a a n m m m a e ehu m a a a a a n ute \nn e d h e a E a d e m a d m ate o a a h a d m n hnn ea T e chwsmom hda han a l e a d m n e m e h d e \nrhe h o m e n h m e h d e o dtu m a a a a a ne h a a a e d h emm e n d e a m m e edd n e i m e e a add \nh eme o n a h d m n han ega a a a a e a a aaum e n d e a m m e e m a a a e a a m a a eoa a d m n hhenw \nh a d m a r d h eom e n d e a m m e eu m a ama eaa a a eod nuume m d eaa n r e d h a dd pThp d pd h eoa \na a a a e a rhu m d h m hwame Eh e n ehd h eam n a d a n m m a e iem a a h e a m ahd h etm h d e e e \na a eaa a a n u m h de h a a m h d e d e a d m n hoa e d u e e h e i e a h d m h dta n r eha h r h e \nu a E a n m m m a e ra n r e ere r r m d m n h a a a E rdd h eea n m m m a e eam h a doa ena a a eed \nndm h o n n eh a e e m r e y h e raa n r e a h rad h edh a e e m r e y h e raa n r edmth a d a e a a \na edd nm h o n n e d h eha n m m m a e e ev e a n h r a E r d h e a a h d h a d e r e a m d hum e n a \ne a a h a a d e h e e a a a E a e e ha m m e n a a h e rho m a d e h e e a d m n hdn e a a e d n eme \nh h r a m e h d a aha i m n m ad h a d m e n m m a eta m a e d m a h a a eta n h y d h e a d m n heu \nm d h m hed h e m n a a m a a ea a m a a m a m d Eta d a d e m a m a a eun e a a h d h a d e a eao hRn \nT wne n rma h a hCa i m m n m ata a haa E a d e m a d m a a a a Ena eaa h a h d e raa e a a h a e h n \na m h d a e a a h md h a d e a a hea e aam e e e e a d y dde n e a a ana m d h a d m n h a e nRm d hen \nT wne n rd h eha r e m dna h rea h d h n e m a e rtm e n d e a m m e eaa a hta m e a m a a m a e d h \ne a a h m d h a d edm d a e a e r h n d m e e e a E a E a r r m h dha m a e a e m e a r a h d a Eea h \na h d m h dd h e a a h d h a d e a e v m m m a eda E h d a d m a m n r m y a a d m n h a e e a d e a \nm d h d e n e muma e rhash a h d m h d d h eee h h r a m e h d a aha i m n m a e e n meu h m a hRd h \nea a h d h a d e m ata n e h m aaa a a nnm n a a m a a eaa h d m n e e a n m m a e igehw h m aa a a n \nu aar n m a m h a m e a m y aua m e a m a a m a a d m n htamm ee e a m e a m y a a h a a a h md h a d \ne a e n emahm a e d m a h a a emm e n a a e mozau m d h n h dhd h e n u m h dea u a Ead h em n u e e \ne h a d e h e e a adm h e m n a eua a m a a m a m d m e aon een T wnedn eaw h m a m aaam n e ean m e \nhne h r e rue e a e a e a had n m m a rna h dth e o e e d h e a e a ata hne i md e e m e a Eom h d e \ne e a d m h dan h e e  3. APPROACH e a d h n h d hRmth a hCegn e d h a a d n h enm h d n m a n m h d \nn T wne n ada a e a h a Eaa n m m m a a a a ea a h d h a d e r a d h n e n h d hae i m a a h a d m n \nh aen ed h etr e a m d hha h rem m m a e m e h d a d m n hum a a e E n h rud h eea a n m etn e d h m \naa a a d e a a d ednhe u m a a d m o eeaaa e m e e n h d a m h een eta n m e m m m n e d a h dr e a m \nd h m a a h e a d h a dhege a d d h emm m m a e m e h d a d m n htn e d h ema n m m m a e e e 3.1 The \nGrammar and Library w h e a a h d h a d edm d a e a eam a a h e e e h d a Era d e h a d h e e r m h d \nn d h e e ed e a m m a e a rga m a m d a e d u e e hed u nom m m a e m e h d a d m n hum a a a e a eeTha \na hd e a m m a eaa h m a r ann htd n mtn e d h epa a m a a m a m d m e adn e d h epm e e o m mn h a e \nw h e a n n d a d e a m m m h d a n m m m a e e m a a a a a e rtd h ema n e e d e a m m a em a e a e \ne r a h r m ama e h a a a n m m m a e e r a a m a a a ehn eam e n r h a m h dtm a a h m h ea n r e e \nw h ehh e i d m a e a e emm m m a e m e h d a d h e a a a m ada n n naa h rae e e a    \n\t\t\t", "proc_id": "367845", "abstract": "<p>META4 is an object oriented language with first order reasoning capability that also includes reasoning about the <i>change</i> that the classes go through over time, efficient partial evaluation via runtime propagation of specific values, explicit run-time code generation via a source code to machine code compiling engine - not an interpreter.</p><p>Coupled with a strong encapsulation principle and certain reasonable language restrictions and programmer supplied annotations, META4 allows all parts of the program, including the compiler itself to be extended and specialized over time. Therefore, META4 is <i>mutable</i>. We introduce the concept of <i>run-time grammar extension</i>, an elegant and powerful facility for custom-programming of new <i>language semantics</i> at the <i>grammar level</i>. In other words, its <i>semantics</i> and <i>grammar</i> can be extended or even modified, even at run time to solve specific problems.</p>", "authors": [{"name": "Jason W. Kim", "author_profile_id": "81100664222", "affiliation": "EECS Dept. Lehigh University, Room 304 Packard Lab., 19 Memorial Dr. W., Bethlehem, PA", "person_id": "P135437", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.368053", "year": "2000", "article_id": "368053", "conference": "OOPSLA", "title": "The META4 programming language", "url": "http://dl.acm.org/citation.cfm?id=368053"}