{"article_publication_date": "01-01-2000", "fulltext": "\n Documenter: A simple Geographical information system, Ahmed Gomaa Nova Southeastern University Schooi \nof Computer and Information Sciences Email: ahgomaa@n0va.edu El Sayed Mostafa, SPG-Egypt Email: elsayedmostafa¢ \n,hotmail.com Abstract: Documenter is a geographical information system package developed in visualbasic6 \nand MsAccess2000. It imports and views maps with embedded databases. It includes searching, zooming and \nprinting facilities. Documenter runs under all Windows operating systems. The documenter uses ActiveX \ntechnology, as OLE especially the object handler dynamic link library that does not activate the OLE \nserver when the embedded object is used. One of The problems faced while developing the package is the \ninconsistency of maps starting points opened within the OLE container. Another problem was the interrelated \ncoordinates of a map and how to manage the zooming of the maps within the OLE container putting in consideration \nthe activation of the OLE server. The package solves those problems in a simple and creative manner. \nThe GUI design of DOCUMENTER is collaboration between the system users and the developers. The software \nis developed using the IEF methodology. DOCUMENTER uses the OLE technology in a creative manner, which \nhelps in minimizing the maps access time, and eliminates the need of the ole server while running the \nsystem a fact that decreases tremendously the licensing expenses. Figurel gives a general overview of \nthe system. Perm/ssion to make digital or hard copies of all or part of this work for personal or classroom \nuse is granted without fee provided that copies are not made or distributed for profit or commercial \nadvantage and that copies bear this notice and the full citation on the first page. To copy otherwise, \nto republish, to post on servers or to redistribute to lists, requires prior specific permission and/or \na fee. OOPSLA 2000 Companion Minneapolis, Minnesota (c) Copyright ACM 2000 1-58113-307-3/00/10...$5.00 \n183 CO ~ 0 0 &#38;#169; :X e~ m~ ~ o o ~ 0 = 1 If ............................ o ~,~ o = = 0 '8 = \n= 0 > \n\t\t\t", "proc_id": "367845", "abstract": "<p>Documenter is a geographical information system package developed in visualbasic6 and MsAccess2000. It imports and views maps with embedded databases. It includes searching, zooming and printing facilities. Documenter runs under all Windows operating systems. The documenter uses ActiveX technology, as OLE especially the object handler dynamic link library that does not activate the OLE server when the embedded object is used. One of The problems faced while developing the package is the inconsistency of maps starting points opened within the OLE container. Another problem was the interrelated coordinates of a map and how to manage the zooming of the maps within the OLE container putting in consideration the activation of the OLE server. The package solves those problems in a simple and creative manner. The GUI design of DOCUMENTER is collaboration between the system users and the developers. The software is developed using the IEF methodology. DOCUMENTER uses the OLE technology in a creative manner, which helps in minimizing the maps access time, and eliminates the need of the ole server while running the system a fact that decreases tremendously the licensing expenses.</p><p>Figure1 gives a general overview of the system.</p>", "authors": [{"name": "Ahmed Gomaa", "author_profile_id": "81100117619", "affiliation": "Nova Southeastern University, School of Computer and Information Sciences", "person_id": "P11344", "email_address": "", "orcid_id": ""}, {"name": "El Sayed Mostafa", "author_profile_id": "81100508742", "affiliation": "SPG-Egypt", "person_id": "P76106", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/367845.368101", "year": "2000", "article_id": "368101", "conference": "OOPSLA", "title": "Documenter: a simple geographical information system", "url": "http://dl.acm.org/citation.cfm?id=368101"}