{"article_publication_date": "08-25-2003", "fulltext": "\n Invited Talk Conservation of Information: Applications in Functional, Reversible, and Quantum Computing \nThomas Knight, Jr. Massachusetts Institute of Technology tk@ai.mit.edu Microscopic physics is entirely \nreversible, yet almost all computation is done using irreversible processes. Adding two numbers together, \nfor example, destroys information, unless one of the numbers is retained. Over the past few years, some \nadvantages of taking reversible computation seriously have emerged first in the context of saving energy, \nthrough the development of dissipationless logic, and then in the promise of quantum computation, which \nis necessarily also reversible and dissipationless. The necessary conservation of information in these \nsystems raises the question of how we can best capture this strong constraint from an abstract point \nof view. Already ideas such as linear logic can be applied, but the full implementation of conservative \nlogic ideas will require language and architectural innovation and a rethink of our computational models. \nCopyright is held by the author/owner(s). ICFP 03, August 25 29, 2003, Uppsala, Sweden. ACM 1-58113-756-7/03/0008. \n\t\t\t", "proc_id": "944705", "abstract": "Microscopic physics is entirely reversible, yet almost all computation is done using irreversible processes. Adding two numbers together, for example, destroys information, unless one of the numbers is retained. Over the past few years, some advantages of taking reversible computation seriously have emerged -- first in the context of saving energy, through the development of dissipationless logic, and then in the promise of quantum computation, which is necessarily also reversible and dissipationless.The necessary conservation of information in these systems raises the question of how we can best capture this strong constraint from an abstract point of view. Already ideas such as linear logic can be applied, but the full implementation of conservative logic ideas will require language and architectural innovation and a rethink of our computational models.", "authors": [{"name": "Thomas Knight", "author_profile_id": "81339509918", "affiliation": "Massachusetts Institute of Technology", "person_id": "PP39032513", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/944705.944706", "year": "2003", "article_id": "944706", "conference": "ICFP", "title": "Conservation of information: applications in functional, reversible, and quantum computing", "url": "http://dl.acm.org/citation.cfm?id=944706"}