{"article_publication_date": "01-01-1988", "fulltext": "\n\t\t\t", "proc_id": "62083", "abstract": "<p>The programming of the interrupt handling mechanisms, process switching primitives, scheduling mechanisms, and synchronization primitives of an operating system for a multiprocessor require both efficient code in order to support the needs of high-performance or real-time applications and careful organization to facilitate maintenance. Although many advantages have been claimed for object-oriented class hierarchical languages and their corresponding design methodologies, the application of these techniques to the design of the primitives within an operating system has not been widely demonstrated.</p><p>To investigate the role of class hierarchical design in systems programming, the authors have constructed the <italic>Choices</italic> multiprocessor operating system architecture using the C++ programming language. During the implementation, it was found that many operating system design concerns can be represented advantageously using a class hierarchical approach, including: the separation of mechanism and policy; the organization of an operating system into layers, each of which represents an abstract machine; and the notions of process and exception management. In this paper, we discuss an implementation of the low-level primitives of this system and outline the strategy by which we developed our solution.</p>", "authors": [{"name": "Vincent Russo", "author_profile_id": "81100638744", "affiliation": "Department of Computer Science, University of Illinois at Urbana-Champaign, 1304 W. Springfield Ave., Urbana, IL", "person_id": "P291450", "email_address": "", "orcid_id": ""}, {"name": "Gary Johnston", "author_profile_id": "81332507183", "affiliation": "Department of Computer Science, University of Illinois at Urbana-Champaign, 1304 W. Springfield Ave., Urbana, IL", "person_id": "P94107", "email_address": "", "orcid_id": ""}, {"name": "Roy Campbell", "author_profile_id": "81100212328", "affiliation": "Department of Computer Science, University of Illinois at Urbana-Champaign, 1304 W. Springfield Ave., Urbana, IL", "person_id": "PP15025810", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/62083.62105", "year": "1988", "article_id": "62105", "conference": "OOPSLA", "title": "Process management and exception handling in multiprocessor operating systems using object-oriented design techniques", "url": "http://dl.acm.org/citation.cfm?id=62105"}