{"article_publication_date": "10-01-1995", "fulltext": "\n Patterns: Cult to Culture? Organizer: Steven Fraser, Bell Northern Research; Moderator: Honna Segel, \nBell Northem Research Panelists: Grady Booth, Rational; Frank Buschmann, Siemens; Jim Coplien. AT&#38;T; \nNorm Kerth. Elite Systems; Ivar Jacobson, Objectory; Mary Beth Rosson,Virginia PolyTechnic Institute \n&#38; State University Facilitators: Arthur Riel, Alistair Cockbum, Wade Cunningham. Introduction Are \npatterns part of an object-oriented cult , or are they part of mainstream culture? The purpose of this \npanel was to share the experiences of the pan- elists and offer some practical advice on how the identification \nand application of patterns could evolve from cult to a culture. For the purposes of the panel discussion, \ncult and culture were defined as follows: cult: a group with great devotion to some person, idea or thing, \nparticularly when such devotion may be viewed as some sort of intellectual fad (in the sense of early \nadopters of a new technology, i.e. the leaders) culture: a group that has achieved a state of ad-vancement \nin civilization with distinctive beliefs. traditions, etc. (in the sense of the creation of a broad following, \nwhere the new technology is part of the established business practice).  Panelist opening remarks Frank \nBuschmann A pattern-centric community exists within the broader software industry although as a culture \nthis community is not yet very mature. In Europe, pat-terns are used, but generally treated with some \nskepticism. Practitioners tend to recognize that pat- terns can t be used to solve every problem. The \nval- ue of patterns is in both in providing a way to clarify and codify experience, as well as being \na succinct way of sharing experience. Patterns are only useful if they are shared; it therr is no intent \nto share patterns, then pattern technology is doomed. Grady Booth Awareness of patterns is pervasive, \nalthough in practice only a small percentage of people or corn- panies are actually capturing or using \nthem. Grady has seen no large software systems built and deliv- ered based wholly on the use of patterns. \nHou.~ver. there are systems which have components which were built using known patterns. Patterns can \nmt)ht successfully be applied within a mature develop-ment organization working with architecture-based \nsoftware development. Part of pattem technology maturity is the recognition of software architect as \na role. Understanding the principles and values of ;i sys- tem is a way to understand an rqtinizatiorl \nor cnvi- ronment on a deeper level than simply .\\tudyin~ thz surface symptoms. Culture works at this \ndeep Ie\\:-el, as do patterns. The primary use of patterns is in understanding software at this deep third \nlevel . Patterns can be used to streamline communication about system architecture between professional \ncolleagues. Patterns provide a basis t or systeln ar-chitecture documentation, allowing a more com-prehensive \nunderstanding, of the design issues and solutions. Jim finished with a plea to Beware the hype surrounding \npatterns, as their true valur will then be lost in the glitter.  Ivar Jacobson Ivar began by defining \na pattern as. A problem and a solution which recurs over and over again. The technology must be expressed \nin much Inore concrete terms than it is at present. Clsxl\\; LI gotd way to express the problem is to \nus2 IIW ~152 C;I.\\T technology. since tha.t is exactly wha.t it was devel-oped to do. The solution can \nbe expressed in tell-ns t)f c1b.ject.s. relationships, and interactions. An ab- stract use case is simply \nthe rigorous expression of the problem part of a pattern. An object framework can represent and express \nthe solution part. Norm Kerth technology triggered classic stage process, acting foreign trIggel s. \na the appears be in since the industry is transition. This similar to situation caused object-oriented \nwas first caus-ing turmoil until industry was to adjust assimilate the Patterns are a the effect now. \nmore craziness be expected these early They are ready tom-time . Mary Rossorz ML~IY presented the view \n. She sented the of a she had of 61 Science departments. per-cent responded to questions: Do now teach \nabout patterns your CS lum? It should you The response . 1 said they Not Sure they taught . 19 No , although \nof these they should. 16 said The conclusion that patterns be taught part of science, but educational \nin-need examples pattems from wlrh which develop the Questions Answers audience then Are a or culture? \naudience about split its although number people stained. audience commented that if patterns were a culture \nthey should be leading to mob-e ci\\,ilization. As in the early days of science 86 Austin, there appear \nto be too many facts to assimilate eas-ily, and a taxonomy is needed. Question for Frank Buschmann: One \nperson ex-pressed a concern about the patterns being used as cookbook recipes for system architectural \ndesign, leading to a naive approach to problem solving. He preferred them to be pedagogical mental aids \nin-stead. The panel agreed that a cookbook approach to system architecture design is not very effective, \nalthough patterns can a starting and a upon which build. One com- mented he had the patterns by the of \nFour literally, which not very Question for How do keep managers abusing patterns? was some that corporate \nwould see technology as panacea for system ills, creating to- unrealistic expectations patterns practitio-The \npanel that the situation is They also that over some programmers managers, and might help. suggested \nthat managers be with distinguishing management patterns, as the room pattern ) the objective to directly \nthe useful- of the Ivar commented manag-ers a taxonomy patterns, and to know to use There was brief exchange \nthe source the idea patterns, namely building architect Alexander. Some that software are obviously cult, \nbecause was not known even architecture cir-[So how he become in soft-The difference a design and one \nby Alexander explained thus: patterns are way of Alex-ander s are a of structuring check-ing design. \nAlexander a way organize a along pattern so that could readily for accuracy requirements compliance. \nOctober Comment from Jim: Architecture is 8000 years old and its patterns should be relatively mature \nwhen compared to software, which is really only about 40 years old. Software technology is far from be-ing \nmature, although it might not take 8000 years to get there. However, stable and long lasting patterns \nin software might not be evident for some time to come. Question for Grady: What is the difference be-tween \ndesign patterns and generative patterns? De-sign patterns are a way of looking at systems of objects \nas separate entities. Alexander s focus is to acquire wisdom and organize it for thinking. The value \nof these patterns is as a way of thinking; it s a different way of doing design. Over the course of the \nsession, each member of the Gang of Four (G amma et.al.) was asked to com- ment about whether patterns \nwere a cult or a cul- ture. They all individually replied No comment. Question from Bjorne Stroustrup: \nPatterns are a cult now, because it is too soon for them to be as- similated. He suggested a way to focus \nwhether patterns are becoming a culture is to ask the ques- tion what is not a pattern? Jim responded \nthat patterns deal with specific points in design space, but there are lots of design techniques which \ndo not apply to patterns. He reiterated his opening re-marks about patterns being a deeper part of an \nor-ganization s value system. Grady commented that patterns are not architec-ture. but enable simplicity \nand elegance. Later in the discussion, someone offered that a not-pat-tern is a problem-solution pair \nfor which reoc-currence has not yet been recognized. Question for Jim: Engineers use codes of practice \nto ensure that they construct things that work. Building architecture exists within codes and stan- dards \nwhich define constraints on the design and which provide a measure of understanding and goodness. No \nsuch codes or standards exist for software. What is the problem with getting to soft- ware engineering \ncodes of practice? Jim suggested that understanding 80% of the patterns in the Gang of Four s book might \nconstitute a measure of con- petence in object-orientatiol~. He further comment-ed that the industry \nis clearly looking for h?lp ~IIIIII other disciplines. and that that is part ot why thr pattern movement \nbegan in the first pluc?. Honna commented that engineering is based on 3 continuous mathematics, and \nthat therefore when ;1 small change is made to a design, the effects can be predicted. Since most engineering \nin computer sci- ence is not based on such a continuous mathemat-ics, the effects of a change cannot \nalways be predicted. Codes and standards in softwal-e engi- neering will therefore take a different fmn \nthan in. for example, civil engineering. and patterns might be such a form. Question from Kent Beck: \nSince patterns deal with design, does their use factor out creativity? How will we keep from driving \ngood people out ot the industry? The panel felt that skill with patterns is based on experience, and \npatterns need to be com- bined using experience and creativitv. PII~~IUI~-mers need Atemative soluticlns: \nto ~llahlc architectures. you don t h;lve to build c\\~~ryrh111; Mary Beth also commented that it would \ndepend on how pattern usage was presented. Crddy corn-mented that creative people implicitly undet%uld \nthe importance of patterns as an enabler. Frank re-minded us that the computing community had the same \nconcerns moving from Assembly to FOR-TRAN. Jim finished with the comment that the concern that patterns \nturn programmers into con-sultant hasn t been demonstrated. The cultural goal of patterns was addressed: \nWhJt kind of culture are we aspiring to? The conclusion that the patterns may become invisible over time. \nThe corporate process becomes so attuned to iden- tifying patterns that it becomes part of the corpo- \nrate culture. and isn t written down. This cuxs the value of patterns to be lost since they are no longer \ndistinguished. One part of the culture n~~d.s to hc .I taxonomy by which thr ideas ;tnd knc~\\\\,Ir~d~~~ \nL I~ bodied in the patterns can be located and used rath- er than being lost. Patterns formalize a technology \nwithin an organization A culture is defined by its normative behavior, sto-ries, rituals. and symbols; \ntherefore, how can this notion of patterns be a culture? The panel respond- ed that rituals are found \nin design processes, peer reviews. coding marathons. etc. These processes, combined with the defined \nand agreed-upon sym-bols used to express the technology forms the cul- ture. Patterns might not be a \nculture, rather, there might be an undistinguished part of the culture. Henna asked how patterns development \ncan be en- couraged if there is no way for a patterns guru to profit from their expertise. This is similar \nto the problem of making a living publishing class librar- ies: how does one profit from non-patentable \nor copyright-able results? Neither panel nor audience hd suggestions. Concern was expressed about academics \nteaching design patterns to students if the academics have little experience of real world design. It \nwas sug- gested that industry must provide feedback and in- formation to academics to ensure quality \neducation regarding patterns. 88 Austin, TX October 15-19, 1995  \n\t\t\t", "proc_id": "260094", "abstract": "", "authors": [{"name": "Steven Fraser", "author_profile_id": "81339499863", "affiliation": "Bell Northern Research", "person_id": "PP35043323", "email_address": "", "orcid_id": ""}, {"name": "Honna Segel", "author_profile_id": "81342510684", "affiliation": "Bell Northern Research", "person_id": "PP43143598", "email_address": "", "orcid_id": ""}, {"name": "Grady Booch", "author_profile_id": "81100557878", "affiliation": "Rational", "person_id": "PP31047618", "email_address": "", "orcid_id": ""}, {"name": "Frank Buschmann", "author_profile_id": "81100407462", "affiliation": "Siemens", "person_id": "P85749", "email_address": "", "orcid_id": ""}, {"name": "Jim Coplien", "author_profile_id": "81100241805", "affiliation": "AT&T", "person_id": "PP14093302", "email_address": "", "orcid_id": ""}, {"name": "Norm Kerth", "author_profile_id": "81100339993", "affiliation": "Elite Systems", "person_id": "P210127", "email_address": "", "orcid_id": ""}, {"name": "Ivar Jacobson", "author_profile_id": "81100030692", "affiliation": "Objectory", "person_id": "P117558", "email_address": "", "orcid_id": ""}, {"name": "Mary Beth Rosson", "author_profile_id": "81335496622", "affiliation": "Virginia PolyTechnic Institute & State University", "person_id": "PP42051497", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260094.260250", "year": "1995", "article_id": "260250", "conference": "OOPSLA", "title": "Patterns (Panel): cult to culture?", "url": "http://dl.acm.org/citation.cfm?id=260250"}