{"article_publication_date": "09-09-2012", "fulltext": "\n\t\t\t", "proc_id": "2364527", "abstract": "<p>Secure multiparty computation (SMC) permits a collection of parties to compute a collaborative result, without any of the parties gaining any knowledge about the inputs provided by other parties. Specifications for SMC are commonly presented as boolean circuits, where optimizations come mostly from reducing the number of multiply-operations (including <i>and</i>-gates) - these are the operations which incur significant cost, either in computation overhead or in communication between the parties. Instead, we take a language-oriented approach, and consequently are able to explore many other kinds of optimizations. We present an efficient and general purpose SMC table-lookup algorithm that can serve as a direct alternative to circuits. Looking up a private (i.e. shared, or encrypted) <i>n</i>-bit argument in a public table requires <i>log(n)</i> parallel-and operations. We use the advanced encryption standard algorithm (AES) as a driving motivation, and by introducing different kinds of parallelization techniques, produce the fastest current SMC implementation of AES, improving the best previously reported results by well over an order of magnitude.</p>", "authors": [{"name": "John Launchbury", "author_profile_id": "81548019085", "affiliation": "Galois, Inc., Portland, OR, USA", "person_id": "P3804336", "email_address": "john@galois.com", "orcid_id": ""}, {"name": "Iavor S. Diatchki", "author_profile_id": "81100345874", "affiliation": "Galois, Inc., Portland, OR, USA", "person_id": "P3804337", "email_address": "diatchki@galois.com", "orcid_id": ""}, {"name": "Thomas DuBuisson", "author_profile_id": "81548019087", "affiliation": "Galois, Inc., Portland, OR, USA", "person_id": "P3804338", "email_address": "tommd@galois.com", "orcid_id": ""}, {"name": "Andy Adams-Moran", "author_profile_id": "81548019088", "affiliation": "Galois, Inc., Portland, OR, USA", "person_id": "P3804339", "email_address": "adams-moran@galois.com", "orcid_id": ""}], "doi_number": "10.1145/2364527.2364556", "year": "2012", "article_id": "2364556", "conference": "ICFP", "title": "Efficient lookup-table protocol in secure multiparty computation", "url": "http://dl.acm.org/citation.cfm?id=2364556"}