{"article_publication_date": "09-09-2012", "fulltext": "\n\t\t\t", "proc_id": "2364527", "abstract": "<p>We present techniques that enable higher-order functional computations to \"explain\" their work by answering questions about how parts of their output were calculated. As explanations, we consider the traditional notion of program slices, which we show can be inadequate, and propose a new notion: trace slices. We present techniques for specifying flexible and rich slicing criteria based on partial expressions, parts of which have been replaced by holes.</p> <p>We characterise program slices in an algorithm-independent fashion and show that a least slice for a given criterion exists. We then present an algorithm, called <i>unevaluation</i>, for computing least program slices from computations reified as traces. Observing a limitation of program slices, we develop a notion of <i>trace slice</i> as another form of explanation and present an algorithm for computing them. The unevaluation algorithm can be applied to any subtrace of a trace slice to compute a program slice whose evaluation generates that subtrace. This close correspondence between programs, traces, and their slices can enable the programmer to understand a computation interactively, in terms of the programming language in which the computation is expressed. We present an implementation in the form of a tool, discuss some important practical implementation concerns and present some techniques for addressing them.</p>", "authors": [{"name": "Roly Perera", "author_profile_id": "81548019160", "affiliation": "University of Birmingham, Birmingham, United Kingdom &#38; MPI-SWS, Kaiserslautern, Germany", "person_id": "P3804393", "email_address": "rolyp@mpi-sws.org", "orcid_id": ""}, {"name": "Umut A. Acar", "author_profile_id": "81100077236", "affiliation": "Carnegie Mellon University, Pittsburgh, PA, USA &#38; MPI-SWS, Kaiserslautern, Germany", "person_id": "P3804394", "email_address": "umut@cs.cmu.edu", "orcid_id": ""}, {"name": "James Cheney", "author_profile_id": "81100057679", "affiliation": "University of Edinburgh, Edinburgh, United Kingdom", "person_id": "P3804395", "email_address": "jcheney@inf.ed.ac.uk", "orcid_id": ""}, {"name": "Paul Blain Levy", "author_profile_id": "81100154557", "affiliation": "University of Birmingham, Birmingham, United Kingdom", "person_id": "P3804396", "email_address": "P.B.Levy@cs.bham.ac.uk", "orcid_id": ""}], "doi_number": "10.1145/2364527.2364579", "year": "2012", "article_id": "2364579", "conference": "ICFP", "title": "Functional programs that explain their work", "url": "http://dl.acm.org/citation.cfm?id=2364579"}