{"article_publication_date": "06-21-1989", "fulltext": "\n\t\t\t", "proc_id": "73141", "abstract": "<p>We present a new static analysis method for first-class continuations that uses an <italic>effect system</italic> to classify the control domain behavior of expressions in a typed polymorphic language. We introduce two new control effects, goto and comefrom, that describe the control flow properties of expressions. An expression that does not have a goto effect is said to be <italic>continuation following</italic> because it will always call its passed return continuation. An expression that does not have a comefrom effect is said to be <italic>continuation discarding</italic> because it will never preserve its return continuation for later use. Unobservable control effects can be <italic>masked</italic> by the effect system. Control effect soundness theorems guarantee that the effects computed statically by the effect system are a conservative approximation of the dynamic behavior of an expression.</p><p>The effect system that we describe performs certain kinds of control flow analysis that were not previously feasible. We discuss how this analysis can enable a variety of compiler optimizations, including parallel expression scheduling in the presence of complex control structures, and stack allocation of continuations. The effect system we describe has been implemented as an extension to the FX-87 programming language.</p>", "authors": [{"name": "P. Jouvelot", "author_profile_id": "81100056957", "affiliation": "Ecole des Mines, 60 bvd Saint-Michel, 75272, PARIS, France and LCS, Massachusetts Institute of Technology, 545 Technology Square, Cambridge, MA", "person_id": "PP31081774", "email_address": "", "orcid_id": ""}, {"name": "D. K. Gifford", "author_profile_id": "81100151844", "affiliation": "LCS, Massachusetts Institute of Technology, 545 Technology Square, Cambridge, MA", "person_id": "PP39029894", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/73141.74837", "year": "1989", "article_id": "74837", "conference": "PLDI", "title": "Reasoning about continuations with control effects", "url": "http://dl.acm.org/citation.cfm?id=74837"}