{"article_publication_date": "06-21-1989", "fulltext": "\n\t\t\t", "proc_id": "73141", "abstract": "<p>Cedar is the name for both a language and an environment in use in the Computer Science Laboratory at Xerox PARC since 1980. The Cedar language is a superset of Mesa, the major additions being garbage collection and runtime types. Neither the language nor the environment was originally intended to be portable, and for many years ran only on D-machines at PARC and a few other locations in Xerox. We recently re-implemented the language to make it portable across many different architectures. Our strategy was, first, to use machine-dependent C code as an intermediate language, second, to create a language-independent layer known as the Portable Common Runtime, and third, to write a relatively large amount of Cedar-specific runtime code in a subset of Cedar itself. By treating C as an intermediate code we are able to achieve reasonably fast compilation, very good eventual machine code, and all with relatively small programmer effort. Because Cedar is a much richer language than C, there were numerous issues to resolve in performing an efficient translation and in providing reasonable debugging. These strategies will be of use to many other porters of high-level languages who may wish to use C as an assembler language without giving up either ease of debugging or high performance. We present a brief description of the Cedar language, our portability strategy for the compiler and runtime, our manner of making connections to other languages and the Unix<supscrpt>*</supscrpt> operating system, and some measures of the performance of our &#8220;Portable Cedar&#8221;.</p>", "authors": [{"name": "R. Atkinson", "author_profile_id": "81406599292", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP31069673", "email_address": "", "orcid_id": ""}, {"name": "A. Demers", "author_profile_id": "81100529925", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP39070938", "email_address": "", "orcid_id": ""}, {"name": "C. Hauser", "author_profile_id": "81410595060", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP14190508", "email_address": "", "orcid_id": ""}, {"name": "C. Jacobi", "author_profile_id": "81100149159", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP14062418", "email_address": "", "orcid_id": ""}, {"name": "P. Kessler", "author_profile_id": "81100352479", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP14126138", "email_address": "", "orcid_id": ""}, {"name": "M. Weiser", "author_profile_id": "81100068691", "affiliation": "Xerox PARC, 3333 Coyote Hill Road, Palo Alto, CA", "person_id": "PP37039839", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/73141.74847", "year": "1989", "article_id": "74847", "conference": "PLDI", "title": "Experiences creating a portable cedar", "url": "http://dl.acm.org/citation.cfm?id=74847"}