{"article_publication_date": "01-01-2001", "fulltext": "\n\t\t\t", "proc_id": "360204", "abstract": "The \"size-change termination\" principle for a first-order functional language with well-founded data is: a program terminates on all inputs if <i>every infinite call sequence</i> (following program control flow) would cause an infinite descent in some data values.Size-change analysis is based only on local approximations to parameter size changes derivable from program syntax. The set of infinite call sequences that follow program flow and can be recognized as causing infinite descent is an <i>&amp;omega;</i>-regular set, representable by a B&amp;uuml;chi automaton. Algorithms for such automata can be used to decide size-change termination. We also give a direct algorithm operating on \"size-change graphs\" (without the passage to automata).Compared to other results in the literature, termination analysis based on the size-change principle is surprisingly simple and general: lexical orders (also called lexicographic orders), indirect function calls and permuted arguments (descent that is not <i>in-situ</i>) are all handled <i>automatically and without special treatment</i>, with no need for manually supplied argument orders, or theorem-proving methods not certain to terminate at analysis time.We establish the problem's <i>intrinsic complexity</i>. This turns out to be surprisingly high, complete for PSPACE, in spite of the simplicity of the principle. PSPACE hardness is proved by a reduction from Boolean program termination. An ineresting consequence: the same hardness result applies to many other analyses found in the termination and quasitermination literature.", "authors": [{"name": "Chin Soon Lee", "author_profile_id": "81406598945", "affiliation": "Department of Computer Science and Software Engineering, The University of Western Australia, Nedlands 6907", "person_id": "P45404", "email_address": "", "orcid_id": ""}, {"name": "Neil D. Jones", "author_profile_id": "81452616043", "affiliation": "Datalogisk Institut, University of Copenhagen, Universitetsparken, DK-2100 Copenhagen, Denmark", "person_id": "PP39073923", "email_address": "", "orcid_id": ""}, {"name": "Amir M. Ben-Amram", "author_profile_id": "81100295679", "affiliation": "Academic College of Tel-Aviv-Yaffo, 4 Antokolsky Steet, Tel-Aviv 64044, Israel", "person_id": "P16002", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/360204.360210", "year": "2001", "article_id": "360210", "conference": "POPL", "title": "The size-change principle for program termination", "url": "http://dl.acm.org/citation.cfm?id=360210"}