{"article_publication_date": "01-01-1985", "fulltext": "\n\t\t\t", "proc_id": "318593", "abstract": "<p>To accommodate polymorphic data types and operations, several computer scientists--most notably MacQueen, Plotkin, and Sethi--have proposed formalizing types as <italic>ideals</italic>. Although this approach is intuitively appealing, the resulting type system is both complex and restrictive because the type constructor that creates function types is not monotonic, and hence not computable. As a result, types cannot be treated as data values, precluding the formalization of type constructors and polymorphic program modules (where types are values) as higher order computable functions. Moreover, recursive definitions of new types do not necessarily have solutions.</p><p>This paper proposes a new formulation of types--called <italic>intervals</italic>--that subsumes the theory of types as ideals, yet avoids the pathologies caused by non-monotonic type constructors. In particular, the set of interval types contains the set of ideal types as a proper subset and all of the primitive type operations on intervals are extensions of the corresponding operations on ideals. Nevertheless, all of the primitive interval type constructors including the function type constructor and type quantifiers are computable operations. Consequently, types are higher order data values that can be freely manipulated within programs.</p><p>The key idea underlying the formalization of types as intervals is that <italic>negative</italic> information should be included in the description of a type. Negative information identifies the finite elements that do not belong to a type, just as conventional, positive information identifies the elements that do. Unless the negative information in a type description is the exact complement of the positive information, the description is partial in the sense that it approximates many different types--an interval of ideals between the positive information and the complement of the negative information. Although programmers typically deal with total (maximal) types, partial types appear to be an essential feature of a comprehensive polymorphic type system that accommodates types as data, just as partial functions are essential in any universal programming language.</p>", "authors": [{"name": "Robert Cartwright", "author_profile_id": "81406592800", "affiliation": "Computer Science Department, Rice University, Houston, TX", "person_id": "PP43116956", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/318593.318604", "year": "1985", "article_id": "318604", "conference": "POPL", "title": "Types as intervals", "url": "http://dl.acm.org/citation.cfm?id=318604"}