{"article_publication_date": "10-25-2009", "fulltext": "\n Provenance: A Future History James Cheney Stephen Chong Nate Foster UniversityofEdinburgh HarvardUniversity \nUniversityofPennsylvania jcheney@inf.ed.ac.uk chong@seas.harvard.edu jnfoster@cis.upenn.edu Margo Seltzer \nStijn Vansummeren* HarvardUniversity Hasselt University/TransnationalUniversityof margo@eecs.harvard.edu \nLimburg, Belgium stijn.vansummeren@uhasselt.be Abstract Science, industry, and society are being revolutionized \nby radical new capabilitiesforinformation sharing,distributed computation, and collaboration offered \nby the World Wide Web. This revolution promises dramatic bene.ts but also poses serious risks due to \nthe .uid nature of digital infor­mation. One important cross-cutting issue is managing and recording \nprovenance, or metadata aboutthe origin, context, orhistory ofdata.Weposit thatprovenance willplay a \ncen­tral rolein emerging advanceddigitalinfrastructures.In this paper, we outline the current state of \nprovenance research andpractice,identifyhard openresearchproblemsinvolving provenance semantics, formal \nmodeling, and security, and articulate a visionfor thefuture ofprovenance. Categories and Subject Descriptors \nD.3.1[Programming Languages]:FormalDe.nitions andTheory GeneralTerms Languages,Security,Reliability Keywords \nprovenance,integrity, semantics A future history of provenance Transcribedkeynote remarksfromthe2019Federated \nProvenanceConference,by[inaudible] We won! Provenance is everywhere: it s part of ev­ery storage system \nand every application; it s secure; it s * Stijn Vansummeren is a Postdoctoral Fellow of the Research \nFoundation Flanders(Belgium). Permission to make digital or hard copies of all or part of this work for \npersonal or classroomuseisgranted withoutfeeprovided that copiesarenot madeordistributed forpro.tor commercial \nadvantage andthat copiesbearthis notice andthefull citation onthe .rstpage.Tocopy otherwise,torepublish,topostonserversortoredistribute \ntolists, requiresprior speci.cpermission and/or afee. OOPSLA2009, October25 29,2009,Orlando,Florida,USA. \nCopyright c &#38;#169; 2009ACM978-1-60558-768-4/09/10. . .$10.00 queryable; it s indexed by standard \nsearch engines and can bequeriedanywhere. Provenanceispervasive,invisible, andhandled automat­ically \nby default. Ten years ago people regularly used data without knowing where it was hosted or originated. \nToday such a thing is unthinkable. Documents whose origins are unknown arehighly suspect andquickly attractthe \nattention of a smallbut enthusiastic anti-plagiarism community. Bothpublic andcon.dentialprovenanceareincorporated \ninto the algorithms employedby major search engines, who use theprovenance of apage to weighits reliability, \nanddi­rect searches toward more reputable results.Individuals are able to query where their data is being \nused elsewhere on the Web, and can derive economic bene.t and acclaim by providingusefuldata.TheSemanticWeb \nonlybecametruly compelling once people had an incentive for contributing high-quality metadata. Provenance \ntracking provided this motivation by ensuring recognition for contributors. Some curators even make a \nliving managingSemanticWeb meta­data. The old vertically-integrated media industries (particu­larlymusic \nandprint media)lovedprovenance fora while. They thought it would revive their dream of complete con­trol \nover their intellectual property through digital rights management.Indeed,provenanceis now used to ensure \nthat authors and creators are recognized and rewarded for their work, whether they areindependent or \naf.liated with a ma­jor medialabelor news agency.Thekeydifferencebetween the success of provenance tracking \nand the failure of ear­lier attempts atDRMisthatprovenanceisbased on volun­tary participation in the \nonline community, not on central­izedcontrolimposedbylegislation orlawsuits.Creators are free to decide \nwhether to retain or expose provenance, and recipients of suchinformation arefree todecide whether to \nbelieve or trustit. Buthowdidwegethere?  By 2009, it was widely recognized that provenance was important,buttheeffectsofMoore \nsWall wereonlybegin­ning to be felt, and 20th-century assumptions about stor­age and computational overhead \nstill held sway. The cost of storage was still relatively high around $20 for a ter­abyte instead of \npennies. Likewise, typical personal com­puters contained only a few cores rather than the hundreds or \nthousands now common today, and reliable, usable con­current programming languages had not yet become \nmain­stream.Now, of course, the extra storage and computational overhead ofinstrumentingprograms to record \nand maintain detailed provenance metadata is effectively zero. Indeed, provenancepaysforitselfin terms \nofdecreasedliabilityfor failures most insurers today won t even cover businesses that usehardware or \nsoftware thatis notprovenance aware. A thornier issue was how to manage and search the masses of detailed \nprovenance information that began to be generated. Early work viewed provenance as a simple directed \nacyclic graph. While rich languages for querying graph-likedatahadalreadybeenresearched,theyhadnotyet \nbeenintegratedinto scalable, robust, andindustrial-strength systems. However, the development of DBMSs \nsupporting fast graph queries was only a .rst step towards the rich provenance query languages we have \ntoday. Provenance queries essentially query the behavior of programs, and it was a signi.cant challenge \nto formulate nontrivial prove­nance queries manually over the raw, low-level representa­tionasaDAG.Instead,the \n.rsthalf of thisdecadesawthe developmentof advancedprovenancequery languagesthat incorporated ideas from \nre.ective and aspect-oriented pro­gramming. These languages make it easy for programmers to query provenance \nusing the syntax they already use to write programs. A nice side-bene.t of this was that major programming \nlanguages and implementations .nally took database programminglanguageintegration seriously, solv­ingthe \nimpedancemismatch problemonceandforall. Some cynics admitted that provenance might be impor­tant for \ncritical applications such as banking or medical records, but doubted that it would carry over to general­purposeapplications: \nassoonasyoumoveanobjectfrom one system to another, they said, you re going to lose its provenance we \ncan t even do extended attributes in a portable way! But researchers anddevelopersfrom ahost ofdifferentareasbandedtogetherandformeda \nprovenance community .Muchlikein the earlydays of theInternet and WorldWideWeb,theirgrass-rootseffortsledtotherapidde­velopmentandimplementationofdefacto \nstandardsfor rep­resentingandtransportingprovenancemetadata.These were eventually codi.edbytheW3C and \nother organizations. Theprovenancetidebegantoturnwhenthe .nancialin­dustryimplodedin2008.In the wake \nofthisdisaster, which raised the stakes for regulatory oversight, the US Congress passed the 2010 Oversight \nAct which mandated that every major .nancialtransactionhave a veri.able record.Thishad an energizingeffect \nontheprovenancecommunitysimilarto that oftheDepartment ofDefense sOrangeBook on the se­curity communityin \nthe1970s.Other nationsfollowed suit, legislating stronger standards for transparency for both .­nancial \nand socialpolicydata. Securityandprivacy alsohad tobe completely rethought with the adoption of pervasive \nprovenance technology. Nowadays, users canlimit access toboth sensitivedata and its provenance, at the \ncost that others may be less willing to believe or trust their data. The tension between privacy and \nprovenance was graphically illustrated by the protests inIranfollowing the contested election ofJune2009.Sites \nsuch as Twitter, Facebook and YouTube played an essen­tial role early on, making it possible for protesters \nto con­nect with each otherandjournaliststo reporttothe outside world withoutgovernmentinterference,but \nthere was also a greatdealofunveri.able noise anddeliberatemisinforma­tion.Moreover,thisinformation(alongwithmoretraditional \nforms ofsurveillance)waslater usedeffectivelyto single out prominentFacebook orTwitter usersforpersecutioninthe \nbrutalrepressionthatfollowedtheprotests. In the rest of this talk, I ll ask you to think back to the \nsummer of 2009. It was a pivotal time for this .eld. Many of these ideas were in their infancy, and almost \nno one had anyideahowimportantprovenance wouldbecome over the next 10 years. In fact, many computer scientists \nhad either not heard of provenance, or thought it was either trivial or outrightimpossible.Some earlypapers \nonprovenance were vague about either what they wanted to accomplish, or what they were actuallyproposingas \nsolutions.Manypaperspro­posed solutions to related problems, but did not provide enough detail about \neither solution or problem to make a real comparisonpossible.It wasquitedif.cultfor newcom­erstothe .eld \ntounderstandwhat wasreally essential.Gen­eral foundationalde.nitions, clearproblem statements, and theories \nofprovenance onlystartedto coalescebythe end of thelastdecade.Theseideasplayeda central rolein all ofthe \nabove developments, because a cohesive provenance com­munity would have been impossible before everyone \nwas able to agree on basic de.nitions. Perhaps the most impor­tantinsight was... [The restof the recordingisinaudible.] \n1. Introduction In an ideal world, software systems would be engineered to the highest standards. Programs \nwould be expressed in intuitive high-level languages and their behavior would be checked against cleanformal \nspeci.cations.Data wouldbe classi.ed accordingtoprecise schemas and curated with ac­curate metadata.But \nwedo notlivein thatideal world.Few real-world systems meet these lofty standards. In practice, programs \nare oftenbuiltontop oflegacy code anddirtydata containing errors, omissions and outrightlies.  Of course, \ntheseproblems are not new thedif.culty building as theSemanticWeb , Grid middleware , cloud comput­ing \n, ubiquitous computing , eScience , cyberinfrastruc­ture , e-Infrastructure , etc.[21] emerging technologies \nbuild on the fabric provided by Internet and new kinds ofinteractioninteract, collaboration and compu­tation. \nFor example, eScience and cyberinfrastructure sys­tems are intended to give scientists easy access to \nhigh­performance computing, help them create high-quality cu­rated databases, and facilitate collaboration \nusing social­networkingtools and virtual research environments. they anddirty data.Digitalinformationis \neasy and integrity academicjournals andlaboratory notebooks thatthey predictedto replace[23]. of these \nrevolutionary computing technologies will buildingprovenancetechnologyanyimportance.By provenancethe \norigin, context, or history of the data. By technology that are neededto record and an end-to-end resource \nin a system. recover the repeatability, integrity and authenticity proper­ties of pre-digital information, \nand will also make it easier todetect andpreventfailures, analyze errors, anddiscourage malfeasancebyincreasingtransparency \nand accountability. Without pervasive adoption of provenance technology, critical computer systems and \nnetworks have serious vul­nerabilities, which we call provenancefailures.Today, such failures arefrequent, \ncostly and embarrassing.Here arejust afewillustrative examples: In December 2006, a biochemist retracted \n.ve papers after discovering bugs in a data analysis program that had been used to generate several years \nof research re­sults [26]. The use of sophisticated Grid, database and other systemsprovides many new \nopportunitiesfor simi­lar errors to creepinto the scienti.c record.  InSeptember2008, an undatedarticle \nconcerningUnited Airlines near bankruptcy [12] appeared on the list of top stories on Google News. The \nstory was no longer relevant it had originally been published six years earlier but investors panicked, \nand the share price of the companyfellby75%beforetrading washalted.  In February 2009, the US Congress \npassed into law a $800 billion stimulus package. Changes were made by  Figure 1. Thepenis mightierthan \nthe sword. handonpaper copies of thebill onlyhoursbeforeit was enacted, including changes to the amounts \nallocated to speci.cprograms.For example, a$3.4billion allocation to energy conservation programs was \nchanged to $3.1 billioninthe .naldraft(seeFigure1). Prior to the2003Iraqinvasion,theUKgovernmentpub­lishedMicrosoftWorddocuments \ncontainingsupposedly objective intelligence evaluations. However, the docu­ments revisionhistorydisclosedthat \nsome ofthe authors werepolitical operatives[33].  Thecurrent .nancial crisis,whichbeganinlatesummer \n2008,ispartly attributabletoincreased opacity of .nan­cial marketsdue toderegulation andlarge-scale comput­erization \nover the last twenty years. Lewis and Cohan writein theNewYorkTimes:  Ever since traders started disappearing \nfrom the .oor of theNewYorkStockExchangeinthelast decade ofthe20thcentury,therehasbeenless and less transparency \nabout the price and volume of trades. [22] They go on to call for the US government to mandate that regulatorsprovideimpartial, \ntransparent and trusted information about transactions. Generally speaking, a provenance failure is a \nnegative outcome caused by a failure to record, manage, interpret, or control access to information and \nits provenance. These failures arepreventable,but currentlypreventionrequiresa greatdeal of vigilance(and \neffort) from users and requires cooperation across multiple systems and domains of con­trol.Provenancefailures \nwill either continue to cause major losses if critical systems are developed on top of advanced, but \nunreliableinfrastructure,or will,ipsofacto, ensurethat suchinfrastructureis not usedfor anythingimportant. \nProvenancefailures overlapwith other well-knownkinds of failures in computer systems, such as hardware \nfailures, softwarebugsthatlead toincorrect(or misleading) results, and security vulnerabilities that \nallow misuse (or prevent legitimate use) of computer systems.However,provenance failures alsodifferfrom \neach of theseinimportant ways.In particular, provenance failures involve users expectations or (mis)interpretations \nof data in a system relative to real­world artifacts or situations.Provenancefailures thusdo not appearto \nmap naturally tothe existinggoalsof correctness or ef.ciency. Moreover, although provenance is similar \nto securityin thatitis ahard-to-de.ne, end-to-endproperty of a system, existing securitymodelsdo notyet \nseemtohelp us to understandprovenanceeither.Therefore,webelievethat accurately modeling and effectively \ncombating provenance failures requires newideas.  Unfortunately, the challenge of provenance is often \nun­derappreciated. Provenance seems trivial, in theory: as a thought experiment, one canjustimagine recording \nevery­thingthat mightbe usefullater on.Of course,thisis notfea­sibleinpractice;however,itis alsoproblematicintheory,for \nitbegsthequestionofhowtode.ne everything whendo we stop?Likewise,given anidealized,butimpracticalde.­nitionof \neverything ,howcanwecomparepractical tech­niques that fall short of this ideal? These questions seldom \nreceivethe attentiontheydeserve.Instead systems(or users) that record provenance typically do so in an \nad hoc way based on perceived needs or as a reaction to known prob­lems. In the absence of agreement \nabout even basic de.ni­tions,goals, and success criteriaforprovenancetechniques, itishardto seehow we \ncandobetter. High-performance computing, formal veri.cation, and security are widely appreciatedtobe \nchallenging.Theyeach have a received agreatdeal of attention within cohesive re­search communities, have \nwell-developed theoretical foun­dations, and have made signi.cant practical impact. The study ofprovenance \ncurrently enjoys none ofthesefeatures, although it is increasingly recognized as a hard problem: in the \nUS it has been included on the InfoSec Council s HardProblemsList[3], andin theUKithasbeenidenti­.ed \nas a Grand Challenge by the British Computing Soci­ety[2].Nevertheless,thereislittlebroad understanding \nof whatprovenanceis, whatproblemsit solves, or whatthekey openproblems or challenges are. This paper \nis a call to arms for provenance-related re­search, outliningdirectionsthat webelieve are understudied \nanddrawing attention to some of thehardproblemsinvolv­ingprovenance,inthehopethe accomplishmentsanticipated \nin our opening remarks may become reality. This paper is not an attempt at a complete or fair survey \nof the .eld; we referinterested readersto other recent surveys[7,29] and resources[1]. We begin in Section \n2 by giving a high-level overview of provenance and its potential for digital information. In Section3 \nwediscuss some of theproblems with the current treatment of provenance, while in Section 4 we outline \nour views of thekey challenges and openproblemsthat mustbe addressedin ordertodeveloprobustprovenancetechnology. \nWe concludeinSection5. 2. What is provenance and what is it for? Whatisprovenance?Thatdependsonthe contextin \nwhich the question is posed, and on the goals provenance is ex­pectedto achieve.Manydifferentuser communities \nare call­ingforsomemetadatacalled provenance ,buteach ofthese communities actually has different underlying \nneeds and applicationsin mind[1].Moreover,different communities think of their objects and data at different \nsemantic levels. Sojustlike anyprogrammingordata managementproblem, we should ask whatprovenanceis, whatproblemsit \nsolves, andhow we shall recognize success. Theconcept of provenance originatesfromtheart and archiving \nworlds, where it refers to information about the creation, chain of custody, modi.cations or in.uences \nper­tainingto an artifact. In the art world, suchdocumentationisimportantforbe­ingabletojudge authenticity,thatis, \nwhether a workis what its owners/sellers claimitis(rather than aforgery).Thus,it is important that the \nrecord be as detailed as possible, and thatitbepossibleto checkthe recordagainst other,indepen­dentrecords \nas well as against the artifactitself. In archiving, provenance is related to integrity, such as theprinciplethat \narchivists should respectthe order or orga­nizationofa collectionofdocumentsthatarebeingarchived: thisprincipleis \ncalledrespectdesfonds.Thisisin contrastto archivingpracticespopularin earlierperiods(e.g.,19th cen­tury) \nwhen archivists oftendevisedtheir own schemefor re­organizing collections.Doing sodiscardsinformation \nabout the relationships among objects that might not be apparent to the archivist and might be dif.cult \nfor others to recover after reorganization. A more concrete answer to the question what is prove­nance \nfor digital artifacts is to look at features or appli­cations of current computer systems that appear \nrelated to history tracking,logging,integrity,authenticity,or errorre­covery. Most computer systems, \nand many users, currently track suchinformationto aidin error correction,debugging, auditing, orjust \nas simple memory aids: Operating systems log important system events, to aid system administration andintrusiondetection. \n Filesystemsrecordbasicmetadatasuch as .lecreation, modi.cation, ownership andpermissions.  Version \ncontrol systems record metadata about when changeshavebeen made andby whom.  Compilers use sourceline \nnumbertaggingto aidinpoint­ingto the sources of compile-time or run-time errors.  Scienti.c database \ncurators maintain detailed high-level recordsofwhohasinserted,modi.edordeleteddata, and (sometimes)whereithasbeen \ncopiedfrom.  Web browsers retain history information about which siteshavebeen visited and when.  Users \nof Twitter, Friendfeed and other social network­ingsystems employinformal conventionsconcerningac­knowledgingsources \nofquoteddata orlinks, e.g. the ab-breviations RT (ReTweet) or HT (HatTip).  Althougheach ofthe above \nrepresents an example ofprove­nance, wedo notbelieve any of the above mechanismspro­vides a self-containedde.nition \nofprovenance, even within its context. In each case, we can imagine taking the exist­ingsystem and modifyingit \nto record moreinformationthat could be considered provenance, though again this would quicklybecomeimpractical.Thus, \neachofthe abovemecha­nisms represents apractical summary ofthetrueprovenance of the system, a concept \nwhich wepositexistsin each case butwon ttry tode.ne.  Now whatisprovenancefor?We havegiven two typical \nmotivations above, namely for assessing authenticity and integrity. The above examples also suggest distinguishing \ntwo complementary motivations for recording provenance: failure recoveryand success validation. Anycomputer \nsystem canfailin a number of ways: there canbeahardwarefault,softwarebug,malicioususer,orsim­ple human \nerror. When a failure occurs, we need to know whathappened,howthefailure occurred, who wasinvolved, who \nwas to blame, and how safeguard against similar fail­ures in the future. Conversely, if a system is being \nused to makedecisions upon which signi.cant resources orlivesde­pend,thenitisimportantfor theprocessleadingto \napartic­ulardecision to be transparent, comprehensible, andpersis­tent.Suchdecisions need tobejusti.edby \nexplicitly show­ing how the results were derived, what assumptions or ap­proximations were used, who \nwas involved, who deserves credit, andhow to reproduce the resultsindifferent circum­stances. Scientists \nare requiredtoimagine(anddefend against) all the possible ways their experiments might fail or might \nmislead us into drawing .awed conclusions. Accordingly, laboratory scientists havedeveloped careful record-keeping \npracticesthat makeit easierfora scientistto satisfy herself (andto convince others) that her work is \nvalid, repeatable, and accurate. These records anticipate scientists need for bothsuccess validation \nandfailure recoveryin the course of responsible conduct of research[24]. Failure recovery and success \nvalidation are dual. In fail­ure recovery, we are faced with a speci.c bad outcome that we wantto understand \nand avoid repeating.In success val­idation,we arefaced with some(claimed)good resultsthat we want to \nvalidate and replicate or generalize. Both fail­ure recovery and success validation involve understanding \ncausal chains of events and counterfactualpossibilities. More generally, provenance addresses problems \nof the followingform: wehave a systemdescription together with some speci.cinputs and outputs, and we \nwishto understand (or explain) the process by which the system transformed theinputstothe outputs.Such \nexplanationscanhavemany forms,dependingon whataspects ofthe systembehaviorare considered critical.Moreover,differentkinds \nof explanation address different informal motivations such as authenticity, integrity, transparency, \nand accountability.Of course, sofar these are all relatively vague conceptsthat canbeinterpreted in a \nnumberofdifferentways, anddevelopingmore concrete de.nitions ofthese conceptsis a majorpartofthe challenge. \n3. Problems with current reality Provenance is information, and as such, we must consider how to de.ne, \nmanage, and secure it. There are both sub­jective and objective aspects of provenance that must be carefully \nuntangled. Moreover, we also need to consider semantic issues such as when provenance correctly repre­sents \na system or explains a situation. As well, there is the meta-issue of whetherprovenanceinformationneedstohave \nprovenance ofits own(andifso, wheredoesthis stop?)Sat­isfying answers to thesequestionshave notyetbeenfound; \ninstead, weperceive a numberofbasicproblems withprove­nancein today s systems. Provenanceisincomplete. \nOften thisisfor ef.ciencyrea­sonsbasedondatedassumptions aboutthe cost of secondary storage,whichisincreasinglycheapcomparedto \notherhard­ware. However, there is a more fundamental problem: dif­ferentapplicationshavedifferentprovenanceneeds, \nanditis notclearwhetherthereisaplausible onesize.tsall prove­nance solution that can be hard-wired into \ngeneral-purpose systems. It may be better to instead develop interfaces for customizingthe collection \nofprovenanceinformation. Provenanceis unreliable. Computersystems alreadyman­ageprovenancein numerousways.Mostofthese \napproaches are unreliableinthe sensethattheguaranteesprovided are minimal or unclear, and systembehavioris \nunspeci.ed or ad hoc.Thisplaces severelimitations on the ability of users to trustdistributeddata and \ncomputations on theWeb.If users have mistaken intuitions about the meaning of provenance, they will likely \nmake poor decisions and incorrectly assign blame(orpraise).Even worse,if attackers can manipulate provenanceinformation,then \nusershaveto considerthepos­sibility of plagiarism, framing and identity fraud. If these risks are well-known,then \nusers willlikely simplydisregard provenance,leadingto wastedcollection effort.Havinglow­quality or easilyforgedprovenance \nmay actuallybe worse thanhaving noprovenance at all! Provenanceis insecure. Asdiscussed byBraun et al.[8], \npreventingunauthorized accesstodataisinsuf.cientto en­sure that sensitive provenance remains con.dential. \nCon­versely,permitting accessto(non-con.dential)provenance may disclose con.dential data. More generally, \nadding provenance to systems introduces new privacy and secu­rity risks even as it increases transparency \nand accountabil­ity, as illustrated for example by the the Iraq intelligence report metadata information \nleaks in Microsoft Word and other applications. Provenance tracking (like other forms of surveillance) \nmay have a chilling effect on freedom of expression; to avoid this problem, it may be important to preserve \nprovenance-free zones . Provenanceisheterogeneous. Asdiscussedabove,prove­nance information is currently \nmanaged in many different waysfor manydifferentpurposesin various systems.These facilities have often \ngrown organically in response to per­ceived needs, rather than aspart of an overalldesignphilos­ophy.In \naddition,theinformationis recordedat manydiffer­entlevels ofgranularity whole .les vs.individuallines, \nor whole databases vs. database records. When systems man­age provenance in idiosyncratic ways, then \nit is a major chore to integrate these different kinds of provenance af­ter the fact. Some progress towards \na standard format for provenancehasbeen madeintheOpenProvenanceModel effort[25].This work standardizes \na syntax and controlled vocabularyforprovenance,but thereis stillplenty of scope forincompatibilityand \nmisinterpretation.  The problem is similar to that of data integration, aris­ingwheredifferentdatabaseshavebeendevelopedtohandle \nsimilar data but differ in terms of data format, layout, and granularity.Reconcilingthese changesishighlylaborinten­sive \nandhas motivated(atleast!) 20years of research with no endin sight[34].Perhaps existingtechniquesfordatain­tegrationcanbe \nadaptedtohelpwithprovenanceintegration. Conversely,provenanceinformationmayhelp attainhigher qualityindataintegration. \nProvenanceis non-portable. Howdo wedeal withprove­nance for mobile data that moves among systems? This \nis a commonplace scenario: consider, for example, curated databases where curators manually browsejournal \narticles, online analysistools and otherdatabases and copy andpaste data into their databases, or any \nkind of collaboration in­volving emailing copiesof adocumentback andforth.Re­cently developed distributed \nversion-control systems, such as Git, Darcs, and Mercurial, may offer some ideas about how to manage \nprovenance for mobile, distributed objects that could be generalized to other settings. However, truly \nsolving this problem may require architectural changes at thehardware,network,operating system, orWeblevels(or \nall of the above). Littleprovenance researchisprecise,formalor repeatable. As argued above, webelieveprovenancefailures \narebased in part on subjective concerns such as how users interpret metadata. However, we do not believe \nthat this means that we should abandon existingprinciplesfor thedesign, speci­.cation, and veri.cation \nof computer systems.It canbehaz­ardoustoimplementthe .rstthingthat comestomind with­out clear understanding \nof the design space people might (mis)placefaithin a system, withdangerousconsequences. Moreover,evenifitis \nultimatelya subjective mattertojudge whether aprovenance systemdesignis adequatefor agiven purpose, we \nshouldhave clear speci.cations thatbothusers andimplementors can rely on. We believe that bothprovenance \nsolutions and theprob­lems they are meant to solve need to be formulated clearly in a rigorous framework. \nUnfortunately, a lot of the work done so far on provenance has fallen short in this respect. Often,the \nactual ordesiredbehavior of a system(orboth) are described only in vague terms. For example, a form of \nprovenanceis often motivatedas being complete ,or (more) accurate(thananother) ,  as capturing information \nabout (causal) dependences , in.uences , sources , relevance ,  or as being an explanation , justi.cation \n, or evi­dence . These are loaded terms. They are frequently used as moti­vationbut without anyfurtherde.nition \nof their meaningin terms of the system that theprovenanceinformationis sup­posedtodescribe.Thisis unacceptablebecause \na reader(or user or developer) may interpret one of these terms differ­ently from the way intended by \nthe author, leading to con­fusion andlikely toprovenancefailures.Moreover,thelack ofprecisede.nitions \nand cleardescriptionshinders compar­isonsin terms ofeffectiveness, expressiveness or ef.ciency; eveniftwo \nsystemshavesimilar motivation,theirimplemen­tations maybe sodifferent asto rendercomparisonsmean­ingless. \nThus,besides our concern withthe clarity ofdescriptions ofproposedtechniquesforprovenance,webelievethatthere \nare seriousgapsin our understanding of theintendedgoals of such techniques. In terms familiar from computer \nsecu­rity,todaywe see manyproposalsfor mechanismsforprove­nance, but few clear policies describing what \nsuch mech­anisms are meant to achieve. Computer security bene.ted greatlyby adopting aformal approach[5], \nand webelieve that more formalism will also be required for provenance technologyto succeed. 4. Towards \nsolutions As withmanyemergingtechnologies,we expectprovenance technology to develop in roughly three \nstages: research, early adoption,and maturity.We expectprovenancetoface similar challenges as other network \neffect technologies that become compelling only when a critical mass is reached. However, there are aspects \nof provenance that seem espe­cially challenging and that we believe don t receive the at­tentiontheydeserve. \nSemantics Many forms of provenance could be captured foraparticularsystem.Atabareminimum,we wanttoknow \nwhere aparticularpiece ofdata comesfrom[9,10].In an e­science setting,however, we additionally want toknow \nwhy anin-silico analysisgave aparticular output[10,15], how it was computed[18], or what dependenciesthe \noutputhas on differentinputs[13].Sometechniques(such asPASS[27] andPASOA[25]) attemptto record everything \nthat agiven system component can record, building a detailed trace or causalgraph . While the aboveforms \nofprovenancehave alreadybeen introduced and studied in the literature for speci.c settings and languages \ne.g., relational databases, work.ows, or .le systems there is need for generally applicable, for­mal \nfoundations for provenance. Moreover, since we can only expectprovenance tobecome ubiquitously available \nif the effort of adding provenance support to systems is rel­atively low, we need an ef.cient methodology \nthat allows this general theory to be easily applied to new settings and languages. One issue of current \ninterest is how to integrate provenance models that havebeendevelopedseparately for databases and work.ow \nsystems; more generally, we think it is essential to develop a clearer formal understanding of modularity \nand abstractionforprovenance.  Traces,incremental,andbidirectionalcomputation Many forms ofprovenanceare \nmotivatedby adesireto cachein­termediate results and support ef.cient recomputation when the input changes. \nIncremental recomputation is a classi­calproblem encounteredin manydifferentguisesthrough­out computer \nscience (particularly view maintenance in databases[19]).Many approachesemploy traces ,orin­termediate \ndata structures that elucidate how the output was computedfromtheinput[4].Thus, whentheinputis changed, \nwe can propagate the effects forward ef.ciently by replayingjust apart ofthetrace. Suchtraceinforma­tion \nought to be computable from a suf.ciently rich form of provenance; alternatively, perhaps we should view \nsuch traces as aform ofprovenancein their own right.However, while the trace everything approach seems \nto capture the mostprovenance-relatedinformation,it is currently unclear what language should be used \nto pose provenance queries on traces. Since such queries essentially inspect program behavior,languagesfor \nmeta-programming[30] and meta­querying[32]seemlike agood startingpoint. Provenancehas alsobeenlinkedto \nthe classical view up­date problem indatabases[11], andgeneralizations such as bidirectional computation \n[17]. In recent workon bidirec­tionaltransformations,or lenses ,where-provenanceinfor­mationhasbeenfound \nusefulfordealing with ordereddata collections[6].Inlight of these observations,wethink that understanding \nthe relationshipsbetweenprovenance,incre­mental/adaptive computation,andbidirectionalcomputation is a \nkey open problem. For example, can pervasive prove­nance technology also enable new solutions to these \nold problems?Conversely,canthese existingtechniquesbe used tobetter understandthefoundations ofprovenance? \nDependence,information .ow,andsecurity Information­.ow securityisbasedonformalismssuchasdependenceand \nnoninterferencethatalso underlieprogramslicingandanaly­sis.Previous work on dependencyprovenanceadaptedthese \nideasto motivate aform ofprovenancethatprovidesa strong guaranteethatitcaptures alldependenceinformation[13]. \nIt is an open question how to de.ne security for prove­nance.Someprevious work(starting with [8,31])has \ncon­sidered access control and other security issues for prove­nanceinformation,butdoes notformalize \nsecuritypolicies orprovecorrectnessofimplementations.Chong[14]setsout initial attempts atde.nitionsfor \nsecuritypropertiesfor sys­tems in which both data and provenance may be con.den­tial; this workisformulatedin \nterms ofdetailed operational traces, but seems adaptable to other forms of provenance. However,there \nare manyissuesthatneedfurther study, such asprivacy and auditin thepresence ofprovenance. Causality,trust,knowledge,andbelief \nThese conceptsare often invoked as motivations for provenance, but they are nontrivial.For example,the \nnature of causalityhasbeende­bated by philosophers for centuries, famously Hume, and continuing to this \nday. It is far from obvious how to make sense ofinformal claimsthat agivenprovenance record cor­rectly \ncaptures a causal relationship,increasestrust, orjus­ti.es aknowledge orbelief, and most researchpapersdon \nt even try. However, recent work on mathematical models of causality[20],trust[28], andknowledge[16] \nmayprovide a goodstartingpointfor answeringthesequestions. 5. Conclusions TheWeband othertechnologies \nare revolutionizingthe way we create, share and use information; this revolution offers great bene.ts \nbut also exposes us to serious new risks. We believethatprovenancewillplayan essentialroleinthis rev­olution,providingdata \nintegrity, trustworthiness, authentic­ity, andavailability,while offeringpotentialbene.tstoinfor­mation \nretrieval, collaboration, and scienti.c computation. However, mostwork onprovenancesofarhasfocusedon \ndevelopingsystemsthataddressimmediateperceivedneeds, rather than understanding foundational questions \nsuch as what is provenance? , how do we know when we have enough provenance for a given application? \n, or how can we assess or compare approaches to provenance? We be­lievethatsatisfactory answerstothesekinds \nofquestionsde­mand serious consideration of underlyingissues such as the semantics ofprovenance and the \nnature of trust and causal­ity in computer systems. Only once these foundations are better understood \nthatis, only once theproblems we want provenance to solve are clearly de.ned can we make real progress \non solving them and developing a robust prove­nancelayerforthefutureWebinfrastructure. Acknowledgments \nThispaperisbasedondiscussionsstartedata series ofwork­shops on provenance in 2008-2009 sponsored by the \nUK eScience Institute, whose support we gratefully acknowl­edge. References [1] Principles ofprovenance \nwiki. http://wiki.esi.ac.uk/-Principles of Provenance. [2] Grandchallengesincomputing research.Technical \nreport, BritishComputingSociety,2004.   [3] INFOSEChardproblemlist.Technicalreport,INFOSECRe­searchCouncil,2005. \nhttp://www.infosec-research.org/­docs public/20051130-IRC-HPL-FINAL.pdf. [4] UmutA.Acar,GuyE.Blelloch, \nandRobertHarper. Adaptive functional programming. In POPL, pages 247 259. ACM Press,2002. [5] David \nE. Bell and Leonard La Padula. Secure computer system: Uni.ed exposition and Multics interpretation. \nTechnical Report ESD-TR-75-306, MITRE Corp. MTR­2997,Bedford,MA,1975. [6] Aaron Bohannon, J. Nathan \nFoster, Benjamin C. Pierce, Alexandre Pilkiewicz, and Alan Schmitt. Boomerang: resourceful lenses for \nstring data. In POPL,pages 407 419. ACM,2008. [7] Rajendra Bose and James Frew. Lineage retrieval for \nscienti.c data processing: a survey. ACM Comput. Surv., 37(1):1 28, 2005. [8] Uri Braun, Avraham Shinnar, \nand Margo Seltzer. Securing provenance. In HOTSEC 08: Proceedings of the 3rd conference on Hot topics \nin security, pages 1 5, Berkeley, CA,USA,2008.USENIXAssociation. [9] Peter Buneman, James Cheney, and \nStijn Vansummeren. On the expressiveness of implicit provenance in query and update languages. ACM Transactions \non Database Systems, 33(4):28,November2008. [10] PeterBuneman,SanjeevKhanna, andWang-ChiewTan.Why and \nwhere:A characterizationofdataprovenance. In ICDT, number1973inLNCS,pages316 330. Springer,2001. [11] \nPeterBuneman, Sanjeev Khanna, and Wang-Chiew Tan. On propagation of deletions and annotations through \nviews. In PODS,pages150 158, 2002. [12] Susan Carey and Geoffrey Rogow. UAL shares fall as old story \nsurfaces online. Wall Street Journal, September 2008. http://online.wsj.com/article/SB122088673­738010213.html. \n[13] JamesCheney,AmalAhmed, andUmutA.Acar. Provenance as dependency analysis. In DBPL, volume 4797 of \nLecture NotesinComputer Science,pages138 152. Springer,2007. [14] StephenChong. Towardssemanticsforprovenance \nsecurity. In TAPP 09: First workshop on on Theory and practice of provenance, pages 1 5, Berkeley,CA,USA,2009. \nUSENIX Association. [15] YingweiCui,JenniferWidom, and JanetL.Wiener. Tracing thelineage of viewdatain \na warehousing environment. ACM Trans.Database Syst.,25(2):179 227, 2000. [16] Ronald Fagin, Joseph Y. \nHalpern, Yoram Moses, and Moshe Y. Vardi. Reasoning About Knowledge. MIT Press, 2003. [17] J.NathanFosterandGrigorisKarvounarakis.Provenance \nand data synchronization. IEEE Data Eng. Bull., 30(4):13 21, 2007. [18] Todd J. Green, Gregory Karvounarakis, \nand Val Tannen. Provenance semirings. InPODS,pages31 40.ACM,2007. [19] Ashish Gupta and Iderpal SinghMumick, \neditors. Material­ized views: Techniques, Implementations, and Applications. MITPress,Cambridge,MA,USA,1999. \n[20] J.Y. Halpern and J. Pearl. Causes and explanations: A structural-model approach part I: Causes. \nBritish J. Philos. Sci.,56:843 887, 2005. [21] T.HeyandA.E.Trefethen.Cyberinfrastructurefor e-science. \nScience,308(5723):817 821, 2005. [22] Sandy B. Lewis and William D. Cohan. The econ­omy is still at the \nbrink. New York Times, June 2007. http://www.nytimes.com/2009/06/07/opinion/­07cohanWEB.html. [23] Clifford \nA. Lynch. When documents deceive: trust and provenance as new factors for information retrieval in a \ntangled web. J. Am. Soc. Inf. Sci. Technol., 52(1):12 17, 2001. [24] Francis L. Macrina. Scienti.c Integrity. \nASM Press, 3rd edition,2005. [25] Simon Miles, Paul T. Groth, Steve Munroe, Sheng Jiang, ThibautAssandri, \nandLucMoreau. Extractingcausalgraphs from an open provenance data model. Concurrency and Computation: \nPractice and Experience, 20(5):577 586, 2008. [26] GregMiller. Ascientist s nightmare:Softwareproblemleads \nto .ve retractions. Science,314(5807):1856 1857,December 2006. [27] Kiran-Kumar Muniswamy-Reddy, David \nA. Holland, Uri Braun, and Margo Seltzer. Provenance-aware storage systems. In USENIX Annual Technical \nConference, pages 43 56.USENIX,June2006. [28] Jordi Sabater and Carles Sierra. Review on computational \ntrust and reputation models. Artif. Intell. Rev., 24(1):33 60, 2005. [29] YogeshSimmhan,BethPlale, andDennisGannon. \nA survey ofdataprovenancein e-science. SIGMODRecord,34(3):31 36,2005. [30] Walid Taha and Tim Sheard. \nMetaML and multi-stage pro­gramming with explicit annotations. Theoretical Computer Science,248(1 2):211 \n242, 2000. [31] Victor Tan, Paul T. Groth, Simon Miles, Sheng Jiang, Steve Munroe, So.a Tsasakou, and \nLuc Moreau. Security issues in a SOA-based provenance system. In Luc Moreau and IanT.Foster, editors,IPAW, \nvolume4145 of LectureNotesin Computer Science,pages203 211. Springer,2006. [32] JanVandenBussche,DirkVanGucht, \nandGottfriedVossen. Re.ectiveprogramming in the relational algebra. Journal of Computer andSystem Sciences,52(3):537 \n549, 1996. [33] Sam Varghese. UK government gets bitten by Mi­crosoft Word. Sydney Morning Herald, July \n2003. http://www.smh.com.au/articles/2003/07/02/­1056825430340.html. [34] PatrickZieglerandKlausR.Dittrich. \nThreedecades ofdata integration -allproblemssolved?InRen´eJacquart,editor, IFIPCongress TopicalSessions,pages3 \n12.Kluwer,2004.  \n\t\t\t", "proc_id": "1639950", "abstract": "<p>Science, industry, and society are being revolutionized by radical new capabilities for information sharing, distributed computation, and collaboration offered by the World Wide Web. This revolution promises dramatic benefits but also poses serious risks due to the fluid nature of digital information. One important cross-cutting issue is managing and recording provenance, or metadata about the origin, context, or history of data. We posit that provenance will play a central role in emerging advanced digital infrastructures. In this paper, we outline the current state of provenance research and practice, identify hard open research problems involving provenance semantics, formal modeling, and security, and articulate a vision for the future of provenance.</p>", "authors": [{"name": "James Cheney", "author_profile_id": "81100057679", "affiliation": "University of Edinburgh, Edinburgh, United Kingdom", "person_id": "P1728350", "email_address": "", "orcid_id": ""}, {"name": "Stephen Chong", "author_profile_id": "81100287555", "affiliation": "Harvard University, Cambridge, MA, USA", "person_id": "P1728351", "email_address": "", "orcid_id": ""}, {"name": "Nate Foster", "author_profile_id": "81444600818", "affiliation": "University of Pennsylvania, Philadelphia, PA, USA", "person_id": "P1728352", "email_address": "", "orcid_id": ""}, {"name": "Margo Seltzer", "author_profile_id": "81100191655", "affiliation": "Harvard University, Cambridge, MA, USA", "person_id": "P1728353", "email_address": "", "orcid_id": ""}, {"name": "Stijn Vansummeren", "author_profile_id": "81324494716", "affiliation": "Hasselt University/Transnational University of Limburg, Diepenbeek, Belgium", "person_id": "P1728354", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640064", "year": "2009", "article_id": "1640064", "conference": "OOPSLA", "title": "Provenance: a future history", "url": "http://dl.acm.org/citation.cfm?id=1640064"}