{"article_publication_date": "10-25-2009", "fulltext": "\n DOLLI 2 Project Presentation Video Presentation Bernd Bruegge Harald Stangl Maximilian Reiss Technische \nUniversitaet Muenchen Technische Universitaet Muenchen Technische Universitaet Muenchen Chair for Applied \nSoftware Engineering Chair for Applied Software Engineering Chair for Applied Software Engineering bruegge@in.tum.de \nstanglh@in.tum.de reissm@in.tum.de Abstract The DOLLI 2 project was the successor to a large-scale educational \nstudent project course with a real customer, offered to students in their second year. Once again, in \nthe time frame of a single semester a functional system was developed and delivered to the customer. \nWe repeated the shift from a traditional lifecycle to an agile process during the project, and used video \ntechniques for defining re­quirements and meeting capture. Categories and Subject Descriptors K.3.2 [Computers \nand Education]: Computer and Information Science Edu­cation - Computer science education. K.6.1 [Management \nof Computing and Information Systems]: Project and People Management - Systems analysis and design, Sys­tems \ndevelopment, Management techniques. General Terms Management, Experimentation, Human Factors Keywords \nVideo-based requirements engineering, scenario­based design, teaching software engineering, single project \ncourse 1. Voice-over text In the winter term 2008, the DOLLI 2 project, a sequel to the highly successful \nDOLLI project, took place. And just like its predecessor, it differed substantially from other student \nprojects that are normally held at universities in the subject of computer science. The majority of the \nparticipants were students in their third semester. Although there were nearly thirty of them, they had \nto jointly work together to solve the problem they were posed. The teams that were formed were responsible \neach for one of the subsystems that were identified during the initial subsystem decomposition. Copyright \nis held by the autor/owner(s). OOPSLA 2009, October 25-29, 2009, Orlando, FL, USA. ACM 978-1-60558-768-4/09/10. \n In contrast to typical student projects, the chair did not take the role of the customer, but with the \nMunich airport a real industry client could be found. Representatives of the airport were involved during \nthe whole project duration, and their feedback was taken on multiple occasions to har­monize the development \nand their expectations. To keep the administrative workload for the instructor as low as possible, the \nteams were taught to work in a self­organizing way. By employing Apple's Podcast Producer technology, \nthey could record their meetings for further reference. The videos were automatically captured, con­verted \nand posted on the team's blog. One result of the preceding project was a three­dimensional representation \nof the airport that allows to navigate through the airport and watch trackable objects like cars and \nairplanes as they move around. The challenge of this year's project was to create an in­tegration of \nthe facility management systems to enable em­ployees to view and change the status of devices like elevators, \nlights and ventilation from within the three­dimensional view. Additionally, an iPhone client had to \nbe developed to al­low the very same access from a mobile device while the user is on the road. The project \nnot only served as a teaching measure, but also to investigate topics in the field of software engineer­ing \nfrom a research perspective. One of the tools currently under development at the chair is called \"unicase\". \nIt aims at connecting all relevant artifacts that are important during software development. This total \nintegration allows to easily link related items like use cases and models of implementing classes as \nwell as project management artifacts like tasks and Sprint plan­nings. This enables traceability not \nonly from requirements to code, but also takes the managerial aspects into account.  During the DOLLI \n2 project, it was investigated how changes on artifacts could be communicated best to af­fected project \nmembers. We also investigated the use of video technology to im­prove the requirements negotiation process. \nThe idea is to create visual representations of the scenarios to give the customer a good idea about \nhow the future system will work from the user's perspective. As the system does not exist at that point \nof time, we used GUI mock ups and green screen technology to make the video look as con­vincing as possible. \nIn the first project we already successfully combined both the Unified Process and Scrum, which is an \nagile process. To see if this switch is repeatable, we once again started with a more traditional process \nfor Requirements Engineering, System Design and Object Design. After the design was stable, most of the \nimplementation was done during a two week Scrum phase, which took place at the airport itself. Just like \nlast year, the switch worked without any major problems. At the end of the project the students presented \ntheir re­sults in the target environment of terminal 1 at the Munich airport. More than 50 people attended \nthis event and were impressed by the actually working interaction between the DOLLI system and the existing \nfacility management sys­tems. Although the required effort from the students was un­doubtedly higher \nthan for typical student projects, the gain in real life project experience is a valuable preparation \nfor the time after graduation.   \n\t\t\t", "proc_id": "1639950", "abstract": "<p>The DOLLI 2 project was the successor to a large-scale educational student project course with a real customer, offered to students in their second year. Once again, in the time frame of a single semester a functional system was developed and delivered to the customer. We repeated the shift from a traditional lifecycle to an agile process during the project, and used video techniques for defining requirements and meeting capture.</p>", "authors": [{"name": "Bernd Bruegge", "author_profile_id": "81100313351", "affiliation": "Technische Universit&#228;t Muenchen, Munich, Germany", "person_id": "P1728384", "email_address": "", "orcid_id": ""}, {"name": "Harald Stangl", "author_profile_id": "81381608051", "affiliation": "Technische Universit&#228;t Muenchen, Munich, Germany", "person_id": "P1728385", "email_address": "", "orcid_id": ""}, {"name": "Maximilian Reiss", "author_profile_id": "81381604608", "affiliation": "Technische Universit&#228;t Muenchen, Munich, Germany", "person_id": "P1728386", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640077", "year": "2009", "article_id": "1640077", "conference": "OOPSLA", "title": "Dolli 2: project presentation", "url": "http://dl.acm.org/citation.cfm?id=1640077"}