{"article_publication_date": "10-25-2009", "fulltext": "\n Fragile Ideas Elisa Baniassad Chinese University of Hong Kong Hong Kong, China elisa@cse.cuhk.edu.hk \nRichard P. Gabriel IBM Research Redwood City, California rpg@dreamsongs.com Abstract Onward! is a forum \nfor sharing ideas that are incredibly new and experimental. They don t always make sense, and they re \nnot always totally thought through. They re very easily killed, especially if subjected to the usual \n(let s just say it) nerdy challenge. The Fragile Ideas workshop is about building a new kind of discourse \nfor the Onward! commu­nity. It s about teaching cynics and skeptics how to become idea facilitators and \nexplorers. By learning and practicing a communication process adapted from a Writers Work­shop approach, \nevery participant will walk away from this workshop with two things: a nurtured and growing idea, and \na way to talk to people without shutting them down. Categories and Subject Descriptors D.0 [General]: \nSoft­ware General Terms Human Factors Keywords ideas, writers workshops Main Theme and Goals Computer \nscientists are a skeptical bunch. We re taught to debug, to deconstruct, to Question. Everything. How \nmany times have we had a tiny glimmer of a thought, a small glint of light in the darkness of lack of \nunderstanding, only to run to our best friend in the next cubicle, inarticulate it to him (let s blame \nmen here), and then have him say Yeah but . And so the light goes out. The glint extinguishes. The glim­mer \nvanishes. Our idea dies. Or at least it is severely hobbled. We leave, shoulders hunched, and slink back \nto our own cube, contemplating whether we are really as smart as we thought we were when we woke up this \nmorning. Conferences are no better. You go to conferences for the exchange of ideas, You travel across \nthe world. Maybe you give a talk! And after the talk, there are questions and you answer them! Yes! After \nthe session you feel a sense of success as people start coming to the front to talk to you. But after \nthe first couple of congratulatory I like your idea! Copyright is held by the author/owner(s). OOPSLA \n2009, October 25-29, 2009, Orlando, FL, USA. ACM 978-1-60558-768-4/09/10. comments, the monster of skepticism \nand cynicism rears its ugly head again: but, I m just wondering, how would it work in situation x?, \nthis is neat, but would it scale?, This is cool but I think it s been done before, have you read Z? \nEither you have an answer for these questions or you don t. If you don t, you feel like a git,* and humbly \nstart taking notes as people suddenly have a thousand suggestions for things you can look at to see that \nin fact your work is redundant. If you do, you wind up disappointed with your community you think who \nneeds these guys (men, again)? and you realize that you re working in spite of them, not thanks to them. \nEither way, the experience isn t as positive as it should be. And it doesn t do what it should have done, \nwhich is pro­moted your idea, and helped it to grow. Onward! is a different kind of conference. It s \na confer­ence about ideas that you don t know will scale, and that will probably sound like a lot of \nothers that went before. Skeptics and cynics will have an absolute field day! And we do! All of us! We \nattend Onward! waiting to be wowed, and in love with the idea of being subversive and pushing the boundaries \nof thinking about programming, but in the end, our default discourse is cynicism and skepticism, both \nof which amount to idea killing. We bumble up to the author of some cool paper, and the first word out \nof our mouths after the wow cool idea is but. The Fragile Ideas workshop is about building a new kind \nof discourse for the Onward! community. It s about teach­ing cynics and skeptics how to become idea facilitators \nand explorers rather than challengers and critics. The communication process taught in the workshop is \nbased on those used in writers workshops. A writers work­shop is a group of authors reviewing each other \ns work using a formal process designed to encourage a positive environ­ment, not a critical one. Through \nthis process, we will both provide a forum for people to air their fragile ideas (bring us * Git is \na relatively mild slang term used in British English to denote a silly, incompetent, stupid, annoying, \nor childish person. It is usually used as an insult, more severe than twit but less severe than a true \npro­fanity like wanker or arsehole, and may often be used affectionately between friends. your tired, \nyour hungry ) and also a mechanism by which those ideas will be nurtured. Every participant will walk \naway from this workshop with two things: a nurtured and growing idea, and a way to talk to people without \nshutting them down. Activities and Format The workshop is a full-day workshop. Participation in the workshop \nis by acceptance based on a short (1-page) idea paper. The workshop will take place in 3 phases, spread \nover 4 sessions. Session 1 Learning the Process The formal process is taught to the participants. Each \nauthor, when it s their turn, reads a short passage and then becomes an observer. Observers are asked \nto behave in a certain (supportive) way while the author is reading. They are asked not to react to what \nthey are hearing, and in­stead to maintain a neutral, positive expression. In this way, their positive \nreinforcement of some concepts doesn t draw strength away from other concepts in the author s mind. Under \nthe direction of a leader or teacher, the group first summarizes the piece, notes what worked well, and \nfinally makes constructive suggestions. The author is then permit­ted to ask clarifying questions. A \ngood leader or teacher will be able to direct the group in providing useful and respect­ful comments \nto each author, and to create a learning en­vironment for everyone. Session 2 <lunch> 3 Sharing Ideas \nHere, the participants each read their idea, and act as ob­servers to others ideas. Richard and Elisa \nwill act as teach­ers / leaders for the process. Session 4 Wrap-up We will summarize what happened during \nthe day, and dis­cuss impressions of the experience. Organizers Elisa Baniassad is an Assistant Professor \nat CUHK. Rich­ard P. Gabriel is a Distinguished Engineer at IBM Research (which is amazing because he \nisn t even an engineer).  \n\t\t\t", "proc_id": "1639950", "abstract": "<p>Onward! is a forum for sharing ideas that are incredibly new and experimental. They don 't always make sense, and they 're not always totally thought through.They 're very easily killed, especially if subjected to the usual (let's just say it)nerdy challenge.The Fragile Ideas workshop is about building a new kind of discourse for the Onward! community.It 's about teaching cynics and skeptics how to become idea facilitators and explorers. By learning and practicing a communication process adapted from a Writers' Workshop approach, every participant will walk away from this workshop with two things:a nurtured and growing idea, and a way to talk to people without shutting them down.</p>", "authors": [{"name": "Elisa Baniassad", "author_profile_id": "81414615851", "affiliation": "Chinese University of Hong Kong, Hong Kong, China", "person_id": "P1728404", "email_address": "", "orcid_id": ""}, {"name": "Richard P. Gabriel", "author_profile_id": "81100654724", "affiliation": "IBM Research, Redwood City, California", "person_id": "P1728405", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640084", "year": "2009", "article_id": "1640084", "conference": "OOPSLA", "title": "Fragile ideas", "url": "http://dl.acm.org/citation.cfm?id=1640084"}