{"article_publication_date": "10-25-2009", "fulltext": "\n Building a Semantic Virtual Museum: From Wiki to Semantic Wiki using Named Entity Recognition Alain \nPlantec Vincent Ribaud Vasudeva Varma LISyC, Complex System Lab LISyC, Complex System Lab Search and \nInformation Extraction Lab U.B.O, Brest, France U.B.O. Brest, France IIIT Hyderabad, India plantec@univ-brest.fr \nribaud@univ-brest.fr vv@iiit.ac.in Abstract In this paper, we describe an approach for creating semantic \nwiki pages from regular wiki pages, in the domain of scientific museums, using information extraction \nmethods in general and named entity recognition in particular. We make use of a domain specific ontology \ncalled CIDOC-CRM as a base structure for representing and processing knowledge. We have described major \ncomponents of the proposed approach and a three-step process involving name entity recognition, identifying \ndomain classes using the ontology and establishing the properties for the entities in order to generate \nsemantic wiki pages. Our initial evaluation of the prototype shows promising results in terms of enhanced \nefficiency and time and cost benefits. Categories and Subject Descriptors I.2.4 [Artificial Intelligence]: \nKnowledge Representation Formalisms and Methods Semantic networks. General Terms: Documentation, Languages, \nStandardization. Keywords: Information extraction, ontology, semantic wiki.  1. Introduction Scientific \npatrimony of a university or a scientific museum is constituted of all scientific equipments used for \nresearch and teaching together with the knowledge associated with their use from user manuals to experience \nprotocols. The aim of this research work is to provide a starting path for universities (or scientific \nmuseums) looking for a semantic Web site intended to gather and present scientific instruments knowledge. \nThe semantic Web site was designed with two main directing ideas: to extract knowledge of existing Web \nsite (typically Wikipedia) providing a bootstrap of the semantic Web site and to favor a collective \nbuilding of new knowledge by the scientific actors themselves a condition required to maintain accurate \nand living knowledge. Thus, we choose a semantic wiki technology Semantic MediaWiki (SMW) - that provides \na good compromise between formal internal structure and easy collective use [1]. RDF [2] is the most \nwidely language used to represent semantic annotations in the form <subject, property, value>. Semantic \nMediaWiki pages can be seen as normal wiki pages (including Wikipedia pages) annotated with values of \nsemantic properties. From an RDF point of view, the subject of the page is the subject of many triples \n- pairs of property/value. The conventional process of converting normal wiki pages to SMW pages manually \nis very Copyright is held by the author/owner(s). OOPSLA 2009, October 25-29, 2009, Orlando, FL, USA. \n tedious and time consuming and it requires a good understanding of the underlying ontology. Our attempt \nis make this process simple and computer aided to the extent possible. Hence, the problem can be stated \nin two directions: identifying the value (and related information type) and selecting the property in \na suitable ontology. The former problem may be addressed through Named Entity Recognition (NER) and should \nbe automated as much as possible. The latter problem relies on class recognition and property disambiguation; \nit uses automated annotation tools but may require more human participation. In this paper, we present \na semi-automated solution for transforming normal wiki pages to Semantic MediaWiki pages using a three \nstep process. The steps include recognizing the named entities within the normal wiki page and then recognizing \nthe types of named entities as classes of the CIDOC-CRM (CIDOC Conceptual Reference Model - our domain \nontology [3]) and finally, after a human assisted process to disambiguate the possible properties, generating \nthe SMW pages. In our initial evaluation of the proposed model, we have experienced reduced time and \nincreased efficiency in creating SMW pages. 2. Related Work Though there exists literature for using \nWikipedia as a usable set of data for information extraction [4], Semantic Wikis propose a more elaborate \nway of structuring the knowledge (as a fully typed hypertext network) that may prove to be more powerful \n[5]. However, we have not come across any work that makes use of information extraction techniques such \nas NER to transform wiki pages to semantic MediaWiki pages.  3. Proposed Solution: An Example Let us \nsee a typical Wikipedia page fragment, such as An '''ammeter''' is a [[measuring instrument]] used to \nmeasure the [[electric current]] in [[ampere]]s (A), hence the name. The earliest design is the [[Jacques-Arsène \nd'Arsonval|D'Arsonval]] [[galvanometer]] or '''moving coil''' ammeter. This fragment uses some format \ndirectives (between quotes) and links to other pages (between double brackets). If we wish to semantically \nannotate this fragment with the CIDOC CRM, this fragment should be transformed such in An '''ammeter''' \nis a [[measuring instrument]] used to measure the [[electric current]] in [[P39B.P40 observed dimension::ampere]]s \n(A), hence the name. The earliest design is the [[P14 carried out::Jacques-Arsène d'Arsonval|D'Arsonval]] \n[[P130 shows feature ACM 978-1-60558-768-4/09/10.  of::galvanometer]] or '''moving coil''' ammeter. \n[[Category:E24 Physical Man-Made Thing]] The last statement indicates that this semantic fragment is \nrelated to an instance of the E24 Physical Man-Made Thing (a class of the ontology). This instance is \nthe subject of several triples represented as property/value pairs using the syntax [[Px property name::value]], \nsuch as [[P130 shows feature of::galvanometer]] indicating that an ammeter is linked to a galvanometer \nthrough the P130 shows feature of property. Px is an identifier of the property in the CRM and provides \ncross-language reference. A special case occurs when an intermediate node has to be created to correctly \ntranslate a link between two pages (e.g. ammeter and ampere): if a direct property between the two pages \ntypes does not exist, it requires the use of two or more properties (e.g. P39B was measured by, P40 observed \ndimension) and the creation of intermediary nodes. This translation process is performed in three steps: \nnamed entity recognition (NER), CIDOC-CRM class recognition, and CIDOC-CRM property disambiguation. The \ntwo former steps are automatic but require human validation to ensure that named entities or CRM classes \nwere correctly recognized. The last step is a computer-aided process.  4. Prototype and Evaluation We \nhave built a prototype implementation of the proposed approach and the simplified flow diagram is given \nin Figure 1. The major components of the prototype system are Named Entity Recognition, CIDOC CRM class \nrecognition, and assisted triples generation modules: NER: We are using Conditional Random Fields (CRFs) \nbased NER system. In this system, NER task is modeled as a sequence-labeling task [6] where for a given \nsequence of words, the NER system constructs a label sequence in which each label represents a predefined \nset of classes for named entities. For example, the predefined classes include names of people, organizations, \nplaces and the domain specific named entities such as instrument, part of instrument, instrument material, \nand measurement. The final label sequence is the one that has highest probability among all the possible \nlabel sequences occurring for a given word sequence. CRM Class Recognition: We have used ICOM/CIDOC Conceptual \nReference Model (CIDOC CRM), an ontology intended to facilitate the integration, mediation and interchange \nof heterogeneous cultural heritage information and an ISO 21117 standard since 2006 as the base structure \nfor organizing information [3]. CIDOC classes are mapped to the tags used by the NER. One-to-one mapping \nis easy to process, but complex mapping (e.g. Measurement) requires a language to define transformation \nrules, ideally performed as automated processes. Assisted triples generation: RDF is a property-centric \n(rather than record-centric) approach to representation. The domain of a property is used to indicate \nthat a particular property applies to a designated class [2]. The range of a property is used to indicate \nthat the values of a particular property are instances of a designated class [2]. Thanks to NER and class \nrecognition, domain and range of each potential triple is known. A suitable representation of the CIDOC \nCRM ontology is required to provide the user with the possible choices. We use Platypus (http://cassoulet.univ-brest.fr/mme), \na model­driven engineering tool, to specify source (NER tagging) and target (CIDOC CRM) meta-models and \ntransformation rules. We have studied the utility of the solution prototype with the help of human experts \ninvolved in creation of the semantic wiki pages. We have observed that the efficiency of creating SMW \npages is increased by more than 60% on an average in terms of the time taken. Without the help of our \nprototype the human experts needed approximately 650 minutes for converting each page (a typical page \nconsists about one hundred links or entities to deal with), which is now reduced to 275 minutes. Considering \nthe tedious nature of this work of manually converting pages to semantic wiki pages, the value provided \nby the prototype tool is very well appreciated. 5. Discussion and Future Work In this paper we have \nproposed a semi-automatic information extraction based approach to transform wiki pages into semantic \nmedia wiki pages in the domain of scientific museums. This work is a beginning of an exciting interdisciplinary \nresearch that combines ontology engineering, information extraction and museum sciences. We have reported \nthe approach and promising initial subjective evaluation results. We are in the process of improving \nthe prototype and conduct more objective evaluation of the system. We plan to focus on multilingual aspect \nin the immediate future. We plan to exploit the structural aspect of the wiki and SMW pages to optimize \nthe conversion process so that the new languages added to the system take much less time and effort. \n 6. References [1] Krötzsch, M. and al. 2007. Semantic Wikipedia. Web Semantics: SSA on the WWW. 5, \n4 (Dec. 2007), 251-261 [2] W3C. 2004. RDF/XML Syntax Specification (Revised). http://www.w3.org/TR/rdf-syntax-grammar/ \n(June 07, 2th) [3] ISO/IEC 21127:2006, A reference ontology for the interchange of cultural heritage \ninformation , ISO, Geneva. [4] Richman, A. E. and Schone, P. 2008. Mining Wiki Resources for Multilingual \nNamed Entity Recognition. In Proceedings of ACL 09: HLT, 1-9. [5] Kousetti, C., Millard, D. E. and Howard, \nY. 2008. A Study of Ontology Convergence in a Semantic Wiki. In Proceedings of the WikiSym 2008. ACM, \nNew York, NY. [6] Lafferty, J., McCallum, A. and Pereira, F. 2001. Conditional random: Probabilistic \nmodels for segmenting and labeling sequence data. In 18th Proc. of the Int. Conf. on Machine Learning, \n282-289. Morgan Kaufmann, San Francisco.  \n\t\t\t", "proc_id": "1639950", "abstract": "<p>In this paper, we describe an approach for creating semantic wiki pages from regular wiki pages, in the domain of scientific museums, using information extraction methods in general and named entity recognition in particular. We make use of a domain specific ontology called CIDOC-CRM as a base structure for representing and processing knowledge. We have described major components of the proposed approach and a three-step process involving name entity recognition, identifying domain classes using the ontology and establishing the properties for the entities in order to generate semantic wiki pages. Our initial evaluation of the prototype shows promising results in terms of enhanced efficiency and time and cost benefits.</p>", "authors": [{"name": "Alain Plantec", "author_profile_id": "81321496541", "affiliation": "Universit&#233; de Brest, Brest, France", "person_id": "P1728575", "email_address": "", "orcid_id": ""}, {"name": "Vincent Ribaud", "author_profile_id": "81375609204", "affiliation": "Universit&#233; de Brest, Brest, France", "person_id": "P1728576", "email_address": "", "orcid_id": ""}, {"name": "Vasudeva Varma", "author_profile_id": "81309499278", "affiliation": "IIIT Hyderabad, Hyderabad, India", "person_id": "P1728577", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640006", "year": "2009", "article_id": "1640006", "conference": "OOPSLA", "title": "Building a semantic virtual museum: from Wiki to semantic Wiki using named entity recognition", "url": "http://dl.acm.org/citation.cfm?id=1640006"}