{"article_publication_date": "10-25-2009", "fulltext": "\n OOPSLA Idol A Contest to Determine the Most Innovative Idea at OOPSLA 2009 Aki Namioka Juanita Ewing \nDevelopment Manager Software Architect Cisco Systems FIREApps anamioka@cisco.com juanitae@fireapps.com \nAbstract Contestants will have the opportunities to submit a written sum­mary of their technical innovations, \nto a panel of experts before the OOPSLA Idol Event (Panel). The experts (judges) will cull through the \nsubmissions and the top 5 will be asked to present their ideas to the judges. The judges will comment \non the ideas and the audience will vote for the best submission. Categories and Subject Descriptors: \nD.0 Software, General General Terms: Innovation. Keywords: innovation, competition 1. Aki (Host) Aki \nis excited to present the first OOPSLA Idol contest. After more than 20 years in the software industry, \nand 11 OOPSLA conferences, she has seen lots of great ideas come and go. Her previous OOPSLA productions \ninclude From Sorceress to Scien­tist: Women in Computing and Extreme ISO!?! . She was also a member of \nthe cast of No Silver Bullet . 2. Juanita (Judge) During her many years at the forefront of object-orient \ntechnol­ogy, Juanita Ewing has been a keen observer and critic. She has been involved in a myriad of \nventures (interesting ventures, though not particularly successful ones), with opportunities to examine \nand evaluate a wide variety of ideas. She is looking forward to the challenges of the OOPSLA Idol competition \nand wishes good luck to all entrants! 3. Brian (Judge) Brian Foote has been programming professionally \nsince the dawn of the Carter Administration, mostly in the service of academic researchers of various \nstripes. He has extensive realtime pro­gramming experience. His association with the academy has enabled \nhim to dabble extensively in research. His interests include objects, program­ming, programming language \ndesign, reflection, metalevel archi- Copyright is held by the author/owner(s). OOPSLA 2009, October 25-29, \n2009, Orlando, Florida, USA. ACM 978-1-60558-768-4/09/10. Brian Foote E. Michael Maximilien Senior Pontificator \nResearch Staff Industrial Logic IBM Almaden Research Center bigballofmud@gmail.com mmaximilien@gmail.com \n tecture, patterns, and software devolution. His exposure to Smalltalk during his impressionable formative \nyears indelibly shaped his attitudes towards software architecture and design. Brian is still one of \nfive people to have attended every OOPSLA conference to-date. He is currently helping to train the next \ngen­eration of object-oriented programmers in the niceties of design patterns and iterative incremental \nmethods. 4. Max (Judge) Dr. E. Michael Maximilien, is a research staff member at IBM's Almaden Research \nCenter in San Jose, California. Prior to join­ing ARC, Max spent ten years at IBM's Research Triangle \nPark, N.C., in software development and architecture. Max led various small- to medium-sized teams, designing \nand developing enter­prise and embedded Java software; he is a founding member and contributor to three \nworldwide Java and UML industry stan­dards. Max's primary research interests lie in distributed systems \nand software engineering for the Web; in particular, Web APIs and services, mashups, Web 2.0, cloud computing, \nSOA (service­oriented architecture), social software, and Agile methods and practices. His most recent \nresearch project at IBM Almaden re­sulted in an internal cross-cloud (public and private) management \nand scaling Web-based platform. Max is active participants and contributor to communities related to \nRuby, Ruby on Rails, and Agile methods and practices, inside and outside of IBM. Reach Max via his Web \nsite (www.maximilien.com) and blog (blog.maximilien.com). 5. Contest Format Before the Event, Contestants \nwill have the opportunity to submit their ideas to ooplsa-idol@googlegroups.com. The Judges will review \nthe submissions and the best 5 will be invited to present their innovation idea at the Event. During \nthe Event, each Contestant will be given 5 minutes to present their idea to the Judges and OOPSLA audience. \nThe Judges will have up to 2 minutes each to comment on the presen­tation. The Judges will select the \ntop 3, and the OOPSLA audi­ence will select the winner from the final 3 choices.   \n\t\t\t", "proc_id": "1639950", "abstract": "<p>Contestants will have the opportunities to submit a written summary of their technical innovations, to a panel of experts before the OOPSLA Idol Event (Panel). The experts (judges) will cull through the submissions and the top 5 will be asked to present their ideas to the judges. The judges will comment on the ideas and the audience will vote for the best submission.</p>", "authors": [{"name": "Aki Namioka", "author_profile_id": "81100181894", "affiliation": "Cisco Systems, San Jose, CA, USA", "person_id": "P1728689", "email_address": "", "orcid_id": ""}, {"name": "Juanita Ewing", "author_profile_id": "81100427009", "affiliation": "FIREApps, Inc., Portland, OR, USA", "person_id": "P1728690", "email_address": "", "orcid_id": ""}, {"name": "Brian Foote", "author_profile_id": "81100258465", "affiliation": "Industrial Logic, Berkeley, CA, USA", "person_id": "P1728691", "email_address": "", "orcid_id": ""}, {"name": "E. Michael Maximilien", "author_profile_id": "81100291935", "affiliation": "IBM Almedan Research Center, San Jose, CA, USA", "person_id": "P1728692", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640042", "year": "2009", "article_id": "1640042", "conference": "OOPSLA", "title": "OOPSLA idol: a contest to determine the most innovative idea at OOPSLA 2009", "url": "http://dl.acm.org/citation.cfm?id=1640042"}