{"article_publication_date": "10-25-2009", "fulltext": "\n The Knowledge Worker of the Future Cary A. Bran Tom Malone Cisco Systems Inc. MIT cbran@cisco.com malone@mit.edu \nAbstract In today s competitive business environment, there are ever in­creasing pressures upon knowledge \nworkers to solve problems in a near real-time manner. It is the responsibility of the knowledge worker \nto interpret, analyze and act upon information. Today collaboration-enabling technologies such as email, \ninstant mes­saging, web meetings and teleconferencing enable businesses to realize operational efficiencies. \nIs change on the horizon? The next generation of knowledge workers will be unlike any seen before. Millennials \nintroduce employees into the workforce whose use of technology is greater than any other previous generation. \nThis panel will explore what, if any impact the Millennial workforce will have upon the work environment. \nWhat will be the single most significant influence in the next 5 years that will affect knowledge workers \nand the organizations in which they work? In what way will traditional walls between work and private \nlife break down and is this a good thing? What types of devices will tomorrow s workers will use to get \ntheir job done? What impacts will consumer-facing applications have upon enterprise software and IT departments? \nHere is your op­portunity to participate in the conversation with our panel of ex­perts. Categories and \nSubject Descriptors K.1 [The Computer Industry]: Markets K.4.3 [Organizational Impacts]: Computer supported \ncollabora­tive work  General Terms Management, Security, Human Factors Keywords Collaboration, Millennials, \nKnowledge Worker  1. Tom Malone, malone@mit.edu Thomas W. Malone is the Patrick J. McGovern Professor \nof Man­agement at the MIT Sloan School of Management and the found­ing director of the MIT Center for \nCollective Intelligence. He was also the founding director of the MIT Center for Coordination Science \nand one of the two founding co-directors of the MIT Ini­tiative on \"Inventing the Organizations of the \n21st Century\". Pro- Copyright is held by the author/owner(s). OOPSLA 2009, October 25-29, 2009, Orlando, \nFlorida, USA. ACM 978-1-60558-768-4/09/10. Deborah Lewis Joe Burton Glaivestone Software Cisco Systems, \nInc. dlewis@glaivestone.com jbburton@cisco.com fessor Malone teaches classes on leadership and information \ntechnology, and his research focuses on how new organizations can be designed to take advantage of the \npossibilities provided by information technology. For example, Professor Malone predicted, in an article \npublished in 1987, many of the major developments in electronic business over the last decade: electronic \nbuying and selling, electronic markets for many kinds of products, \"outsourcing\" of non-core functions \nin a firm, and the use of intelligent agents for com­merce. The past two decades of Professor Malone \ns research are summarized in his critically acclaimed book, The Future of Work: How the New Order of \nBusiness Will Shape Your Organization, Your Management Style, and Your Life (Harvard Business School \nPress, 2004). This book has been translated into Chinese, Japa­nese, Korean, Portuguese, Spanish, and \nRussian. Professor Malone has also published over 75 articles, research papers, and book chapters; he \nis an inventor with 11 patents; and he is the co-editor of three books: Coordination Theory and Col­laboration \nTechnology (Erlbaum, 2001), Inventing the Organiza­tions of the 21st Century (MIT Press, 2003), and Organizing \nBusiness Knowledge: The MIT Process Handbook (MIT Press, 2003). Malone has been a cofounder of three \nsoftware companies and has consulted and served as a board member for a number of other organizations. \nHe speaks frequently for business audiences around the world and has been quoted in numerous publications \nsuch as Fortune, New York Times, and Wired. Before joining the MIT faculty in 1983, Malone was a research \nscientist at the Xerox Palo Alto Research Center (PARC) where his research involved designing educational \nsoftware and office information systems. His background includes a Ph.D. and two master s degrees from \nStanford University, a B.A. (magna cum laude) from Rice Uni­versity, and degrees in applied mathematics, \nengineering­economic systems, and psychology.  2. Joe Burton, jbburton@cisco.com Joe Burton is vice \npresident and chief technology officer in Cisco's Voice Technology Group. His team is responsible for \nvision, technical strategy, and advanced research for Unified Communications at Cisco. Unified Communications \nis a suite of Internet Protocol (IP) voice, data, and video products and applica­tions designed to help \norganizations of all sizes streamline busi­ness processes and work more efficiently. Additionally, Joe \nand his team represent Cisco in many Unified Communications industry standards organizations and represent \nthe Cisco Unified Communications team in many cross-Cisco initiatives.  Joe is a highly regarded visionary \nin the industry and an evangel­ist for Cisco. He has a passion for technology and innovation, as well \nas a demonstrated business savvy that has been instrumental in several of Cisco's acquisitions, including \nLatitude, WebEx, and Securent. During his career at Cisco, Joe has led the development of many of Cisco's \nUnified Communications products, including Meeting-Place voice, video, and data conferencing products; \nIPVC video conferencing; IP Communicator; Unified Advantage; Cisco Uni­fied Personal Communicator; productivity \napplication integra­tions; and Cisco Unity Connection integrated voice messaging products.  \n\t\t\t", "proc_id": "1639950", "abstract": "<p>In today's competitive business environment, there are ever in-creasing pressures upon knowledge workers to solve problems in a near real-time manner. It is the responsibility of the knowledge worker to interpret, analyze and act upon information. Today collaboration-enabling technologies such as email, instant mes-saging, web meetings and teleconferencing enable businesses to realize operational efficiencies.</p> <p>Is change on the horizon? The next generation of knowledge workers will be unlike any seen before. Millennials introduce employees into the workforce whose use of technology is greater than any other previous generation. This panel will explore what, if any impact the Millennial workforce will have upon the work environment.</p> <p>What will be the single most significant influence in the next 5 years that will affect knowledge workers and the organizations in which they work? In what way will traditional walls between work and private life break down and is this a good thing? What types of devices will tomorrow's workers will use to get their job done? What impacts will consumer-facing applications have upon enterprise software and IT departments? Here is your opportunity to participate in the conversation with our panel of experts.</p>", "authors": [{"name": "Cary A. Bran", "author_profile_id": "81100468465", "affiliation": "Cisco Systems, Inc, Seattle, WA, USA", "person_id": "P1728700", "email_address": "", "orcid_id": ""}, {"name": "Tom Malone", "author_profile_id": "81100548740", "affiliation": "Massachusetts Institute of Technology, Cambridge, MA, USA", "person_id": "P1728701", "email_address": "", "orcid_id": ""}, {"name": "Deborah Lewis", "author_profile_id": "81444603882", "affiliation": "Glaivestone Software, Los Angels, CA, USA", "person_id": "P1728702", "email_address": "", "orcid_id": ""}, {"name": "Joe Burton", "author_profile_id": "81444598962", "affiliation": "Cisco Systems, Inc., San Jose, CA, USA", "person_id": "P1728703", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640044", "year": "2009", "article_id": "1640044", "conference": "OOPSLA", "title": "The knowledge worker of the future", "url": "http://dl.acm.org/citation.cfm?id=1640044"}