{"article_publication_date": "10-25-2009", "fulltext": "\n The OOPSLA Trivia Show (TOOTS) Jeff Gray University of Alabama at Birmingham Department of Computer \nand Information Sciences Birmingham, AL USA gray@cis.uab.edu  ABSTRACT OOPSLA has a longstanding tradition \nof being a forum for discussing the cutting edge of technology in a fun and participatory environment. \nThe type of events sponsored by OOPSLA sometimes border on the unconventional. This event represents \nan atypical panel that conforms to the concept of a game show that is focused on questions and answers \nrelated to OOPSLA themes. The goal of the panel is to provide an educational opportunity for OOPSLA attendees \nto learn about a broad range of topics in a style that encourages audience participation. Categories \nand Subject Descriptors D.1.5 [Programming Techniques]: Object-oriented Programming; D.2.2 [Software \nEngineering]: Design Tools and Techniques; D.2.3 [Software Engineering]: Coding Tools and Techniques \nGeneral Terms Design, Languages. Keywords Objects, Game Show. 1. Overview of the OOPSLA Trivia Show OOPSLA \nhas one of the most diverse collections of attendees among all computer science conferences. At OOPSLA, \nacademic researchers working on theoretical areas of language design may share a conversation with a \ndeveloper from industry who is working with the latest new technology. Moreover, an OOPSLA first-timer \nwill have the opportunity at a workshop or social event to converse with an OOPSLA veteran. This panel \ncontinues in that tradition by encouraging attendees from all backgrounds to share their knowledge related \nto the common themes of OOPSLA. The objective of this panel is to educate the audience on diverse topics \nand provide some technology takeaways in a style that is entertaining. To meet this objective, the panel \nwill conform to the concept of a game show that is focused on topics related to OOPSLA.  2. The OOPSLA \nTrivia Show Rules The panel will follow the general rules of a popular game Copyright is held by the \nauthor/owner(s). OOPSLA 2009, October 25-29, 2009, Orlando, Florida, USA. ACM 978-1-60558-768-4/09/10. \n Douglas C. Schmidt Vanderbilt University Dept. of Electrical Engineering and Computer Science Nashville, \nTN USA schmidt@dre.vanderbilt.edu show, with a few variations. The list below summarizes some of the \nparticular rules that will be observed in the panel: All responses must be given in the form of a question. \nEach team gets one warning when this rule is violated. Subsequent violations will be counted as an incorrect \nresponse, even if the content of the response is correct.  There will be three teams, each with three \nplayers. The teams will represent attendees from industry, academia, and students.  When a team answers \na question incorrectly, one of the team members must leave the game (typically, the member that suggested \nthe incorrect response). A member of the audience from the same group may join the team to keep each \nteam size at three. Thus, the concept of panel member replacement, as typical in a Fish Bowl arrangement, \nis adopted to improve audience participation.  Once eliminated, a participant cannot come back into \nthe game.  The teams have 30 seconds to provide an answer. Any question that is unanswered will be asked \nto the audience at large. Thus, a fourth team is represented by the general audience, who also have the \nopportunity to respond and have their cumulative score recorded.  There will be three rounds of play \nwith each round having five categories and each category having five questions of increasing difficulty \nand value. The initial two rounds will be similar, but the final third round represents a single question. \n In the final round, a single category will be revealed and the participants must wage a portion of \ntheir current score. The answer is then revealed to the contestants and they must provide the correct \nquestion within one minute. The score of each team is updated based on the correctness of their answer \nand the value that they waged.  After the final round, the team with the highest score is declared the \nwinner.  All decisions relating to the correctness of a team response will be determined by the Judge. \n  At the end of the contest, all participants will be asked to join their team on stage for photos \nthat will be used to archive the event. All members of the winning team will receive a token prize. \n 3. Sample Question Areas Because OOPSLA has attendees from diverse backgrounds and experience levels, \nthe questions will be defined broadly to cover many topics of interest at different levels of difficulty. \nThe questions will be designed in a manner to educate a general audience in an engaging way. When possible, \nquestions involving multimedia will be offered, such as short video clips, images, and sounds. A total \nof two full rounds (25 questions per round) and a final round will provide 51 questions for consideration \nin the contest. The following represent a sample of the categories that will be covered: OOPSLA History \n Trivia from past OOPSLAs  OOPSLA 2009 Trivia Various factoids related to the current conference  \nPopular Topics from OOPSLA Design Patterns, Enterprise Middleware, OO Language Design  Questions from \nOOPSLA Spinoffs UML, AOSD, XP  Current conference themes  Scaling: Multi-core to Cloud, Mashups of \nModels, Data and Code, Tools for Reliability and Evolution, Enterprise Agile Management  4. Key Participants \nThe participants of the panel come from three separate groups: the question curators (who design the \ngame show content), the contestants, and the organizers (who moderate and coordinate the production of \nthe game show). Question Curators The committee of Question Curators assists in defining questions for \neach category and ensuring the correctness of each answer. This committee will be comprised of members \nwho are well-known in the OOPSLA community from both industry and academia. The Question Curators for \nthis panel are: Mehmet Aksit, University of Twente  Frank Buschmann, Siemens AG  Shigeru Chiba, Tokyo \nInstitute of Technology  Siobhán Clarke, Trinity College Dublin  Richard Gabriel, IBM Research  Jeff \nGray, University of Alabama at Birmingham  Kevlin Henney, Curbralan  David Holmes, Sun Microsystems \n Ralph Johnson, Univ. of Illinois at Urbana-Champaign  Steven Kelly, MetaCase  Doug Lea, State University \nof New York at Oswego  Doug Schmidt, Vanderbilt University  Wolfram Schulte, Microsoft Research  Peri \nTarr, IBM Research  Jan Vitek, Purdue University  Joseph Yoder, The Refactory  Contestants The three \ncontestant teams will represent the categories of the primary constituents at OOPSLA: industry, academia, \nand students. Contestants representing the teams from industry and academia are leaders in the OOPSLA \ncommunity and those who had a prominent role in previous OOPSLAs. The student team will be seeded with \nparticipants who are OOPSLA student volunteers, or student authors of OOPSLA 2009 papers. Due to the \nFish Bowl format, when questions are answered incorrectly the contestants will also be dynamically replaced \nby members of the general audience. As noted in Section 2, there is a fourth team that is composed of \nthe entire general audience (i.e., the general audience has the opportunity to provide a response to \neach question that goes unanswered). Faculty Team: William Cook, University of Texas at Austin  Yuanfang \nCai, Drexel University  Phil Greenwood, Lancaster University  Industry Team: Gail E. Harris, Instantiated \nSoftware Inc.  Juha-Pekka Tolvanen, MetaCase  Student Team: Damian Dechev, Texas A&#38;M University \n Grzegorz Majewski, Univ. of the West of Scotland  Mutaz M. Al-Debei, Brunel University - West London \n  Organizers Jeff Gray is an Associate Professor in the Department of Computer and Information Sciences \nat the University of Alabama at Birmingham (UAB) where he co-directs the research in the Software Composition \nand Modeling (SoftCom) laboratory. His research interests are in aspect­oriented software development, \nmodel-driven engineering, domain-specific languages, and generative programming. Jeff has attended every \nOOPSLA since 1995. Over the past 9 years, he has co-organized the popular OOPSLA workshop on Domain-Specific \nModeling (DSM) and organized an OOPSLA 2008 panel on Domain-Specific Languages. He is an NSF CAREER award \nwinner and the current Alabama Professor of the Year (Carnegie Foundation). Jeff is the 2009 Program \nco-Chair of the conference on Software Language Engineering (SLE) and the 2009 Organizing Chair of the \nconference on Aspect-Oriented Software Development (AOSD).  Douglas C. Schmidt is a Professor of Computer \nScience and Associate Chair of the Computer Science and Engineering program at Vanderbilt University. \nHe has published 9 books and over 400 technical papers that cover a range of research topics, including \npatterns, optimization techniques, and empirical analyses of software frameworks and domain-specific \nmodeling environments that facilitate the development of distributed real-time and embedded (DRE) middleware \nand applications running over high­speed networks and embedded system interconnects. Dr. Schmidt has \nover fifteen years of experience leading the development of ACE, TAO, CIAO, and CoSMIC, which are widely \nused, open-source DRE middleware frameworks and model-driven tools that contain a rich set of components \nand domain-specific languages that implement patterns and product-line architectures for high­performance \nDRE systems. Doug has organized several workshops at OOPSLA and also served as the Program Chair of OOPSLA \n2004. As formal participants, Jeff will serve as the moderator and Doug will play the role of judge, \nscore keeper, and award presenter.   \n\t\t\t", "proc_id": "1639950", "abstract": "<p>OOPSLA has a longstanding tradition of being a forum for discussing the cutting edge of technology in a fun and participatory environment. The type of events sponsored by OOPSLA sometimes border on the unconventional. This event represents an atypical panel that conforms to the concept of a game show that is focused on questions and answers related to OOPSLA themes. The goal of the panel is to provide an educational opportunity for OOPSLA attendees to learn about a broad range of topics in a style that encourages audience participation.</p>", "authors": [{"name": "Jeff Gray", "author_profile_id": "81100403059", "affiliation": "University of Alabama at Birmingham, Birmingham, AL, USA", "person_id": "P1728387", "email_address": "", "orcid_id": ""}, {"name": "Douglas C. Schmidt", "author_profile_id": "81339526336", "affiliation": "Vanderbilt University, Nashville, TN, USA", "person_id": "P1728388", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640045", "year": "2009", "article_id": "1640045", "conference": "OOPSLA", "title": "The OOPSLA trivia show (TOOTS)", "url": "http://dl.acm.org/citation.cfm?id=1640045"}