{"article_publication_date": "10-25-2009", "fulltext": "\n How Does Project Managers Personality Matter? Building the Linkage between Project Managers Personality \nand the Success of Software Development Projects. Yi Wang Department of Information System City University \nof Hong Kong 83 Tat Chee Avenue Kowloon, Hong Kong ywang1@acm.org Abstract The relationships between \nproject managers individual characteristics and the success of the projects do not receive enough attentions \nin current software engineering researches. However, as the core member of a software development team, \nthe project manager s leadership level influences the development process in a great part. The existing \nliteratures have shown the importance of individual s personality to his or her behaviors, which include \nthe leadership behaviors certainly. Therefore, exploring how the project managers personality influences \nthe success of the software development projects has significant potential utility. In this paper, we \npresent a research to integrate the Five Factor Model (FFM) for the personality with the existing work \non the leaderships influence to project success. Through the empirical study based on data from 116 real \nsoftware projects, we found general support for our conceptual research framework and related hypotheses. \nThe results not only reveal that the five big personality factors can be treated as indicators for the \nsuccess of the software development projects, but also provide the evidence on how the project managers \npersonality influences the success of the software development projects through mediating effects of \nthe leadership. The general support for the relationship between leadership and the success of software \ndevelopment projects is also found. Categories and Subject Descriptors D.2.9 [Software Engineering]: \nManagement - Programming Teams. K.6.1 [Management of Computing and Information Systems]: Project and \nPeople Management-Staffing. General Terms Management, Human Factors. Keywords Five Factor Personality \nModel (FFM), Personal Attributes, Project Manager, Software Project Success Permission to make digital \nor hard copies of all or part of this work for personal or classroom use is granted without fee provided \nthat copies are not made or distributed for profit or commercial advantage and that copies bear this \nnotice and the full citation on the first page. To copy otherwise, or republish, to post on servers or \nto redistribute to lists, requires prior specific permission and/or a fee. OOPSLA 2009, October 25-29, \n2009, Orlando, FL, USA. Copyright &#38;#169; 2009 ACM 978-1-60558-768-4/09/10 $10.00. Fan Li Unilever \nChina 33 North Fuquan Road Changning District, Shanghai 200335, P.R.China   1. Introduction For many \nyears, the relationships between the project managers individual characteristics and the success of the \nprojects do not receive enough attentions in the software engineering researches. Researchers more tend \nto study the technical and team factors that influence the software development. One domain of individual \ndifference that received limited attention is the project managers personality. However, it is no deny \nthat project manager plays an essential role in most software development project. Project manager is \nthe core member of the team and served as a hub for other stakeholders. His or her leadership level is \ncrucial for the success of a specific project. Given that the personality partly influences the people \ns behavior [4], the leadership behaviors, as a major dimension of human behaviors, are greatly influenced \nby the individual s personality. Therefore, it is necessary to adopt empirical studies to explore whether \nthere are some links between the project managers personality and the success of software development \nproject. If there are, another challenge is to build a framework to illustrate how the project managers \npersonality influences the success of software development projects. This kind of studies will enhance \nour understandings towards the project managers individual characteristics impacts on the development \nprocess. It also can bring practical implications on the selecting and training the project managers, \nand hence facilitate the increase on the production of software development. Although some studies have \npointed out the possibility on the relationships between project managers personality and the success \nof software development projects, there is still in lack of well established studies to illustrate how \nthe project mangers personality works. Most existing studies also do not treat software development as \nthe independent research focus. Considering the unique features (knowledge intensive, depending on human \ncapability and skill, etc.) of software development, it is reasonable to conduct this kind study. To \nfulfill this research gap, we describe an empirical study to build the linkage between project managers \npersonality and the success of the software development project in this article. We not only want to \nexplore whether the project managers personality influences the software projects success but also want \nto find how it works. In this study, we proposed a model that integrated the Five Factor personality \nmodel (FFM) [11] and the Mohan Thite s model [25]. The first model provides concise but comprehensive \nquantitative approach to measure the individual s personality, while the second one proves the leadership \ns influence to the success of the software project. Our model uses leadership as a medium between the \npersonality and the success of software development project.  Through the empirical studies on 116 software \nprojects, we found general support for our major research model and corresponding research hypotheses. \nThis indicates our model can successfully explain how the project managers personality impacts the success \nof software development projects. We also find some evidence to support the relationship between leadership \nand the success of software development projects. The remainder of this article is organized as follows. \nSection 2 provides the theoretical backgrounds and related work. Section 3 presents the research model \nand the corresponding hypotheses development. Section 4 describes the empirical research design and the \nmeasurement for each construct. Section 5 provides the research results. Section 6 discussed the implications \nand limitations of this study, and section 7 concludes the article.  2. Theoretical Backgrounds and \nRelated Work 2.1 Five Factor Personality Model People s attitudes, beliefs, cognitions and behaviors \nare determined by their personality in a great part. People s personality is reflected by their thoughts, \nbehaviors, and life styles. Because of the unique role that personality plays in the human behaviors, \nit is reasonable to expect the personality will also play a part in professional software development \nprocess. There has been some model presented to describe the individuals personality such as NBTI1. However, \nthe number of personality attributes is overwhelming and lacks clearly major personality classification \nin existing models, which threats the application of personality theory in the other quantitative research \nuntil the appearance of the Five Factor Model (FFM) [5]. FFM collapses all personality traits into five \nbroad factors, which are: {Openness, Neuroticism, Agreeableness, Conscientious, Extraversion.} Each represents \na dimension of the personality and contains several sub factors [12]. There are still some other kinds \nof items used to refer these factors, but the meanings of them are identical. Detailed information on \nthese five factors will be presented in discussing the hypotheses development. 2.2 Mohan Thite s Model \nMohan Thite [25] applied the Bass and Avolio s model [8, 9] on transformational and transactional leadership \nto build a relationship between the project managers leadership level with the success of IT projects \nthrough empirical study towards 70 IT project managers (not only contains software project managers, \nbut also contains managers of other kinds of IT projects). In his study, he used t-test to identify the \ndifferent project results due to 1 http://www.personalitypathways.com/type_inventory.html Figure 1. \nThe Mohan Thite s Model on the project managers leadership and the success of IT projects. the different \nproject managers leadership level, hence pointed out the possibility of the casual relationship. In short, \nMohan Thite built a model that can be illustrated by following figure. From this figure, we can find \nthe project managers leadership level is one of the key factors for the success of the IT project. In \nthis model, the technical leadership was added as the third domain to the Bass and Avolio s model to \nreflect the technical feature of leadership in IT project.  2.3 Related Work 2.3.1 In Software Engineering \nDomain As far as our current knowledge, there is no established work on this issue in the software development \narea. However, there is one study [2] trying to build linkage between the {software engineers personality, \nteam process, task characteristics} and {satisfaction, quality source code}. The major problem of their \nwork is that it lacks theoretical foundations. They just ad hoc assumed there maybe some relationships \nand then verified it without sufficient analysis. This study also fails to explain how these independent \nvariables influence the dependent variables. Acuña et al [1] also discussed the personality issues in \nexploring the influence of human capabilities to the software development. They adopt NBTI to measure \nthe software engineers personality to find a efficient pattern in founding software development team. \nMost existing related studies on the personality mainly discuss its relationship with specific software \ndevelopment role. Turley and Bieman [27] discussed the standard skills and personality traits of software \nengineers and software engineering roles. Moore [23] used standard personality tests to define the personality \nprofiles of programmers, systems analysts, programmers, and software services managers. Wynekoop and \nWalz [28] identified the personality traits of top performing software engineers, and built a empirical \nmodel to describe their findings. Although there are not many studies focus on the personality, the emphasis \non the human factors in software development can be dated back to the early stage of the software engineering, \nincluding researches as Psychology of Programming [13, 17], and Software Psychology [24]. Some ideas \nin Peopleware [14] also reflect this emphasis.  2.3.2 In Management Domain In the general project management \narea, there is also in lack of similar study. Two studies examined the relationship between the project \nmanager s personality attributes and the project success. The first one [15] tried to build relationship \nbetween {project managers personality, process type} and {project success}. In their study, they did \nnot consider all personality constructs. The only took the openness into consideration. Besides, 73.5% \n(36 in 49) subjected projects are traditional projects but not high-tech projects.  Figure 2. The conceptual \nresearch model. Another study [10] is more completed, their study show that the openness and conscientious \nare good predictors for the project success. However, the data collection of this study suffers several \nsevere problems. In the first place, it uses subjective self-reported data from their students rather \nthan objective data collected from real environments. Secondly, its focus is not on the IT project. So, \nwe can not assume that their results can be directly applied to the software development domain. Another \nproblem of this study is the sample size was too small even do not fulfill the 10 times2 rule. Both above \nstudies just treated the project managers personality as the predictor of the project success, but fail \nto explain how the project managers personality works. This is the most apparent differences between \nthese studies and ours.   3. Conceptual Research Framework and Hypotheses Development 3.1 Research \nModel Introduction The conceptual model, which frames this study, is depicted in the figure 2. This model \ncontains 6 indicators (five factors of FFM, and the leadership), 4 control variables (Experience, Training, \nTeam capability, and Project Complexity), and 1 dependent variable (Success of the software development \nproject). Based on the existing theories and empirical results, we develop 6 hypotheses to build linkage \nbetween the Five Factor Model and the Mohan Thite s model. We supposed the personality factors would \ndirectly influence (positively or negatively) the project managers leadership level, and hence indirectly \ninfluence the result of the software development project (H1-H5a). One big personality factor (Extraversion) \nis also supposed to have direct influences to the results (H5b). According to leadership theory [7], \nthe leadership level can be improved through the accumulation of past experience and the professional \ntraining. Therefore, we use two control variables: Experiences and Training. The dependent variables \n(DV) in this study is: the Success of Software Development Projects For the software development project \nis also a kind of IT project, so the linkage between them can be directly deduced from Mohan Thite s \nModel. Considering the software development process is complex and with high uncertainty, we chose another \ntwo control variables in our study. They are Project Complexity and Team Capability , which has significant \ninfluence the final results of the software development projects. However, we did not put all potential \npossible factors (e.g. project duration, project type, etc.) into the research model. This was the trade-off \nbetween the model complexity and the expressiveness. We made this decision mainly based on the scope \nof this research. Some factors, such as the project size and team composition, are closely correlated \nwith the selected two control variables (project complexity and team capability). We also did not consider \nthem separately. This study also mainly focused on project team level, therefore, the organizational \nfactors such as organizational environment are also beyond the scope of this study. Then, we will first \nintroduce how these hypotheses are developed in next subsection. The measures for each variable will \nbe illustrated in the research design section. 2 The minimal sample size often assumed as 10 times of \nthe number of indicators.  3.2 Research Hypotheses Development In this sub-section, we will briefly \ndiscuss how the six research hypotheses are developed. They will be introduced according to each big \n5 personality factor respectively. The hypotheses mainly derive their theoretical foundations by combining \nprior literature review on psychology, project management, software engineering, and so on. 3.2.1 Openness \nto Experience Openness refers to a general appreciation for art, emotion, adventure, unusual ideas, imagination, \ncuriosity, and variety of experience. The trait distinguishes imaginative people from down­to-earth, \nconventional people [11]. People who are high on openness are often willing to try new things, while \nthose low in this dimension often prefer stability and the states quo. Meanwhile, People with low scores \non openness tend to have more conventional, traditional interests. They prefer the plain, straightforward, \nand obvious over the complex, ambiguous, and subtle. They may regard the arts and sciences with suspicion, \nregarding these endeavors as abstruse or of no practical use. Closed people prefer familiarity over novelty. \nThey are conservative and resistant to change. Hough and Furnham [19] concluded the openness is increasing \nimportant for the change and diversity are norm in today s business environment. The software development \nactivities often influenced by many unpredictable factors and hence under high uncertainties. Therefore, \nopenness to these challenges is important for the project manager in transforming the team morale. Besides, \nthe software development technologies and methodologies keep changing. The understanding towards up-to-date \ntechnology in project managers performance becomes essential [2]. Therefore, if a project manager is \nlow in openness, he or she may fail to catch up with the technical changes, and hence threats his or \nher technical leadership, which is an important dimension of the project managers leadership [25]. HYPOTHESIS \n1 (H1). Openness will be positively associated with the technical leadership performance of a project \nmanager. 3.2.2 Neuroticism Neuroticism is the tendency to experience negative emotions, such as anger, \nanxiety, or depression. It is sometimes called emotional instability. Those who are high in neuroticism \nare emotionally reactive and vulnerable to stress. They are more likely to interpret ordinary situations \nas threatening, and minor frustrations as hopelessly difficult. Their negative emotional reactions tend \nto persist for unusually long periods of time, which means they are often in a bad mood. These problems \nin emotional regulation can diminish a neurotic's ability to think clearly, make decisions, and cope \neffectively with stress. Many empirical researches [9, 14] have found evidences for the neuroticisms \nnegative effects to the work behaviors. The neurotics are easy to form negative beliefs and attitude \ntowards their work and fail to deliver a positive leadership. On the contrary, individuals low in neuroticism \nare commonly emotional sable and well-adjusted in dynamic environment. For project managers, if they \nare low in neuroticism, they can better deal with the troublesome issues in the development process and \ndeliver high level leadership. HYPOTHESIS 2 (H2). Neuroticism will be negatively associated with the \nleadership performance of a project manager. 3.2.3 Agreeableness From Graziano and Eisenberg s perspective \n[16], agreeableness refers to the kind, considerate, helpful and cooperative personality. It is obvious \nthat the agreeableness will facilitate the activities that ask for the collaborations and interactions \nbetween different individuals [6]. The software development projects are definitely such kind of activities. \nThe software developments involve intensive interpersonal interactions and team collaborations. Efficient \ncommunication and collaboration have been proven as the key factors for the success of the project [18]. \nBesides, the supports from the team leader to the members also influence the team performance. Project \nmanagers with high agreeableness are more likely to build a cooperative atmosphere in the development \nteam and eager to provide support and guide to the team members, which is an important domain of high \neffective leadership. HYPOTHESIS 3 (H3). Agreeableness will be positively associated with the leadership \nperformance of a project manager. 3.2.4 Conscientious Conscientiousness refers to the tendency to show \nself-discipline, act dutifully, and aim for achievement. The trait shows a preference for planned rather \nthan spontaneous behavior. It influences the way in which we control, regulate, and direct people s impulses. \nConscientiousness includes the factor known as Need for Achievement (NAch). Individuals with high conscientious \nare often self-motivated and willing to achieve high standard in their job performance through hard working \n[11]. Thus, we can expect the conscientious people to be more carefully consider how to achieve the high \nperformance in their job. They are eager to try their best to improve their leadership skills/manners. \nIt is also possible for project managers to set a role model for their subordinates and to positively \nstimulate them to achieve high team goal. The team stimulation is an important aspect of transformational \nleadership. HYPOTHESIS 4 (H4). Conscientious will be positively associated with the leadership performance \nof a project manager.  3.2.5 Extraversion People who are high in extraversion often enjoy being with \npeople, and are often perceived as full of energy. These individuals are social, active, outgoing and \nemphasizing the importance of the close and warm interpersonal relationships. High extraverted personalities \nare suitable in social-related jobs, such as managers and sales [15]. In another aspect, to achieve success \nof the software development, project managers need to deal with many external issues, for example, building \ntrustable relationship with customers, or wining supports from senior managers. Therefore, the extraversion \nnot only influences the internal leadership but also contributes to the success directly. HYPOTHESIS \n5a (H5a). Extraversion will be positively associated with the leadership performance of a project manager. \n HYPOTHESIS 5b (H5b). Extraversion will be positively associated with the Success of the software development \nproject directly.   4. Research Design In this section, we introduced the data collection procedures \nand the measurement instruments for each variable. The scale properties and data analysis approach are \nalso introduced. 4.1 Data Collection For we want to verify the research model using the real software \ndevelopment data, the first step of data collection is find target project through sampling. We selected \n50 subjected software development teams (exclude the unusable ones) whose sizes range from small to large. \nThe subjected teams belong to ten software development organizations. To keep the convenience of data \ncollection, all studies organizations are located in Shanghai. We have been examining the projects they \nfinished in last two years (06/2006-06/2008) under the same project manager. The number of subjected \nprojects is 116. We conducted a series of field studies to collect real software development data from \nSeptember to December in 2008. For each project, we collect three kinds of data; data collection procedure \nfollows same protocol and three steps. Collect the personality data and two control variables for leadership \nfrom project manager.  Ask the subordinate rate the leadership of the project mangers.  Extract the \nproject related information from the project review documents.  There were teams finished more than \none projects, therefore the project manager personality and leadership were not repeatedly measured if \nthe project manager did not change during this period. 4.2 Measurement Instruments 4.2.1 Indicators \nBig 5 Factors in FFM: The first five independent variables (FFM Big 5 Personality factors) were measured \nwith the established Neo-Five-Factor Inventory (NEO-FFI) [11, 12]. This is a well validated and frequently \nused measure of big 5 personality factors. It has been adopted by a lot of researches in measuring personality. \nProject Manager s Leadership: It was rated by the subordinates using the Multi-factors Leadership Questionnaire \n(MLQ Form 5x) [8, 20, 22]. However, we made some slight changes to it based on Mohan Thite s study. The \nrevised leadership evaluation contains six dimensions (we add one to evaluate the technical leadership \n[3]). Each dimension was scored separately. We combined the score of five dimensions of leadership into \nan overall one. The leadership scores (LS) were computed as the arithmetic average of the reported score \nmarked by their subordinates. For each project manager, we collected at least three subordinates rating. \nTo control the complexity of the data collection process, the maximal n equals 5. 4.2.2 Dependent Variables \nSuccess of Software development Project: This was rated in 5 scoring mechanism. 5 means the most success \nproject, while 1 means failed project. This measure was based on the project report that approved by \nthe high line managers after the project finished. Therefore, the reliability of this measure can be \nensured. 4.2.3 Control Variables. The first two control variables Experience and Training are self­reported \nby the project mangers. The experience is measured through the months of served as project manager role. \nAnd the training is measured by 0 and 1, where 1 mean that manager has obtained a professional (PMP3 \nor equivalents) certification. The latter 2 control variables are for the success of the software development \nprojects. The task difficulty was extracted from therelated project documents. We recoded the task difficulty \ninto 5 point scale, where 1 means the simplest and 5 means most difficult. For the convenience consideration, \nthe team capability was reported by the project manager. It is reasonable because the project manager \nknows his or her team best.  4.3 Scale Properties The statistical properties for most of the scales \nused in this study are well documented and examined in various researches. However, for the integrity \nof this research, we used Cronbach s alpha to examine them; and our test revealed they have acceptable \nreliabilities (Cronbach s alpha > 0.7). In order to use the structural equation models (SEM) to analyze \nthe data, we also conducted a confirmatory factor analysis (CFA). CFA is frequently used as a first step \nto assess the proposed measurement model in a SEM analysis. The factor loadings from CFA model were all \nsignificant (p <0.01), which means the unidimensionality of constructs is well supported. The convergent \nvalidity was tested following the Bentler-Bonnet method. The Bentler-Bonnet coefficient was above 0.90, \nmeaning the convergent validity was acceptable. For the discrimination validity test, the .2 test for \neach pair of constructs was also significant (p <0.01).  5. Results 5.1 Structural Equation Model \nAnalysis Results The hypotheses presented in section 3 were tested through a structural equation modeling \n(SEM) analysis. SEM analysis is suitable for confirmatory study rather than exploratory study. We used \nLISREL 8.74 (for Windows) in the path analysis. The results of the structural equation model analysis \nand the Model Fit results from several goodness of fit measures are presented in table 1. The path coefficients \ncan be viewed as the standardized regression coefficients that indicate the casual relationship (recursive \nmodel). 3 One major project management certification, for more details, http://www.pmi.org 4 http://www.ssicentral.com/lisrel/ \n Table 1. The Results of Structural Equation Model Analysis Hypothesis Path Std. Parameter estimate \nSignificant/ Not Significant H1. Openness Openness -> Leadership 0.18 Sig. (*) H2. Neuroticism Neuroticism \n-> Leadership -0.19 Sig. (*) H3. Agreeableness Agreeableness -> Leadership 0.26 Sig. (*) H4. Conscientiousness \nConscientiousness -> Leadership 0.17 Sig. (*) H5. Extraversion H5a. Extraversion -> Leadership H5b. Extraversion \n-> Success 0.15 0.20 Sig. (*) Sig. (*) Notes. Squared multiple correlation: Leadership 0.38. Model fit \ncriteria: .2/df=1.62, GFI=0.94, AGFI=0.91, RMSEA=0.03 5.1.1 Hypotheses Test Results  5.1.1.1 Openness \nto Experience (H1) H1 is supported. This result indicates the direct relationship between openness to \nexperience and leadership. The project manager high in openness to experience often has better leadership, \nand indirectly increases the possibility of the software development projects success. 5.1.1.2 Neuroticism \n(H2) H2 is supported. This result indicates the direct negative relationship between Neuroticism and \nleadership. The persons high in neuroticism may not quite suitable to the role of project managers. The \nemotional stability is important to form effective leadership. 5.1.1.3 Agreeableness (H3) H3 is supported. \nThis result indicates the direct relationship between agreeableness and leadership. The project manager \nhigh in agreeableness often has better leadership, and indirectly increases the possibility of the software \ndevelopment projects success. 5.1.1.4 Conscientiousness (H4) H4 is supported. This result strongly supported \nthe direct relationship between conscientiousness and leadership. The project manager high in conscientiousness \noften has better leadership, and indirectly increases the possibility of the software development projects \nsuccess. 5.1.1.5 Extraversion (H5a, H5b) H5a is supported. This result strongly supported the direct \nrelationship between extraversion and leadership. The project manager high in extraversion generally \nbuilds high level leadership, and indirectly increases the possibility of the software development projects \nsuccess. Moreover, H5b is also supported. We can find the standard parameter estimate is 0.20, which \nmeans the extraversion not only influence the success of the software development indirectly through \nthe leadership, but also has some directly influence. 5.1.2 The Significance of Adding FFM Constructs \nWe also examine the explanatory power of the FFM constructs over the leadership and success of the software \ndevelopment projects. For our model is recursive model, we can use Squared Multiple Correlation (SMC) \nto determine the influence of the adding FFM Constructs. The SMC for the leadership increased from 26% \nto 38%. From the statistically perspective, this provides evidence of the practical significance of adding \nthe FFM constructs. 5.1.3 The Overall Model Fit Indicators The most frequently used Model Fit measures \nare as follows: 1. .2/df (Chi Square/Freedom Degree) is 1.62, far less than 5 (Good Fit), and also less \nthan 2 (Perfect Fit); 2. GFI (Goodness Fit Index) is 0.94 (>0.90); 3. AGFI (Adjusted Goodness Fit Index) \nis 0.91; 4. RMSEA (Root-mean-square error of approximation) is 0.035 (<0.05).  All these four frequently \nused measures represent the theoretical model matching the actual data model; we can safely deduce that \nthe overall model is in good fit.  5.1.4 Summary of Results In this section, we discuss the results \nof the structural equation model analysis towards the collected data. All six hypotheses are supported. \nWe also find evidence for the leadership s influence on the success of software projects. The SMC increase \nindicates the adding of FFM factors to the Mohan Thite s model is reasonable and statistically significant. \nThe Model Fit measures show the hypothesized model well fit to the collected data. Therefore, the main \nfindings of this study can be specified as follows: According to collected data, the project managers \npersonality influences the success of software development projects and can be treated as predictors \nfor it. Besides, it is reasonable to assume the personality influence the project managers leadership \nlevel, hence indirectly and directly impacts the result of software development projects.   6. Implications \nand Limitations 6.1 Implications One of the major trends in personality research is the emphasis of building \nlinkage personality variables with the other models to illustrate the working manners of the personality. \nMeanwhile, current software engineering researches also begin to pay more attention to the human factors \nin the software development. This study can be treated as the joint of these two kinds of studies. The \nstudy also enhances the understanding on the importance of human factors (personality) in the software \ndevelopment process. The findings of this study have several theoretical and practical implications. \nFrom the theoretical perspective, the findings highlight the role of project mangers personality on the \nsuccess of the software development projects. It also presents partial explanations on how the personality \nworks. This study explores the possibility of integrating FFM with software project management models, \nwhich would bring insightful results and enhance the expressiveness and predictive power of the software \nproject management model. From the practical perspective, this research also has several important implications. \nIn the first place, this study provides evidence of the leadership s influence on the success of software \ndevelopment projects. These results remind the software development organizations should pay more attention \nto their project mangers leadership developments. In the second place, this study also provides evidence \nfor the use of project managers personality attributes as the predictors of the software projects success. \nMoreover, the evidence for assumption that the personality s influences are achieved partly through the \nleadership is also found. In the third place, the results of this study can be treated as the reference \nin selecting project managers for software development projects. Generally, individuals who are high \nin openness, conscientiousness, agreeableness, extroversion and low in neuroticism may be more suitable \nfor project manager positions. The software development organizations need to take personality into consideration \nin hiring or promoting new project managers. In the fourth place, this study has training implications \nas well. Project managers might benefit from customized training and should be select for the training \nprograms specially designed to help them overcome their negative personality inclination [25]. According \nto this study, current project management training might need to pay more attention to the unique human \nfactors. The training need to be carefully designed to avoid not only educates the project managers about \nthe standardized project management knowledge but also helps them to build the full scale leadership, \nespecially to the individuals with some negative personality profiles. Another practical implication \narises from the perspective of the software engineers. The software engineers should learn their managers \npersonality attributes in order to achieve the high efficient communications and collaborations. The \nproject managers should also pay enough attentions to their own personality profiles and try to avoid \nthe negative impacts to their leadership caused by their personality attributes. 6.2 Threats to Validity \n6.2.1 Internal Validity From an internal validity point of view, this study was conducted by two researchers. \nFor a single project, the data collected by the same person. There was no necessity and possibility for \nthe researchers to influence the subjects rating to the constructs. All the software engineers and their \nmanagers who engaged in this study have no conflict of interests with the researchers. The reasons and \nimpacts were self-reported in free form to remove any bias that could have been introduced by the researchers \ninfluence. Further more, the researchers had no privacy relationship with the research subjects. 6.2.2 \nExternal Validity From an external validity point of view, this study is based on the software development \norganizations locating in Shanghai. Although we made this decision mainly because of the convenience \nconsiderations, it is still an appropriate choice, for Shanghai is one of the cities where have highest \ndeveloped software development industry. Besides, Shanghai is also a city high in diversity. It is possible \nthat the results will be still valid in other areas in China. However, for the success of software development \ndepends on a potentially large number of relevant context variables including the organizational factors \nand task specific factors such as domain knowledge and task familiarity. We can not ensure the results \nstill work in other settings. For this reason, we cannot assume a priori that the results of our study \ngeneralize beyond the specific setting. Researchers would become more confident in a theory when similar \nfindings emerge in different contexts [7]. Towards this end we intend that our case study will be replicated \nin different setting by the researchers (ourselves also included). This research also can be treated \nas the benchmark for other future similar research conducted under other settings.   7. Concluding \nRemarks In conclusion, this study explores the possibility that the theories focus on individual characteristics \n(in this study, personality) in psychology field have a role in empirical software engineering researches. \nThrough combining the Five Factors Personality Model and Mohan Thite s model, we present a conceptual \nframework to describe how project managers personality factors influence the success of software development \nprojects. We also used 116 project data in real software development environment to verify the suggested \nmodel. Compared with other studies, this study more focuses on the software development projects, provides \nthe model on how the personality works, and also uses real project data for verification. These three \npoints are the major contributions to the project management and software engineering research. Besides, \nthis study also reflects the human factors do play important roles in software development process. Personality \nhas been largely ignored in the empirical software engineering researches over the past several decades. \nWe believe our study that builds the linkage between project managers personality and success of software \ndevelopment projects points out a new potential research direction in this area. For the future study, \nwe plan to link the FFM construct with more software development variables (for example, SPI or cost \nestimation), and hence increase the understanding of the human dimension of the software development \nprocess. Other opportunities for future research include identifying the more additional moderating relationships, \nexploring other possible variables influence, and so on.  References [1] Acuña S.T Juristo, N., and \nMoreno, Ana M. 2006. Emphasizing human capabilities in software development, IEEE Software, no. 9, 94-101. \n[2] Acuña, S. T., M. Gómez, and J. De Lara. 2008. Empirical Study of How Personality, Team Processes \nand Task Characteristics Relate to Satisfaction and Software Quality. In Proceedings of the 2nd International \nSymposium on Empirical Software Engineering and Measurement (ESEM 2008) 291-293. Kaiserslautern, Germany. \nACM. [3] Anantatmula, V. S. 2008. Role of Technology in the Project Manager Performance Model. Project \nManagement Journal, Vol. 39 Issue 1, pp. 34-48. [4] Ajzen, I. 1988. Attitudes, Personality, and Behavior. \nThe Dorsey Press, Chicago, Illinois. [5] Barrick, M. R., and M. K. Mount. 1991 The big five personality \ndimensions and job performance: A meta­analysis. Personnel Psychology. 44(1) pp. 1-26. [6] Barrick, M. \nR., and M. K. Mount, T. A. Judge. Personality and performance at the beginning of the new millennium: \nWhat do we know and where do we go next? International Journal of Selection Assessment, 9(1/2) pp. 9 \n30. 2001. [7] Basili, V., Shull, F., and Lanubile, F. 1999. Building Knowledge through Families of Experiments. \nIEEE Transactions on Software Engineering, 25(4), pp. 456-473. [8] Bass, B. M., and B. J. Avolio. Transformational \nLeadership Development: Manual for the Multifactor Leadership Questionnaire, Consulting Psychologists \nPress, Palo Alto, California. 1990. [9] Bass, B. M. 1985. Leadership and Performance beyond Expectations. \nFree Press, New York. [10] Bedingfield, J. D., and A. E. Thal, Jr. 2008. Project Manager Personality \nas a Factor for Success. In Proceedings of 2008 Portland International Conference on Management of Engineering \nand Technology: Technology and Innovation Management (PICMET 2008), pp. 1303 1314. [11] Costa, P. T., \nand R. R. McCrae. 1991. Facet scales for agreeableness and conscientiousness: A revision of the NEO personality \ninventory. Personality Individual Differences, 12(9) pp. 887 898. [12] Costa, P. T., and R. R. McCrae. \n1992. Revised NEO Personality Inventory (NEO PI-R) and NEO Five-Factor Inventory (NEO-FFI) Professional \nManual of Psychological Assessment Resources, Odessa, FL. [13] Curtis B. Fifteen Years of Psychology \nin Software Engineering: Individual Differences and Cognitive Science. ICSE 1984, 97-106. [14] DeMarco \nT, Lister T. 1999. Peopleware: productive projects and teams, 2nd edition. Dorset House, New York [15] \nDvir, D., A. Sadeh, and A. Malach-Pines. Projects and project managers: the relationship between project \nmanagers personality, project types, and project success. Project Management Journal, 37(5), pp. 36-48. \n2006. [16] Graziano, W. G., and N. H. Eisenberg. Agreeableness: A dimension of personality. R. Hogan, \nJ. Johnson, S. Briggs, eds. Handbook of Personality Psychology. Academic Press, San Diego, pp. 795-824. \n1997. [17] Hoc JM &#38; Nguyen-Xuan A. Language Semantics, Mental Models and Analogy. Psychology of Programming. \nJ.-M. Hoc, T. R. G. Green, R. Samurçay &#38; D. J. Gilmore, Eds. 1990b: London, Academic Press. 139-156. \n[18] Hoegl, M., and Gemuenden, H. G. (2001) Teamwork quality and the Success of Innovative Projects: \nA theoretical concept and empirical evidence, Organization Science, Vol. 12, No. 4, 435 449. [19] Hough, \nL. M., and A. Furnham. 2002. Importance and use of personality variables in work settings. W. C. Borman, \nD. R. Ilgen, R. J. Klimoski, eds. Comprehensive Handbook of Psychology, Vol. 12. Wiley, New York, pp. \n131 169. [20] John, O. P., S. Srivastava. 1999. The big five trait taxonomy: history, measurement, and \ntheoretical perspectives in Handbook of Personality: Theory and Research (2nd Ed). Ed. Lawrence A. Pervin, \nOliver P. John. The Guilford Press, New York. [21] Judge, T. A., C. A. Higgins, C. J. Thresen, M. R. \nBarrick. 1999. The big five personality traits and career success across the life span. Personnel Psychology. \n52(3) pp. 621-652. [22] MLQ: http://www.mlq.com.au. Available at 05/12/2008. [23] Moore, E. 1991. Personality \ncharacteristics of information systems professionals. In Proceedings of the 28th Annual ACM SIGMIS CPR \nConference. pp.140 155. [24] Shneiderman B. 1980. Software Psychology: Human Factors in Computer and \nInformation Systems. Winthrop Publishers. [25] Thite, M. 1999. Leadership: a critical success factor \nin IT project management. In Proceedings of Portland International Conference on Management of Engineering \nand Technology: Technology and Innovation Management (PICMET 1999), Vol. 2, 298 303. [26] Thoresen, \nJ., J. C. Bradley, P. D. Bliese, and J. D. Thoresen. 2004. The Big Five Personality Traits and individual \njob performance growth trajectories in maintenance and transitional job stages. Journal of Applied Psychology, \n89(5), pp. 835-853. [27] Turley R, and Bieman, J.1995. Competencies of exceptional and nonexceptional \nsoftware engineers. Journal of System and Software 28(1):19 38. [28] Wynekoop, J, and Walz, D. 2000. \nInvestigating traits of top performing software developers. Information Technology and People. Vol. 13, \nNo.3. pp. 186 195.   \n\t\t\t", "proc_id": "1639950", "abstract": "<p>The relationships between project managers' individual characteristics and the success of the projects do not receive enough attentions in the software engineering researches. However, as the core member of a software development team, the project manager's leadership level influences the development process in a great part. The existing literatures have shown the importance of individual's personality to his or her behaviors, which include the leadership behaviors certainly. Therefore, exploring how the project managers' personality influences the success of the software development projects has significant potential utility. In this paper, we present a research to integrate the Five Factor Model (FFM) for the personality with the existing work on the leaderships with the project success. Through the empirical study based on data from 116 real software projects, we found general support for our hypothesized research model. The results not only reveal that the five big personality factors can be treated as indicators for the success of the software development projects, but also provide the evidence on how the project managers' personality influences the success of the software development projects through medium effects of the leadership. The support for the relationship between leadership and the success of software development projects is also found.</p>", "authors": [{"name": "Yi Wang", "author_profile_id": "81435597157", "affiliation": "City University of Hong Kong, Hong Kong, Hong Kong", "person_id": "P1728320", "email_address": "", "orcid_id": ""}, {"name": "Fan Li", "author_profile_id": "81444599087", "affiliation": "Unilever China, Shanghai, China", "person_id": "P1728321", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1639950.1640049", "year": "2009", "article_id": "1640049", "conference": "OOPSLA", "title": "How does project managers' personality matter?: building the linkage between project managers' personality and the success of software development projects", "url": "http://dl.acm.org/citation.cfm?id=1640049"}