{"article_publication_date": "06-01-1990", "fulltext": "\n\t\t\t", "proc_id": "93542", "abstract": "<p>We present algorithms for accurately converting floating-point numbers to decimal representation. The key idea is to carry along with the computation an explicit representation of the required rounding accuracy.</p><p>We begin with the simpler problem of converting fixed-point fractions. A modification of the well-known algorithm for radix-conversion of fixed-point fractions by multiplication explicitly determines when to terminate the conversion process; a variable number of digits are produced. The algorithm has these properties:<list><item><p>No information is lost; the original fraction can be recovered from the output by rounding.</p></item><item><p>No &#8220;garbage digits&#8221; are produced.</p></item><item><p>The output is correctly rounded.</p></item><item><p>It is never necessary to propagate carries on rounding.</p></item></list></p><p>We then derive two algorithms for <italic>free-formal</italic> output of floating-point numbers. The first simply scales the given floating-point number to an appropriate fractional range and then applies the algorithm for fractions. This is quite fast and simple to code but has inaccuracies stemming from round-off errors and oversimplification. The second algorithm guarantees mathematical accuracy by using multiple-precision integer arithmetic and handling special cases. Both algorithms produce no more digits than necessary (intuitively, the &#8220;1.3 prints as 1.2999999&#8221; problem does not occur).</p><p>Finally, we modify the free-format conversion algorithm for use in <italic>fixed-format</italic> applications. Information may be lost if the fixed format provides too few digit positions, but the output is always correctly rounded. On the other hand, no &#8220;garbage digits&#8221; are ever produced, even if the fixed format specifies too many digit positions (intuitively, the &#8220;4/3 prints as 1.333333328366279602&#8221; problem does not occur).</p>", "authors": [{"name": "Guy L. Steele", "author_profile_id": "81100586340", "affiliation": "Thinking Machines Corporation, 245 First Street, Cambridge, Massachusetts", "person_id": "P100946", "email_address": "", "orcid_id": ""}, {"name": "Jon L. White", "author_profile_id": "81541749356", "affiliation": "Lucid, Inc., 707 Laurel Street, Menlo Park, California", "person_id": "PP39081029", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/93542.93559", "year": "1990", "article_id": "93559", "conference": "PLDI", "title": "How to print floating-point numbers accurately", "url": "http://dl.acm.org/citation.cfm?id=93559"}