{"article_publication_date": "06-01-1990", "fulltext": "\n\t\t\t", "proc_id": "93542", "abstract": "<p>The recognition of recurrence relations is important in several ways to the compilation of programs. Induction variables, the simplest form of recurrence, are pivotal in loop optimizations and dependence testing. Many recurrence relations, although expressed sequentially by the programmer, lend themselves to efficient vector or parallel computation. Despite the importance of recurrences, vectorizing and parallelizing compilers to date have recognized them only in an ad-hoc fashion. In this paper we put forth a systematic method for recognizing recurrence relations automatically. Our method has two parts. First, abstract interpretation [CC77, CC79] is used to construct a map that associates each variable assigned in a loop with a symbolic form (expression) of its value. Second, the elements of this map are matched with patterns that describe recurrence relations. The scheme is easily extensible by the addition of templates, and is able to recognize nested recurrences by the propagation of the closed forms of recurrences from inner loops. We present some applications of this method and a proof of its correctness.</p>", "authors": [{"name": "Zahira Ammarguellat", "author_profile_id": "81100525486", "affiliation": "Center For Supercomputing Research and Development, University of Illinois at Urbana-Champaign, Urbana Illinois", "person_id": "P309317", "email_address": "", "orcid_id": ""}, {"name": "W. L. Harrison", "author_profile_id": "81406595478", "affiliation": "Center For Supercomputing Research and Development, University of Illinois at Urbana-Champaign, Urbana Illinois", "person_id": "PP39072925", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/93542.93583", "year": "1990", "article_id": "93583", "conference": "PLDI", "title": "Automatic recognition of induction variables and recurrence relations by abstract interpretation", "url": "http://dl.acm.org/citation.cfm?id=93583"}