{"article_publication_date": "06-01-1990", "fulltext": "\n        Acknowledgements We would like to thank Fran Allen, Michael Burke, and other members of \nthe PTRAN group, past and present. We would like to acknowledge Larry Carter for several helpful technical \ndiscussions. We would like to thank Paul Havlak of Rice University for comments on an earlier version \nof this paper. References [ABC*87] Frances Allen, Michael Burke, Philippe Charles, Ron Cytron, and Jeanne \nFerrante. An overview of the ptran analysis system for multiprocessing. Proceedings of the 1987 International \nConfer-ence on Supercomputing, 1987. Also published in The Journal of Parallel and Distributed Com- puting, \nOct., 1988, Vol. 5, No. 5, pp. 617-640. [ABC*88] Frances Allen, Michael Burke, Ron Cytron, Jeanne Ferrante, \nWilson Hsieh, and Vivek Sarkar. A framework for determining useful parallelism. Proceedings of the ACM \n1988 In- ternational Conference on Supercomputing, 207-215, July 1988. [AWZ88] Bowen Alpern, Mark N. \nWegman, and F. Ken- neth Zadeck. Detecting equality of variables in programs. Fifteenth ACM Principles \nof Pro- gramming Languages Symposium, 1-11, January 1988. San Diego, CA. [BB891 William Baxter and J. \nR. Bauer, III. The pro- gram dependence graph in vectorization. Six-teenth ACM Principles of Programming \nLan-guages Symposium, 1 - 11., January 11-13 1989. Austin, Texas. [CF87] Ron Cytron and Jeanne Ferrante. \nWhat's in a name? or the value of renaming for parallelism detection and storage allocation. Proceedings \nof the 1987 International Conference on Parallel Processing, 19-27, August 1987. [CF89] Robert Cartwright \nand Mathias Felleisen. The semantics of program dependence. SIGPLAN '89 Conference on Programming Language \nDe- sign and Implementation, 13-27, June 1989. [CFR*89] Ron Cytron, Jeanne Ferrante, Barry K. Rosen, \nMark N. Wegman, and F. Kenneth Zadeck. An efficient method for computing static sin-gle assignment form. \nSixteenth Annual ACM Symposium on Principles of Programming Lan- guages, 25-35, January 1989. [CFS891 \nRon Cytron, Jeanne Ferrante, and Vivek Sarkar. Experiences using control dependence in ptran. Proceedings \nof the Second Workshop on Lan-guages and Compilers for Parallel Computing, August 1989. [CLZ86] Ron Cytron, \nAndy Lowry, and Ken Zadeck. Code motion of control structures in high-level languages. Conf. Rec. of \nthe ACM Syrup. on Principles of Compiler Construction, 1986. 351 [FOW87] [GS87a] [GS87b] [Har85] [HPR87] \n[Kuc78] [OBM90] [RWZ88] [Sel89] [SS78] [wz85] [Yel90] J. Ferrante, K. Ottenstein, and J. Warren. The \nprogram dependence graph and its use in opti- mization. ACM Transactions on Programming Languages and \nSystems, 319-349, July 1987. Rajiv Gupta and Mary Lou Sofia. A reconfig- urable liw architecture and \nits compiler. Proc. of the 1987 Int'l Conf. on Parallel Processing, Aug. 1987. Rajiv Gupta and Mary Lou \nSofia. Region scheduling. Proc. of the Second Interna- tional Conferenece on Supercomputing, 3:141-148, \nMay 1987. Dov Harel. A linear time algorithm for finding dominators in flow graphs and related problems. \nSymposium on Theory of Computing, May 1985. Susan Horwitz, Jan Prins, and Thomas Reps. Integrating non-interfering \nversions of programs. Conf. Rec. Fifteenth ACM Symposium on Prin- ciples of Programming Languages, 133-145, \nJan- uary 1987. David J. Kuck. The Structure of Computers and Computations. John Wiley and Sons, 1978. \nKarl J. Ottenstein, Robert A. Ballance, and Arthur B. Maccabe. Gated single-assignment form: dataflow \ninterpretation for imperative languages. ACM SIGPLAN Symposium on Programming Language Design and Implemen- \ntation, June 1990. Barry K. Rosen, Mark N. Wegman, and F. Ken- neth Zadeck. Global value numbers and \nredun- dant computations. Fifteenth ACM Principles of Programming Languages Symposium, 12-27, January \n1988. San Diego, CA. Rebecca Parsons Selke. A rewriting semantics for program dependence graphs. Sixteenth \nACM Principles of Programming Languages Sympo-sium, January 11-13 1989. Austin, Texas. J. T. Schwartz \nand M. Sharir. Tarjan's fast interval finding algorithm. Technical Report, Courant Institute, New York \nUniversity, 1978. SETL Newsletter Number 204. Mark Wegman and Ken Zadeck. Constant propagation with conditional \nbranches. Conf. Rec. Twelfth ACM Symposium on Principles of Programming Languages, 291-299, January 1985. \nDaniel Yellin. Representing sets with constant time equality testing. Proceedings of the First Annual \nACM-SIAM Symposium on Discrete Al- gorithms, 64-73, January 1990. \n\t\t\t", "proc_id": "93542", "abstract": "", "authors": [{"name": "Ron Cytron", "author_profile_id": "81100565597", "affiliation": "IBM Research Division, T. J. Watson Research Center, Yorktown Heights, NY", "person_id": "P248647", "email_address": "", "orcid_id": ""}, {"name": "Jeanne Ferrante", "author_profile_id": "81100357275", "affiliation": "IBM Research Division, T. J. Watson Research Center, Yorktown Heights, NY", "person_id": "P137070", "email_address": "", "orcid_id": ""}, {"name": "V. Sarkar", "author_profile_id": "81100597290", "affiliation": "IBM Research Division, T. J. Watson Research Center, Yorktown Heights, NY", "person_id": "PP39078354", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/93542.93592", "year": "1990", "article_id": "93592", "conference": "PLDI", "title": "Compact representations for control dependence", "url": "http://dl.acm.org/citation.cfm?id=93592"}