{"article_publication_date": "10-01-1994", "fulltext": "\n The Standards are Coming! Standards for Security in Object-Oriented Systems Workshop Co-Chairs: William \nR. Herndon The MITRE Corporation Ravi Sandhu George Mason University Steve Demurjian University of Connecticut \n Introduction Over the last 15 years object-oriented (00) systems have become increasingly popular. \nSystems built on the object-oriented paradigm have powerful representational capabilities due to their \ninherent ability to represent conceptual entities as objects. This power of representation has been applied \nto the development of many types of applications; multimedia information processing systems, artificial \nintelligence systems, CAD/CAM systems, process control systems, and CASE systems are all familiar examples. \nIn addition, database management systems and distributed object management systems have become popular \nin recent years, with many vendors offering products. The increasing popularity of object-oriented systems \nhas also heightened the need for 00 systems that operate securely. Secure operation can be important \nfor many types of applications, and the security services required can be of many different kinds. Common \ntypes of security services include: Access control, which is designed to protect the contents of objects \nfrom unauthor- ized disclosure or modification; Identification and authenfication of users; Auditing \nof important, or otherwise security relevant, system operations; Administrution of secure 00 systems, \nwhich can include maintenance, tuning, and updating of security policies; and finally secure communication \nfor distributed object systems (DOSS). In addition, access control policies can take on a number of forms. \nMandatory access control policies (MAC) are based on a fixed rules, an example of which is the DOD hierarchical \npolicy for protecting information; Discretionary access control (DAC) policies, on the other hand, grant \nor deny access based on any number of user-defined attributes, roles, or characteristics. To address \nthe needs of security in 00 systems, research has been ongoing for the last 6 years. Many papers in the \nliterature address security, and a few research prototypes that incorporate security have been developed. \nStandards bodies, however, have only recently begun to address security issues for 00 systems. In fact, \nthe Object Management Group (OMG) recently made available a white paper addressing security within the \nCommon Object Request Broker Architecture (CORBA). This white paper was the precursor to the OMG s Request \nfor Proposals 3 (RFP3), released in the summer of 1994, which addresses security and time services for \nthe Object Management Architecture (OMA). 1.1 The Workshop The intent of this years workshop was to bring \ntogether researchers and practitioners from both the security and object-oriented communities to discuss \nthe content of upcoming standards. Six important standards related issues were considered in the workshop \ns submissions and discussions. These were: 1) What is the correct balance of security services to place \nin the standards in order to support contemporary 00 applications? 2) What role should class libraries//hierarchies \nfor security servers play in the definition of standards? 3) What level of functionality should such \nservers provide? 4) What is the best allocation of services among the components of an CORBA-like architecture? \n5) How can standard s evolution best be addressed if 00 systems continue their own rapid evolution? 6) \nWhat is the effect on security standards as 00 systems continue to cross traditional OS, programming, \nand database management system boundaries. Five papers were submitted to the workshop organizers, and \nfour of these were presented at the half-day meeting on Sunday, October 23rd, 1994. The papers covered \na diverse set of topics and were divided into two presentation groups. The first group were more theoretical \npapers that addressed authorization schemes and security principles as applied to 00 systems. The second \ngroup consisted of more practical papers that dealt mostly with how to use existing mechanisms such as \nthe Trusted HETerogeneous Architecture (THETA), the OSF s Distributed Computing Environment (DCE), and \nthe Generic Security Services Application Program Interface (GSS-API), to enhance security in distributed \nobject systems. In addition to the paper presentations, Ken McCoy of Tandem, a member of the OMG s Security \nWorking Group (SWG), gave an invited presentation covering the mission of OMG, its organization, the \ncontent of OMG s RFP3, and the standard s adoption process. Questions posed to presenters, and the discussions \nthat often followed, were as diverse as the papers themselves, and included topics ranging from how the \nOMG actually adopts technology to considerations of very non-traditional security requirements.  1.2 \nThe Participants Terry B enzel Trusted Information Systems Bret Hartman Odessey Research Associates \nBob Fraley Hewlett Packard William Herndon The MITRE Corporation Ken McCoy Tandem Pat Mueller IBM Vincent \nNicomette LAAS-CNRS Rita Pascale Odessey Research Associates Ravi Sandhu George Mason University T.C. \nTing University of Connecticut Dean Tribble Agorics   2 Presentation Summaries The workshop began with \nan overview of the Object Management Architecture, given by William Herndon The overview covered the \nmajor components of the architecture, as well as the different strategies for building ORBS. Then, as \na precursor to later discussions, William outlined some of the major issues that should be addressed \nas part of the standard s definition process, These issues include: . How to provide solutions that are \nflexible in terms of both policy and mechanisms . Portability of solutions . Policy/Mechanism independence \n. Multi-Policy support . Interoperability William concluded his presentation with a short summary of \nassurance and policy questions, as they relate to the three dominant ORB architecture types. The second \npresentation was Ken McCoy s invited talk entitled, Security in an OMG Standardized Distributed Object \nSystem. The primary purpose of Ken s presentation was to inform the workshop participants about how the \nOMG standard s adoption process works, and specifically how security standards will be adopted. Ken s \ntalk covered of three main topics: 1) The organization of the OMG, its task forces, special interest \ngroups, and working groups; 2) How the OMG prepares to, reviews, and then adopts technology in key areas, \nincluding an overview of OMG s request for information and request for proposal processes; 3) The content \nand requirements laid out in the OMG s RFP3 and its companion document the OMG White Paper on Security. \nNumerous questions were asked in response to Ken s presentation. Most participants were interested in \nthe current make-up of OMG and the requirements for membership. Additional questions were asked about \nthe OMG s Security Working Group, including how the group operates, it s charter, and how it will go \nabout evaluating vendor responses to RFP3. After Ken s presentation, Vincent Nicomette of LAAS-CNRS presented \nhis paper entitled An Authorization Scheme For Distributed Object Systems. Vincent s paper focused on \nhow authorization should be viewed in distributed object systems, as opposed to how it is viewed in classical \ncentralized operating systems. Two important aspects were considered. First, that authorization takes \nplace at a number of levels in a distributed object system (global, multi-system authorization in addition \nto local system authorization). Second, that processing may take place in objects that are specifically \ncreated for a given purpose and which may require authorization in order to get the job done, but which \nare not persistent and which may not be known to the system. The paper then outlines, through a number \nof examples, the authorizations necessary to handle both persistent and transient objects in a reasonable \nmanner. Two major questions were raised in response to Vincent s presentation. First, one participant \nwanted to know how this authorization scheme would handle object naming problems, and how (or if) authorization \ntables could be reduced, given that large numbers of transient objects would need to have their authorizations \nencoded. Second, since the object characteristics (credentials) that were noted in Vincent s paper were \nuser-id based, a number of participants asked about alternate types of credentials. In fact, alternate \n(and somewhat novel) types of credentials became a recurring discussion topic throughout the day. After \na short break, the meeting continued with Object-Oriented Security Bused on DCE Security Model presented \nby Bob Fraley of Hewlett-Packard. This paper contained information on ODCE an object-oriented, C++ based \ninterface from Hewlett- Packard that makes DCE more accessible. In addition, the paper discussed ODCE \ns authorization component (based on access control lists (ACLs)) and how ACLs can be used to enforce \nauthorization through the use of proxy objects. Participants were interested in having Bob expand on \nthe advantages (or shortcomings) of using ACLs, which Bob did by briefly discussing the types of permissions \navailable in the ACLs and how they could be interpreted to provide greater functionality. Bob also reiterated \none point from his paper, that DCE falls short of the requirements set by OMG for security within the \nOMA, but that DCE could be part of a more comprehensive solution. A second issue raised in repines to \nBob s presentation had to do with the user s view of how the security functionality of a DOS would be \nutilized. William Herndon noted that most proposals that he d seen assumed that a TCB would make access \ncontrol decisions that were then passed to an application object for enforcement, and that this introduced \nmultiple security vulnerabilities into the system. Bret Hartman agreed, but pointed out that such effects \ncould be reduced by doing automated, systematic, generation of the application code that interprets and \nenforces access control decisions. Bret also pointed out, that such a methodology would enhance user \nflexibility by placing the burden of semantics interpretation in applications. William then observed \nthat high-assurance might be difficult to obtain under such a system. The fifth presentation was entitled \nProviding Support for High-Assurance Secure Distributed Systems, and was presented by Bret Hartman of \nOdyssey Research Associates. The paper, co-authored with Rita Pascale, gave an overview of THETA and \nhow THETA might be utilized to implement a secure Object Request Broker (ORB). In addition to covering \nthe essential aspects of THETA, the paper discussed some of the implications for providing high-assurance \nORBS that still maintain some level of interoperability. Bret noted in his presentation, that the problem \nof interoperability with security is even more tricky because of the flexibility inherent in the Common \nObject Request Broker standard. Finally, Patrick Mueller of IBM presented a paper entitled Use of the \nGSS-API Within CORBA, which described how the General Security Services Application Program Interface \ncould be used to provide authentication services as well a data integrity through its encryption and \nverification interfaces. Patrick s paper also discussed some of the implications of network transport \non the design of a secure OMA compliant system. The meeting concluded with a continuation of the discussion \nof novel types of security credentials and how these might affect access rights. In addition, Dean Tribble \nof Agorics pointed out that a number of non-traditional object characteristics might be good candidates \nfor inclusion in an object s security context. One example that he gave was an object s current resource \nallocation. Another issue raised in the final discussion was how to provide more privacy within a distributed \nobject system. It was noted that when systems interoperate, large amounts of security context information \nwill be shared and passed between the systems, and that this might constitute a security violation of \nthe policies of some organizations. Summary Although many interesting topics relating to security for \ndistributed object systems were discussed in this year s workshop, and many issues explored, agreement \non the best and most flexible way to provide security for such systems, was not forthcoming. Perhaps \none of the most interesting outcomes of the workshop was the observation that the expectations of end-users \nabout how security will be provided and utilized within a DOS is very different from traditional notions \nof how secure systems operate. Security practitioners expect a more centralized access control component \nto be provided, and in fact see some distinct advantages in the object paradigm for doing enforcement. \nVendors, on the other hand, responding to their end-user s expectations, see a more decentralized system \nthat provides added flexibility without trying to solve the difficult problem of supporting general system \ninteroperability at the level of a secure ORB. Much work in this area remains to be done in order to \nprovide robust, flexible, and yet still assurable, secure distributed object systems. Hopefully organizations \nlike OMG will be able to make additional progress as the standards definition process begins to consider \nsecurity for DOSS. 4 Contact Information William R. Herndon The MITRE Corporation 7525 Colshire Drive, \nMcLean, VA 22102 wherndon @ mitre.org Dr. Steven A. Demurjian Computer Science and Engineering Dept. \nUniversity of Connecticut Box U-155, 260 Glenbrook Rd. Storm, CT 06269-3 155 steve@brc.uconn.edu Dr. \nRavi Sandhu ISSE Department George Mason University Fairfax, VA 22030-4444 sandhu@isse.gmu.edu  \n\t\t\t", "proc_id": "260028", "abstract": "", "authors": [{"name": "William R. Herndon", "author_profile_id": "81539135156", "affiliation": "The MITRE Corporation, 7525 Colshire Drive, McLean, VA", "person_id": "PP311296200", "email_address": "", "orcid_id": ""}, {"name": "Ravi Sandhu", "author_profile_id": "81312485832", "affiliation": "ISSE Department, George Mason University, Fairfax, VA", "person_id": "PP39078286", "email_address": "", "orcid_id": ""}, {"name": "Steve Demurjian", "author_profile_id": "81100608701", "affiliation": "Computer Science and Engineering Dept., University of Connecticut, Box U-155, 260 Glenbrook Rd., Storrs, CT", "person_id": "P269184", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260028.260131", "year": "1994", "article_id": "260131", "conference": "OOPSLA", "title": "The standards are coming! Standards for security in object-oriented systems", "url": "http://dl.acm.org/citation.cfm?id=260131"}