{"article_publication_date": "10-01-1994", "fulltext": "\n Object-Oriented Real-Time Systems Analysis and Design Issues Workshop Co-Chairs Mohamed E. Fayad Milton \nL. Fulghum Object-Engineering Technologies International &#38; FlightSafety International, Inc University \nof Minnesota Wei-Tek Tsai University of Minnesota 1. Primary Workshop Themes The primary theme of this \nworkshop was object-ori- ented real-time systems analysis and design issues. Our goal was to define a \nset of crucial issues related to object- oriented real-time systems and reach a consensus on how these \nissues can best be resolved. This workshop did not address implementation language issues. 2. Activities \nThe agenda for this workshop was designed to divide the workshop participants into three groups for workshop \nactivities. Each group met during the morning session to debate their issues and presented their findings \nin the af- ternoon session. Group 1: What selection criteria are important when se- lecting an object-oriented \ndevelopment technique for real-time analysis and design? What problem domain situations can have a significant \nimpact on the selection? Group 2: Some object-riented techniques, i.e, Booth, Jacobson, Rumbaugh, claim \nto support real-time pro-gramming. How well do they really support real-time analysis and design ? What \nare they missing? Are the tools adequate? Group 3: What should we expect the impact to be on object-oriented \nreal-time systems from patterns and other domain-level object templates? Generic applica- tions? User \nconfigurable object-oriented kernels?  3. Workshop Findings: 3.1. Evaluation Criteria (Tom Karpinski, \nKyung Ook Lee, ILan Mahalal, Alice Schafer) Our goal as an investigation group in this area was not to \nmake a check list of hundreds of items but to identify the high level capabilities that a real-time object-oriented \nanalysis and design technique should provide. We are well aware that no current methodology provides \nvery much of what we have identified. Nevertheless, we felt it was our task to define meaningful selection \ncriteria re- gardless of whether they are currently available. These guidelines should provide direction \nfor the developers of real-time object-oriented design and analysis systems as well as for developers \nof real-time systems. The assumption was made that the analysis and design methodology was fully object-oriented \n(O-O) and therefore we did not specify criteria to ensure the O-O component. We focused on the capabilities \nneeded to specify, analyze, and design real-time features. We broke our criteria into three categories: \n1) important overall issues that need to be expressible and manipulatable as early as the specification \nphase, 2) criteria for the analysis and design phase, and . 3) capabilities that the technique should \nprovide for veri- fication of the specification, analysis and design The following is the result of our \ndeliberations, aug-mented by comments from group members and from the whole workshop.  Important Issues \nFor Specification: * Real-time Constraints, Periodic/aperiodic, and Hard/ soft * Fault Tolerance Requirements \n * Correctness Criteria and Acceptable Fluctuations * Criticality of Functions  Criteria For Analysis \n&#38; Design: * Express Concurrency/Extract Concurrency (Concur-rency Dependencies) * Object Communication \nModel e.g., point to point, broadcast, synchronous vs. asynchronous, attach real- time constraints * \nExpress Real-time Constraints for Behavior -individual -end to end (threads, scenarios)  * Event Modeling \n * Exception Handling * Resource Management and Scheduling * Synchronization  Verification Of Analysis \nAnd Design * Early Simulation, Performance Analysis, and Notitl- cation of Inconsistencies in Specification \n -Concurrency -Events -Real-time Constraints  * Traceability * Real-time Verification  3.2. Object-Oriented \nTechniques (Ray Buhr, Bran Selic, Maher Awad, D. Firesmith, &#38; others) The fundamental issues in real-time \nsystems (hard and soft) are the view of the processes (critical, essential, and nonessential), the means \nof communication, and the method of synchronization. Some object-oriented techniques, such as Booth, \nCoad- Yourdon, Fayad, Jacobson, Rumbaugh, Shlaer-Mellor, claim to support real-time system (RTS) development \nand others claim specialization in RTS development, such as, Berard, Colbert, Fayad, Firesmith, and Selic- \nWard s ROOM. Some may provide a useful means of process identification and lack strong semantics for \ncommunication and synchronization. Others may pro- vide an explicit means for communication protocol \nand process identification and lack a means for synchroniza- tion. There is no doubt that most 00 techniques \nhave means for dealing with one or more of these fundamental issues with various degree of clarity. To \nadapt these tech- niques to RTS developments, an extension of the tech- nique is a must in most cases. \nAdaptation examples are RT-OMT, OMT++, and OCTOPUS. The goal of our group is to examine and evaluate \nsome of the 00 techniques against the above criteria. To debate our point we created the following framework: \n* Created a list of methods that are appropriate for real- time system developments. * Short discussion \non each method emphasizing RT is- sues. * Warn community of need for RT language support.   OCTOPUS \n(Maher Awad) * Based on OMTLFusion * Three level system architecture in subsystems * State chart/subsystem \n * Group objects into object groups * Mechanical mapping of objects to processes * Real-time issues \nhandled by Real-Time OS  Scenario Maps (Ray Buhr) * Supplementary method for very high level design \nwith three big ideas: + Separate concerns or separate object from role played + Use time threads for \nscenario maps + Path Segments = processes   ROOM (Bran Selic) * Automate what can be automated * \nDomain focus on RT, large, event-oriented, and dis- tributed systems * Design reuse and product supported \nby tools * Automate analysis, design, and implementation  phases where: development processes = series \nof models. Portland, OR October 23-27,1994 ADM (Don Firesmith) * Scope: large, complex, distributed, \nand real-time sys-tem * Contains a large number of dynamic and RT models  3.3. Alternatives (John W. \nGilbert, Tuomas Ihme, Bob Wilhelm, Neil Thomson, Cliff An-dreas) Discussion -Focused on Patterns &#38; \nArchitectures * What patterns are applicable to real-time * What needs to be added to patterns/framework \n&#38; re- use to ensure they are understood in terms of real-time impact. * How to work in new approaches \nfor existing patterns. * Bob Wilhelm  Two kinds of state information Discreet time events -modeled \nby state machines. Continuous state system -infinite possible values constantly changeable over time \n-non-discreet. -DSP applications -looks more like an analog process -an in- tegrating op-amp. Can still \ntalk with state diagrams, but the transformations are continuous. Typically done though polling to get \nrate of change and other time based information from continuous information. Paper looks to a model of \nreal-time states that include both types This essentially presents each of these types of state rep- \nresentations as patterns and how to integrate them into a single pattern. * momas Ihme Re-engineering \na real-time system through scenarios/ use cases and discovery of objects and interactions through the \nscenarios and object identification mecha-nisms. Uses time threads as a means of showing real-time sce-narios \nat multiple levels of transactions. Shows time-threads and time budgets with each one as a means of including \nreal-time constraints into multiple levels of abstraction of analysis &#38; design. For a given pattern \nthis is a good means to show how a framework or architecture or pattern performs a certain scenario and \ncan give a budget, How do you populate frameworks, patterns, etc., with information that allows you \nto make constraint trade-offs? Requirements are an issue because they frequently don t detail the constraints \nthat will actually need to be met.  4. Further Discussion * Look for relative comparison. * Look for \nearly warning of the characteristics of the sys- tem. * What are some real-time patterns &#38; frameworks? \n * Alarms * Event Notification * Event * State machines * Resource Control &#38; Allocation (concurrency) \n * Session * Control Loops * What RT characteristics do you need to capture those patterns &#38; frameworks? \n * Relative real-time cost * Number of messages to complete a transaction * Number of objects * ?ime \ncost in terms of method calls to perform a transac- tion * Set-up time   5. Final Thoughts: 1. Submit \na Workshop Report to the Communications of ACM to report the result of three years of debate anddis- \ncussions on the topic. We are working on this report right now. 2. Let us do this again next year. Mohamed \nFayad volun- teered to take the lead in this activity.   6. Contact Information Dr. Mohamed E. Fayad \nP.O. Box411192 St. Louis, MO 63141 75OO0.1003@compuserve.com Milton L. Fulghum FlightSafety International \n2590 North Highway 94 Saint Charles, MO 63301-0037 (3 14) 925-8576, (3 14) 925-8444 FAX Email: fulghum@vss.fsi.com \n 7. Workshop Participants: Maher Mohammad Ali Awad Nokia Research Center awad@research.nokia.com Don \nFiresmith ASTS 73664.35 15 @comuserve.com Alice Schafer The MITRE Corporation als@mitre.org John W. Gilbert \nObjective Control gilbert@acm.org Neil Thomson BNR neilt@bnr.ca Cliff Andreas McDonnell Douglas Aerospace \nandreas@fltsim.mdc.com or CCAndreas.aol.com Etsuo Saito Systems &#38; Software Engineering, Toshiba Corporation \nsaito@ssel.toshiba.co.jp Eric Jul DIKU, University of Copenhagen eric@diku.dkq  Bran Selic ObjecIime \nLimited bran@objectime.on.ca ILan Mahalal Schlumberger, SMR Research Center mahalal@smr.slb.com R.J.A. \nBuhr Systems and Computer Engineering, Carleton University buhr@sce.carleton.ca Ramesh Achuthan Computer \nScience, Concordia University amesh@cs.concordia.ca Bob Wilhelm Objective Control 70606.1147@compuserve.com \nor rwilhelm@acm.org Ross MacLeod Bell Northern Research Ltd. macleod@ bnrca Tuomas Ihme VTT Electronics \nTuomas.Ihme@vtt.tl Bhavani Thuraisingham The MITRE Corporation Bhavti-Thuraisingham@star9gate.mitre.org \n Greg Keyes Eastman Kodak Co. keyes@clpd.kodak.com Vincent Nicomette LAAS-CNRS nicomett@laas.fr Tom \nKarpinski Eastman Kodak Co. karpinski@clpd.kodak.com Kyung Ook Lee Univ.of Texas at Arlington klee@cse.uta.edu \n  8. References Mohamed E. Fayad et. al., An Evaluation of Object-Ori- ented Technology in Real-Time \nSystems: Past, Present, and Future, The Proceedings of OOPSLA 92 Workshop #13, Vancouver B.C., 1992 Mohamed \nE. Fayad et. al., Object-Oriented Real-Time Systems Analysis &#38; Design Issues, The Proceedings of \nOOPSLA 93 Workshop #I, Washington D.C., 1993 Mohamed E. Fayad et. al., Object-Oriented Real-Time Systems \nAnalysis &#38; Design Issues, The Proceedings of OOPSLA 94 Workshop #4, Portland, 1994 \n\t\t\t", "proc_id": "260028", "abstract": "", "authors": [{"name": "Mohamed E. Fayad", "author_profile_id": "81339498936", "affiliation": "Object-Engineering Technologies International, University of Minnesota, P.O. Box 411192, St. Louis, MO", "person_id": "PP31077522", "email_address": "", "orcid_id": ""}, {"name": "Milton L. Fulghum", "author_profile_id": "81100528270", "affiliation": "FlightSafety International, 2590 North Highway 94, Saint Charles, MO", "person_id": "P201077", "email_address": "", "orcid_id": ""}, {"name": "Wei-Tek Tsai", "author_profile_id": "81452595244", "affiliation": "University of Minnesota", "person_id": "PP40036766", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260028.260148", "year": "1994", "article_id": "260148", "conference": "OOPSLA", "title": "Object-oriented real-time systems analysis and design issues", "url": "http://dl.acm.org/citation.cfm?id=260148"}