{"article_publication_date": "10-17-2010", "fulltext": "\n Better Science Through Art Richard P. Gabriel Kevin J. Sullivan IBM Research rpg kjs University of Virginia \n } 1 { Hawthorne, New York USA Charlottesville, Virginia USA rpg@{us.ibm.com sullivan.kevinj@gmail.com \ndreamsongs.com Abstract How do artists and scientists work? The same. Categories and Subject Descriptors \nA.0 [General] General Terms Design Keywords Design, art, science, software engineering t Prefrontal \nlightningbolt too lazy to chew the sphinx s loudest eyelash Not even if it shushes you with a mast of \nsneers Down which grateful bankvault-doors scamper Because of a doublejointedness that glows in the dark \nLike a soliloquy of walnuts Numbed by beaks of headless measuringtape So the lubriciousness can tower \nin peace Like a buzzsaw trapped in a perfumery of shrugs Lemon Or lime Only a maze can remember your \nhair of buttered blowguns From Nights of Naomi by Bill Knott [1] t Art is strange. Art cannot be understood. \nThe poet Rob­ert Browning is reported to have said of a passage he wrote: When I wrote that, God and \nI knew what it meant, but now God alone knows. Science and art don t seem directly related. Except people \ndo science. And people do art. Science is a clear statement of truth in the actual world. Behold the \nsimplicity of science: N JJ (1 J AN = Dµ D[X]exp - .zXµ(z, z).zXµ(z, z)dz2 + i kiµXµ(zi,zi) 4pa i=1 G(-1+ \n1 (k1 + k2)2)G(-1+ 1 (k2 + k3)2) G(-2+ 1 ((k1 + k2)2 +(k2 + k3)2)) A4 = 22 2 Permission to make digital \nor hard copies of all or part of this work for personal or classroom use is granted without fee provided \nthat copies are not made or distrib­uted for profit or commercial advantage and that copies bear this \nnotice and the full citation on the first page. To copy otherwise, or republish, to post on servers or \nto redistribute to lists, requires prior specific permission and/or a fee. Onward! 2010 October 17 21, \n2010, Reno/Tahoe, Nevada, USA. Copyright &#38;#169; 2010 ACM 978-1-4503-0236-4/10/10 $10.00.  This is \na sort of contemporary science which is more easily understood than the nonsensical poem. Don t you think? \nAh, but with training this is quite easily understood. The poem, however obviously no amount of training, \nteaching, or learning will bring you to understand it. Some other examples: a visual representation of \na source code svn log shows, clearly, the history of the program, where­as the Jackson Pollock painting \nis clearly less understandable Some mathematicians have computed the fractal dimen­sion of some of Pollock \ns drip paintings as high as 1.72 thickly layered and complex.   Other representations of source code \nare more prosaic, and tell the story of a human mind at work using human hands and sometimes we wonder \nwhether writing code out by hand would help a programmer better understand what he or she is doing. Some \nhuman designs seem a bit sloppy, or even pieced together, but still we can see the human mind at work \neven through the mess and erasures. The work below by Sanda Illescu is based on a recursive writing / \nerasing / rewriting process in which a poem by Wal­lace Stevens is written, erased, and then the same \npoem with one fewer line is written again; the process halts when only one line the first line remains. \nA surrounding recursion produces a total of 24 pieces like this where the first is the most heavily written \nand erased and the last is the least. This is the 13th in the sequence. kjs, working with Sanda, captured \nthe formal structure of her process as a Java program. Around this formal structure, however, Sanda engaged \nin a non-deterministic, human pro­cess of noticing and responding to the situation in ways that are human \nand resistant to easy expression in algorithmic void Step1() { selectDrawing(firstDrawing); if (isNewDrawing(firstDrawing)) \n writePoem(firstDrawing); else rewriteLessPoem(firstDrawing); if (!oneLineLeft(firstDrawing)) Step2(firstDrawing); \n} void Step2(int currentDrawing) { selectDrawing(++currentDrawing); if (isNewDrawing(currentDrawing)) \n{ writePoem(currentDrawing);  Step1(); } else { rewriteLessPoem(currentDrawing); Step2(currentDrawing); \n } }  form finding a new interpretation of the poem through re­peated reading and writing; seeing and \nthen responding to imperfections in the paper. Art is, in part, the practice of intense and disciplined \nnotic­ing of details, of life, of how the world works and in that way at least it resembles science. \nMany artists use processes or formal techniques to increase the opportunities for noticing artists don \nt simply visit their cafés every day, do their laundry, and put their (very interest­ing) cats in their \nart. Some of those techniques include types of sampling, stochastic or otherwise. t For many, science \nappears in caricature science is a pro­cess and a way of thinking; individuals practice that process \nand way of thinking to perfection, the result being a steady progression of increased and perfected knowledge \nover the millennia the forward march of science. In this carica­ture, scientists create knowledge  \nstudy the world as it is  are trained in the scientific method  use explicit knowledge  are thinkers \n In fact, this is not the case. Not only is it not clear what science really is and how it s practiced, \nbut in terms of purely being right, science is one of the most failure-prone of disci­plines, with theories \nbeing overturned and subsumed all the time. Aristotelian science overturned by Newton subsumed by Einstein, \nPtolemy overturned by Copernicus, Lamarck1 by Darwin. And on and on.  Along with that caricature is \na companion for engineering. Engineering, it s thought, is only the application of science, and with \nthat is a belief perhaps not deeply held but at least a first approximation that science always precedes \nengineer­ing, and that without science there could be no engineering. Important in thinking about art, \nscience, and engineering are the ideas of explicit and tacit knowledge. Explicit knowledge is something \nthat can be written down and is thereby fully and accurately transmitted. Here is an example: Los Angeles \nis east of Reno. For some this is be new information, and perhaps it re­quires some verification, but \nonce you have read, understood, and believed this sentence, you know it as well as anyone. Tacit knowledge \ndepends on practice and, to an extent, skill. Knowing how to design, for example, requires tacit knowledge. \nArtists are thought to use an educated sense of aesthetics to work effectively. Artists typically have \na highly trained skill or talent, such as the ability to draw, paint, sculpt, write, or compose music. \nIn this caricature, artists create artifacts  study the world as it appears  are trained in a creational \nskill  use aesthetics and tacit knowledge  are doers or expressers  1Lamarck turns out not to be so \noverturned as we thought c.f. epigenetics. When viewed according to these caricatures, art, engi­neering, \nand science appear to be very different disciplines requiring different abilities, skills, likes, desires, \nand motives. t Science is a complicated beast. People who study how sci­ence works cannot agree on what \nthey see. What follows is a quick tour of the landscape, each the view of a respected philosopher of \nscience. Demarcation problem: the study of what science is focuses on the question of what separates \nscientific ideas, statements, and theories from pseudoscience or voodoo, if you will. This is called \nthe demarcation problem. Further, the demarcation problem includes finding out how science determines \nwhether one theory is better than another, thereby invoking a scientific revolution in the Kuhnian sense \n[7]. Positivism has been the dominant theory of science for many centuries, and particularly so in the \n20th and 21st cen­turies. In fact, some consider it the current received theory.2 Positivism is the view \nthat serious scientific inquiry should not search for ultimate causes deriving from some outside source \nbut must confine itself to the study of relations exist­ing between facts which are directly accessible \nto observation [8]. It rejects any appeal to metaphysics. Positivism states that we understand the world \nby looking at it that reality is real, and that our sense perceptions are valid. This holds even when \nour perception is through mechanisms we create, such as scientific instruments. Logical positivism adds \nthe idea that rational or logical conclusions from observations and other scientific knowledge are also \nvalid statements about the world. Elitist authoritarianism: science proceeds by scientific publication. \nWhat counts as science is what s published in those conferences and journals that are labeled scientific. \nSuch publication is based on the opinions of a jury of peers peer review. Such juries are not elected \nor randomly selected but are chosen by program chairs and editors in chief, and so represent a kind of \nscientific in group, an inner circle. Inductivism tackles the problem of how to establish uni­versal \nstatements given a finite and limited set of observations. It permits many similar observations to add \nup to a general statement about the universe. Inductivism is how we come to believe that a series of \nobservations on or near Earth lead to valid scientific theories about the other side of the galaxy, other \ngalaxies, and in fact, the other side of the universe. Inductivism is based on two difficult requirements; \nfirst, that it is possible to bridge the gap from facts to factual prop­ositions, and second, that it \ns possible to go from a finite set of observations to a universal law. It would be a statement of metaphysics \nto claim that our neighborhood of the universe 2Some form of positivism has been a recurrent theme since \nthe early Greeks until today. is special, with laws that enable the existence of cognitive be­ings, \nfor example. But to claim that our neighborhood is not special is science, according to inductivism. \nThese two requirements are impossible according to phi­losophers from previous centuries, and their reasoning \nis interesting wrt our exploration of what science is. The first requirement falters because a person \nis needed as the bridge between facts and propositions to judge what is relevant and what isn t, and \naesthetics can intervene. The second requirement suffers an interesting critique as well. Aristotelian \nlogic is about syllogisms, and for centuries it was considered the only valid form of logic, and especially \nof deduction. In the 17th century when science as we know it was born scientists noticed that all the \ninteresting logical derivations used some non-Aristotelian method of inference. Many of these derivations \nwere relational, such as if B and C are between A and O, and G is between B and C, then G is between \nA and O. Because Aristotle and his ideas about logic were held in such high regard, this led scientists \nto con­clude that the validity of a logical inference depended on the scientist s intuition, which meant \nlogic was a psychological question. In fact, many scientists believed that an inference was valid exactly \nwhen a sane person felt it was valid. More­over, with so many types of inference being possible, it turned \nout that there was reason to believe in content-increasing in­ferences, and hence inductivism was born, \nand as we ll see, content-increasing inferences are at the heart of doing science. Probabilism is a brand \nof inductivism. Scientific state­ments are ones that can be shown to be probable, and one theory is better \nthan another if it is more probable. Voodoo is not scientific because its probability is low or because \nother theories are more probable. The size of the universe and the small sample we have of it naturally \nmean that the probabilities behind our theories if they would ever be actually computed are small. Conventionalism \nducks the whole question of what s true in order to get at what s useful. In a sense, conventionalism \ntakes engineering more seriously than it does truth, and posits that science is about coming up with \nmechanisms that make engineering calculations easy and perhaps elegant. Con­ventionalism is one of the \noldest takes on science. The very first theory was Ptolemy s system of spheres within spheres, which \nenabled him to predict very accurately the movement of planets and other heavenly bodies against earth \ns night sky. All this while maintaining that the earth was (or could be) at the center of the universe. \nCopernicus came along with a more accurate and simpler theory, but he failed to realize that he could \nprotect himself against the anger of the Church by explaining that of course the views implied by his \ntheory weren t true contrary as they seemed to be to the Bible but his theory was merely a way to simplify \nastronomical (and astrological) calculations. Even in the 20th century, many if not most physicists viewed \nquantum mechanics as a good predictive theory and not necessarily a statement about what is true in the \nuniverse. Falsifiability is considered by many to the be primary characteristic of a scientific statement. \nIf a statement can be falsified, it is scientific. Because an experiment can be an ob­servation, there \nare many statements that are scientific that we might not think of that way. 2 + 2 = 3 is a scientific \nstatement that happens to be false (by observation and elementary-school arithmetic). This sentence no \nverb is similarly scientific, and true. More importantly, there are two questions that make things problematic. \nThe first is that if you need to construct an instrument as part of an experiment to verify a statement, \nand that instrument and understanding of what it measures depend on the theory being tested, then why \nshould we be­lieve that the instrument is capable of falsifying the theory? There needs to be a separate \ntheory of how the instrument works and what it measures but this can be a convention­alist theory in \npractice. The other is that if a theory is well-established and an ex­periment falsifies the theory, \nhow seriously should we take the refutation? In some cases the experimental data is thrown out. If it \npersists, usually the theory is patched to account for the discrepancy. And sometimes a deep analysis \nis undertaken to determine whether some variables are disturbing the re­sults (the ceteris paribus or \nall things being equal situation). Imre Lakatos tried to reconcile Popper s rational falsifi­cationism \nwith Thomas Kuhn s historical view of science in his take on research programmes. Research Programmes: \nLakatos claimed that science was performed in the form of a research programme in which a hard core of \nthe theory was protected from direct patching by a cocoon of auxiliary hypotheses that could be modified \nto handle experimental discrepancies. Research programmes contain methodological statements that tell \nscientists what is good to work on and what isn t. In this view, what many think of as a single theory \nis re­ally a series of slightly different theories, where a later theory differs from its predecessor \nby being better or progressive. A theory is progressive (over the last) when it leads to new pre­dictions, \nnone of its bold (core) predictions have been falsified, and it is not patched by ad hoc statements, \nbut instead retains its hard core and adjusts its protective belt. A series of theories like this is \ncalled a research programme, and when a research programme is no longer progressive, a new one emerges. \nPopper required instances of nature saying NO be ex­plained or the theory replaced; Kuhn observed normal \nsci­ence moving forward patching its theory until it was too unwieldy, and then replacing it during a \nsort of revolution. Epistemological anarchism (anything goes): Paul Fey­erabend in some ways rpg s favorite \nphilosopher of sci­ence said that science really doesn t proceed in a rational manner, that there is \nno such thing as demarcation between science and voodoo, that there is no such thing as progress, and \nthat one theory succeeds another only when the propa­ganda machine of the replacing theory s proponents \nover­throws the other s. Actor Network Theory: Bruno Latour looks at science with a sociologist s eye \n[10]. He argues three ideas: science is what a jury decides it is; science is what gets done in a laboratory; \naccepted science is the result of a strong social network in which references accumulate to indicate \nwhat the overall com­munity of scientists thinks about the work. In other words, to know what science \nis, visit Google Scholar. These views teach us that science is not purely about the truth, scientists \naren t (simply) objectively securing the truth from the clutches of nature, and science might after all \nsim­ply be a convenient story about the world that enables us to build things. And what of the idea that \nengineering depends on science? Here is how the American Engineers Council for Professional Development \ndefines engineering: The creative application of scientific principles to design or develop structures, \nmachines, apparatus, or manufacturing processes. t Let s look at engineering to start to connect art \nwith sci­ence through engineering. rpg: In 1995 I went back to school and got my MFA in Cre­ative Writing \nin poetry in fact. They tried to teach me how to notice things. In fact, the primary method of teaching \nfine arts is to show you how to observe and analyze closely so you can learn and improve on your own. \nIf all you have for a teacher, for example, is a complicated poem written by a master, you must be able \nto see all the craft elements and thought processes the poet used to create that poem. We think of engineers \nas craftsmen or sometimes even as laborers. But building things as engineers do requires people to manipulate \nmaterials and the physical world, and figuring out how to build things requires looking at the world \nvery carefully. Therefore, engineers need tacit knowledge to do their work well. And tacit knowledge \ncomes from practice and discipline, and being able to notice deeply as artists do. It shouldn t be surprising \nthen to notice, when we look back on the history of science, that many or perhaps most of our scientific \nadvances came from engineers, builders, and craftsmen working with materials, coming to understand them, \nand formalizing their characteristics. What science contributes, mainly, is a way of thinking about materials \nand forces in ways that are computationally convenient and repeatable, in ways that reveal the properties \nand possibilities of nature. Science is a story with lessons that Scientists Engineers create knowledge \n create knowledge  are problem driven are problem driven  seek to understand and explain seek to \nunderstand and explain  design experiments to test the- design experiments to test the­ories ories \n prefer abstract knowledge prefer contingent knowledge  but rely on tacit knowledge but rely on tacit \nknowledge  can be easily applied. These stories are in a computationally friendly language called mathematics. \nSkilled manual labor entails a systematic encoun­ter with the material world, precisely the kind of en­counter \nthat gives rise to natural science. From its ear­liest practice, craft knowledge has entailed knowledge \nof the ways of one s materials that is, knowledge of their nature, acquired through disciplined per­ception....[I]n \nareas of well-developed craft practices, technological developments typically preceded and gave rise \nto advances in scientific understanding, not vice versa. [11] One good example is the steam engine. \nIt was developed while scientists were way into the caloric theory of heat. Looked at now, this theory \nis hilarious. It held that heat con­sisted of a fluid called caloric that flows from hotter to colder \nbodies. Caloric is a weightless gas that can pass in and out of pores in solids and liquids. The amount \nof caloric in the universe is constant, so there is a sort of conservation that thermodynamics also recognizes. \nA cup of hot coffee cools because caloric is self-repelling, so it disperses from the dense concentration \nin the cup to the less dense air. When caloric enters the air, it combines with its molecules, and thus \nthe air increases in volume. By expanding on what happens when caloric interacts with other matter we \ncan explain heat radiation, phase changes (ice, water, steam, for example), as well as deduce most of \nthe gas laws. When Laplace corrected Newton s pulse equation with a constant to take caloric into account, \nthe equation was better able to predict the speed of sound, and as this constant was refined under the \ncaloric theory, even more precise predic­tions for the speed of sound were made for over a century. The \ncaloric theory was replaced, generally, by thermody­namics, but you know, the whole time steam engines \ncontin­ued to work, and they still do.3 Here is a more realistic view of scientists and engineers. Both \nscientists and engineers create knowledge through dis­ 3Steam engines exploded during their early development \nand use, but this was due mostly to a lack of knowledge (scientific or engineering) about the strengths \nof materials. covery, are problem driven, and seek to understand and ex­plain the world and things in \nit. Scientists design hypotheses and experiments, and engineers design devices in fact, en­gineers help \nscientists design the devices used in their ex­periments. Scientists are more comfortable with abstract \nor universal ideas, and engineers with concrete or contingent knowledge.4 And both rely on tacit knowledge. \nt What s the essence of science? Discovery and verification. Verification is mostly what the philosophers \nof science concern themselves with, but without discovery, there is not so much to verify. Discovery \nis the heart scientific inquiry. Engineering, as we ve seen, is one way discoveries happen from playing \nwith materials, trying to bend them to our wills, using them to build with and another way is simple \nnotic­ing what s in front of you. Langley, Simon, Bradshaw, and Zythow Herb Simon noticed similar things \nwhen writing about a system they wrote that engages in data-driven scientific discovery: In the scientist \ns house are many mansions .Out­siders often regard science as a sober enterprise, but we who are inside \nsee it as the most romantic of all callings. Both views are right. The romance adheres to the processes \nof scientific discovery, the sobriety to the responsibility for verification. Histories of science put \nthe spotlight on discovery.... The story of scientific progress reaches its periodic cli­maxes at the \nmoments of discovery....In the philoso­phy of science, all the emphasis is on verification, on how we \ncan tell the true gold of scientific law from the fool s gold of untested fantasy. In fact, it is still \nthe majority view among philosophers of science that only verification is a proper subject of inquiry, \nthat nothing of philosophical interest can be said about the process of discovery. But we believe that \nscience is also poetry, and per­haps even more heretical that discovery has its rea­sons, as poetry does. \nHowever romantic and heroic we find the moment of discovery, we cannot believe either that the events \nleading up to that moment are entirely random and chaotic or that they require genius that can be understood \nonly by congenial minds. We be­lieve that finding order in the world must itself be a process impregnated \nwith purpose and reason. [12] Artists discover they notice; it s what they re trained to do. It requires \nsome talent to become an artist, but mainly it 4Contingent knowledge is knowledge that depends on the \ncontext or envi­ronment where one is working. takes practice and perseverance. Genius is rarely if ever \npart of the equation.5 But a step has been left out: exploration. Think of art. Dis­covery is the heart \nof any artistic endeavor. Discovering is noticing, and noticing naturally takes place on a journey, preferably \na strange one. Artists often start out with no par­ticular destination in mind when they start a project, \nand sometimes this will be hard to believe at first no starting point but simply what happens to occur \nto them at the start. Noticing is trained seeing, and not only what is there but what should be there. \nAnd not just in art. Think of science. First exploration (Darwin on the Beagle), then discovery (Röntgen \nand X-rays), and finally understanding (Maxwell s equations). Ordinary folks don t see as scientists \nor artists do. George Gamow et al. saw (predicted) that there should be a cosmic microwave background \nradiation (CMBR) left over from the big bang. Arno Penzias and Robert Wilson didn t ignore the low-level \nbackground signal from their radio telescope but worked hard to eliminate all possible explanations except \nCMBR.6 It turned out that what they were seeing was what had been seen (predicted) earlier. One does \nwell to know what might be seen, and to know how to recognize it. Art­ists similarly know how to see. \nPainters and photographers see color differently from someone not trained as an artist. Exploration is \nessential to artists so essential that some artists use artificial mechanisms to ensure that the starting \nplace and subject matter are substantially random and un­planned for in order to explore fruitfully. \nArtists have found it can be important to have a sort of defocused attention and to engage in flat associations \ngoing broad not deep. This is exploration; by noticing we begin to discover. Discovery is making connections, \nand this is where metaphors pop up. Peter Turchi writes that exploration is some combination of premeditated \nsearching and undisciplined, perhaps only partly conscious, rambling, and that if we persist, we dis­cover \n[13]. Exploration is opening the mind to possibilities; discovery can be literal discovery, such as finding \na pot of gold at the end of a rainbow, but sometimes it s a guess this is the best way to structure the \nstory, the best image to convey the nar­rative or lyrical point, or the best explanation of what you \nsaw while exploring; understanding is coming to believe (based on real evidence) that the discovery or \nguess is valid that it is right, that it is what is needed, and perhaps why it s valid. Turchi says, \nexploration is assertive action in the face of uncertain assumptions, often involving false starts, missteps, \n5C.f., e.g., The Talent Code by Daniel Coyle, The Genius in All of Us by Da­vid Shenk, and Multiple Authorship \nand the Myth of Solitary Genius by Jack Stillinger. 6Wikipedia reports on their scientific assiduousness: \nAfter thoroughly checking their equipment, removing some pigeons nesting in the antenna, and cleaning \nout the accumulated droppings, the noise remained. and surprises [13]. Discovery, as William Stafford \nmight say, is a reckless encounter with whatever comes along [14]. Some writers start with a scene or \na situation, sometimes just a sense or feeling and that becomes a novel. The poet Bob Hass says he starts \nwith a phrase, a word, or a line and a gesture, a physical gesture in the air which indicates, for example, \na rising energy level or a decline or some more com­plicated shape and the result is a poem [15]. Once \na draft begins to take shape a draft of a written piece or paint on the canvas or some shards off the \nrock or some notes on the guitar a process of understanding begins. This is the revision process where \nwhat has been discovered is examined and the best story / painting / sculpture / com­position is created. \nSometimes these drafts are in the form of sketches or studies when the medium is not malleable. Again, \nTurchi: Only after discovery can the work be prop­erly structured, can the selection and organization \nof the significant moments of time take place [13]. He continues: If we attempt to map the world of a \nstory before we explore it, we are likely either to (a) prematurely limit our exploration, so as to reduce \nthe amount of material we need to consider, or (b) explore at length but, recognizing the impossibility \nof taking note of everything, and having no sound basis for choosing what to include, arbitrarily omit \nentire realms of in­formation. The opportunities are overwhelming. [13] This is the full process of \nart exploration, discovery, and then verification or understanding and it s also the full pro­cess of \nscience. Naturally, it s not a linear process but one with cycles of explore-discover-understand within \nany of its steps. What s different between art and science is the emphasis given to the parts. Serious \nthinkers about the scientific process focus on verification and understanding. Making judgments about \nwhat s good science. What s nice about art is that there has been plenty of thought given to the early \nparts of the pro­cess: exploration and discovery and we can learn from it. Artistic creation is as much \nabout being lost as exploring known even half-known territory. Great explorers don t explore the parts \nof the map that have names. Turchi sums it up like this: Artistic creation is a voyage into the unknown. \nIn our own eyes, we are off the map. The excitement of potential discovery is accompanied by anxiety, \nde­spair, caution, perhaps, perhaps boldness, and, al­ways, the risk of failure. Failure can take the \nform of our becoming hopelessly lost, or pointlessly lost, or not finding what we came for (though that \nlast is sometimes happily accompanied by the discovery of something we didn t anticipate, couldn t even \nimagine before we found it). We strike out for what we believe to be uncharted waters, only to find ourselves \nsailing Artists create knowledge, language, alternative reality  are image or piece driven  seek \nto understand and explain  design devices (their pieces) to explore the world and the self  prefer \ncontingent knowledge  but rely on tacit knowledge  in someone else s bathtub. Those are the days it \nseems there is nothing new to discover but the limitations of our own experience and understanding. [13] \n Art and science can be confused: at the beginning of re­corded history there were a set of stories about \nhow and why the world and people were created, why weather happens, why the earth moves under our feet, \nwhy the seasons change, why people are different, why their moods change, why there are families, how \nto plant, hunt, and live. Oceans, sky, fire, trees, animals. Matt Crawford writes: Some of the oldest \nstories we know, including cre­ation myths, were attempts to make sense of the world. Those early storytellers \ninvented answers to the mys­teries all around them. Why does the rain come? Why does it stop? If a child \nis created by two adults, from where did the first two adults originate? What is the earth like beyond \nwhat we have seen, and be­yond what the people we know have seen? What lies beyond the stars? [11] We \ncall these stories literature now, or religious tracts. But at the time, they passed as science. Looking \nat art objectively, given this more enlightened view, it seems that artists, engineers, and scientists \nare not so different after all. They all create knowledge of one sort or another some­times hard science \nknowledge, sometimes how to knowl­edge, and sometimes what about it knowledge. Artists cre­ate language \nand other sorts of realities (like engineers). They work through the medium of the pieces of art they \nendeavor to create. Theses pieces are devices used to understand and explain the world. And not just \nthe natural world, but the world of human perception, conditions, values and ethics, emotions, etc. The \nsubject matter and means of investigation are different, but the architecture of the processes are similar \nacross the art, science, engineering spectrum. Should we coin a word for this process? Is it research? \nAnd they all work with what s in front of them, using skills and talents that take time to acquire. t \n Thus far we ve muddied and complicated your ideas about science and art. We ve deliberately made science \nlook confus­ing, and in particular made it appear to be seeking knowl­edge without a solid philosophical \nfooting. And we ve made art look more principled than the simple yowling into the night many take it \nto be. That is, we ve tried to explode your stereotypes. And we ve hinted that artists and scientists \n(and engineers) work in much the same way: each explores, each discovers, and each understands (verifies \nand/or validates). But art science is just one among perhaps many dimen­sions that might describe how \npeople work on creative endeav­ors. Another is experimental-conceptual. This brings us back to noticing. \nHow hard it is to notice when our rational minds try to layer our concepts on top of what is really out \nthere. Our rational brains try to replace ongoing perception with symbols. Like a parser, we reduce the \ncomplex to the simple symbol, then move on; whereas art demands that we parse and parse again and parse \nagain until we see what s there in a new way. So that even the already-crazy artist sometimes needs to \nuse artificial means to see things as they are. Language we re talking about language. t Over the last \n2000 years there have been about 900 at­tempts to invent a language that is better than natural lan­guage \neither to be more logical, to be more precise, to be easier to learn, or to eliminate perceived design \nflaws. One question about natural languages is that even though people quite obviously made them, how \nwere they designed? Were they designed in any sense? Do they reflect a certain struc­ture in our brains, \nour DNA, the background order of the universe? Languages considered as engineering works are obviously \nflawed, and the good scientist or engineer desires to do better. Artists, though, seem to revel in natural \nlanguage love the mess the way painters love oils and watercolors, the unruli­ness of them all. Arika \nOkrent argues like this: the urge to invent languages is as old and persis­tent as language itself. It \nis at least as old and per­sistent as the urge to complain about language. The primary motivation for \ninventing a new language has been to improve upon natural language, to eliminate its design flaws, or \nrather the flaws it has developed for lack of conscious design. Looked at from an engi­neering perspective, \nlanguage is a kind of disaster. [16] Natural language clearly being not designed must lack the advantages \nof a well- and deliberately designed language complete with its verification. But natural languages have \na distinct advantage they support discovery and thought formulation of just the sort the artists we ve \nlooked at so far have talked about. The messiness of natural languages gives them a power that we miss \nwhen we write in artificial languages, such as programming languages. natural language and the messy \nqualities that give it so much flexibility and power, and that make it so much more than a simple communication \nde­vice. The ambiguity and lack of precision allow it to serve as an instrument of thought formulation, \nof ex­perimentation and discovery. We don t have to know exactly what we mean before we speak; we can \nfigure it out as we go along. Or not. [16] And in the hands of a careful writer, natural language can \nbe as precise as it needs to be. Most programming language specifications have a core in natural language. \nAt the same time natural language still works as an instrument of thought transmission, one that can \nbe made extremely precise and reliable when we need it to be, or left loose and sloppy when we can t \nspare the time or effort. [16] Let s look at some code! <right below> [17] Beautiful. We all know a language \nlike this one, so it should  be clear what it does, no? Now look at some other code at the top of the \nnext page [17]. This code is almost the same as the previous, but its author did something different \nand additional. Art and clarity were added.7 Compilers don t care what names things have as long as they \nare precise and accurate in their distinctions. People are also interested in understanding, and here \nwhat can only 7You might believe that an explanation was added, but the combination of the pure code \n+ the artistic namings is the explanation you re seeing. What was added (only the namings) by itself \nwould be a work of art. void foo(int x[], int y, int z) { if (z > y + 1) { int a = x[y], b = y + 1, c \n= z; while (b < c) { if (x[b] <= a) b++; else { int d = x[b]; x[b] = x[--c]; x[c] = d; } } int e = x[--b]; \nx[b] = x[y]; x[y] = e; foo(x, y, b); foo(x, c, z); } void quicksort(int array[], int begin, int end) \n{  if (end > begin + 1) { int pivot = array[begin], l = begin + 1, r = end; while (l < r) { if (array[l] \n<= pivot) l++; else swap(&#38;array[l], &#38;array[--r]); } swap(&#38;array[--l], &#38;array[beg]); sort(array, \nbegin, l); sort(array, r, end); } } be called art has aided that aspect. Or perhaps, artistry was used \nto layer on an intended interpretation. When messiness is missing, people naturally add it back by creating \ntheir own natural language on top of the parts of the artificial one that provide wiggle room. This is \nwhat s happened in the example below [17]. Art can go pretty far in this direction. There is no need \nto run the shell script below to get its humor. By itself it s a form of light verse, worthy of Ogden \nNash, perhaps. t Earlier we talked about artistic processes. Poets and others sometimes engage in processes \nof defamiliarization in order to see the world differently. At the top of the left column on better watchout \n better !cry !pout lpr why santa claus <north pole > town cat /etc/passwd > list ncheck list ncheck \nlist cat list | grep naughty > nogiftlist cat list | grep nice > giftlist santa claus <north pole > town \n who | grep sleeping who | grep awake who | egrep bad|good for (goodness sake) {be good}  the next page \nis a poem rpg wrote by using Babelfish as a defamiliarization aid. A Robert Frost poem was run through \na number of cycles of translation to and through other lan­guages then back to English to undo the idioms \nand figures of speech that Frost used originally, producing a set of raw language with which to start \nto construct a poem a poem both weirdly similar to the original and dementedly different . Just glance \nat it for a minute. Frost s original [18] is at the top of the right column on the next page. t When \nwe think formally about creative acts, the question arises: Where does new stuff come from? The philosopher \nCharles Sanders Peirce recognized that traditional logical induction and deduction were closed wrt prior \nassumptions and data: they cannot produce new ideas. He proposed ab­duction to explain the form of reasoning \nthat leads to new ideas. Informally, such an inference leads from an observa­tion of a situation that \nis not yet understood to a hypothesis that, if true, explains the observed phenomenon. Peirce wrote: \nNow, that the matter of no new truth can come from induction or from deduction, we have seen. It can \nonly come from abduction; and abduction is, after all, nothing but guessing. We are therefore bound to \nhope that, although the possible explanations of our facts may be strictly innumerable, yet our mind \nwill be able, in some finite number of guesses, to guess the sole true explanation of them. That we are \nbound to assume, independently of any evidence that it is true. Animated by that hope, we are to proceed \nto the con­struction of a hypothesis. [19] Here re brief descriptions of abduction, deduction, and induction. \nIn deduction, one proceeds from an antecedent a by logical manipulation to a consequent b. In induction, \none proceeds from a set of structured empirical observations of a and b together to infer that a . b. \nIn abduction, one observes b some phenomenon not yet understood and guesses that an antecedent a accounts \nfor b (i.e., a . b), giving rise to the hypothesis, a. Now, having a hypothesis, normal hypothetico­deductive \nscience can begin verification. E.g., suppose you know that all the stones on a particular Virginia beach \nare white. Then you see white stones on a table next to the beach. Deduction does not dictate the stones \nare from the beach perhaps a truck driver from Missouri left them there. There are no regular observations \nof such stones having come from the beach, so induction is useless. A rea­sonable abductive inference, \nhowever, is that the stones are from the beach. This illustrates the idea of abduction as in­ference \nto the best explanation. With hypothesis in hand, one can then deduce consequences and test the theory. \nOne might Stopping by http://babelfish.altavista.com on a Snowy Evening Here is a task whose outcome \nis certain: Thinking of someone s forest and then thinking whether this forest is that someone s. And \nas for his house (I ve picked this up): it is certainly located in town. I am stopped here paying attention \nto the snow above, observing the trees filling in above the snow. My eye finds comfort in this. As \nfor my horse, he strangely and narrowly stops. I am small, me and the small end of the tree both agree. \n To the horse, we are stopped between a farm and the frozen sea. This evening is the strangest and the \ndarkest of the year, the horse must think. His harness bells are his only user interface. These bells \nare installed to a flange by some wiring, and so he gives the flange a shock, vibrating the wires, thereby \njolting the bells (giving them a restlessness) in order to pose me a question: Is there some kind of \nmistake here? Surely a certain error exists. He is a small horse. There is only one other sound, a different \nsound like a clay tone, but only to the extent of a thin layer or a languid ribbon forming a closed loop: \nthe sweepback of a light breeze over downy soft flakes a simple, easy wind; flakes like cotton wool or \nhair or a rag for cleaning, which is the same thing. Or maybe it sounds like this: khlop! (I am excited \nby this.) Woods are attractive. Likable. Lovable, even. Or sometimes obscure. One of the trees is dark \nand from a place which is deep. And you know what they say: Dark and deep are deep. But I am held to \nobligations which I must maintain. Before I sleep I must resume my outward journey. (And other unspecified \nthings of the same class.) do a statistical test of table-stone sizes against beach-stone sizes, or \ndo a comparative analysis of chemical characteristics. Abduction engages the imaginative capacity of \nthe hu­man mind to envision possible worlds ( these stones came from the beach ). It is thus a modal \nform of logical reason­ing, and a form capable of producing a new idea: a logical leap of the mind. Abduction \nis also non-monotonic the validity of the inference is always contingent on future information. If the \nchemical analysis comes back negative, well, then, the stones really weren t from the beach after all. \nSuch a willingness to guess a good solution to go with it open to reconsider­ing it, is essential to \nsuch modern software practices as agile programming. Before dismissing guessing as unscientific, consider \nFeyn­man s explanation of how one makes scientific discoveries: In general, we look for a new law by \nthe following process. First we guess it. Then we compute the con- Stopping By Woods on a Snowy Evening \nWhose woods these are I think I know. His house is in the village though; He will not see me stopping \nhere To watch his woods fill up with snow. My little horse must think it queer To stop without a farmhouse \nnear Between the woods and frozen lake The darkest evening of the year. He gives his harness bells \na shake To ask if there is some mistake. The only other sound s the sweep Of easy wind and downy flake. \n The woods are lovely, dark and deep. But I have promises to keep, And miles to go before I sleep, And \nmiles to go before I sleep. sequences of the guess to see what would be implied if this law that we \nguessed is right. [20] Feynman worked abductively. The Stanford Encyclopedia of Philosophy states: Scientific \nmethod begins with abduction: a con­jecture or hypothesis about what actually is going on. Then, by means \nof deductive inference, conclusions are drawn from the hypothesis about other things that must obtain \nif the hypothesis is assumed to be true. These other things, it is hoped, can be experimentally tested-for. \nFinally, hypothesis-testing is performed by seeking experimentally to detect something that has been \ndeduced to obtain from the hypothesis. [21] The concept of a form of reasoning that leads to conclu­sions \nthat are not necessary but possible is in fact very old. Aliseda-Llera notes that it dates to Aristotle \ns apogoge [22]. Laplace addressed in detail the process of reasoning from effects (data) to causes (hypotheses). \nPeirce was responsible for the name, abduction, and for placing abduction in the context of what then \nemerged as modern logic. Nor is the idea new that abductive reasoning is important to invention and discovery. \nPeirce was clear on the matter. And later in the late 1950s, the philosopher of science, Nor­wood Russell \nHanson, argued against the notions of Popper and others who insisted on hypothetico-deductive (H-D) processes \nas the essential heart of the scientific method. Han­son was interested in the intellectual activity \nthat gave rise to novel hypotheses, and not so much in the subsequent (and in his view more mundane and \nformal) activities of deducing consequences and testing them. He referred back to the Peir­cian notion \nof abductive reasoning, arguing that it instead was essential to creativity in science: Physicists do \nnot start from hypotheses; they start from data. By the time a law has been fixed into an H-D [hypothetico-deductive] \nsystem, really original thinking is over. [23] Hanson s position led to arguments in the philosophy \nof science over several decades. For example, an infinite num­ber of hypotheses can be inferred abductively \nfrom a single observation; how does one choose? Sami Paavola presented a summary of the principal objections \nand a refutation: Deductive logic is not enough, and the model of abductive inference is especially needed \nin order to understand the processes of discovery. But abduction in itself is not enough. Besides validity \nconsiderations (which are in themselves important in abduction) there is the art of using (abductive) \nreasoning. [24] Abduction provides power when used intelligently, stra­tegically, artfully, in a value-seeking \nprocess. Getting a little closer to home, we view critical parts of the software system design process \nas involving not the deduction of code from specifications, but creative exploration and discovery. One \nof the keys to an artful and effective use of abduc­tion is iteration iterated guessing, testing, and \nrefinement of provisional hypothesis. Toshio Itoh wrote: Abduction is both essential to and effective \nfor cre­ativity. Abduction, which allows a role for the per­sonality, is the only thought process that \nactually fosters creativity. Abduction is outward-looking.... Abduction is self-correcting. Abduction \nvalidates or invalidates hypotheses by constantly exposing their consequences or the assumptions behind \nthem to new facts and continually subjecting everything to practi­cal verification. [25] Iterative development \nprocesses work not by hoping to derive everything from a specification assumed to be correct, but by \ncontinual guessing, testing, and refining. Development involves design. In The Design of Business: Why \nDesign Think­ing is the Next Competitive Advantage, Roger Martin states: Whether they realize it or not, \ndesigners live in Peirce s world of abduction; they actively look for new data points, challenge accepted \nexplanations, and infer possible new worlds. [26] Martin argues that most contemporary organizations \nnot only fail to support this style of thinking: they actively stamp it out. The problem is that the \nneeds of creative de­sign, which seeks valid constructs constructs that actually solve the right problems \nconflict with demands for reliable performance which is obtained by processes that eschew the unpredictability \nof creativity: e.g., delivering predictable prof­its on a quarterly basis through measurement and inductive \nprojection. Martin says, delving into mysteries is the most expensive activity because you literally \ndon t know what you are doing . Long-term viability of economic enter­prises, Martin argues, is in balancing \nreliability and validity. Martin formulates his proposal for business in terms of three stages of knowledge \nrefinement. One starts with a mys­tery, a problem, an anomaly, that excites our curiosity but eludes \nour understanding. The leap to the next stage is by abduction: in the form of a guess (sometimes wild) \nas to an appropriate solution. The guess, or hypothesis, is a concept providing for a simplified and \nmanageable understanding [of what is often a very complex domain] and the ability to focus efforts, to \nguide organized exploration of possibilities. Such a hypothesis leads to a valid heuristic solution. \nThe third step is to systematize that heuristic solution: to make an algorithm, a certified production \nprocess, which guarantees that results with particular attributes will be produced reliably. Martin s \ncentral argument is that contemporary organiza­tions are overly focused on reliability rather than on \nvalid­ity: for example, on producing hamburgers with vanishingly small parameter variations, rather than \non producing what people really want to eat. Mihnea Moldoveanu, quoted in Martin s book, argues, the \ninductive fallacy is that of in­ferring validity from reliability. It s easy to see that some artists \nknow a lot about abduction, at least tacitly. The sentences in a short story are not sufficient to deduce \nthe story that appears in your head as you read it. Good short story writers know how much is needed \nfor most readers to abduce essentially the same story. And producing the work of art in the first place \nrequires constant discovery and guessing because all works of art are works of exploration and discovery. \nRobert Boswell, the fiction writer, puts it like this: I have grown to understand narrative as a form \nof contemplation, a complex and seemingly incongruous way of thinking. I come to know my stories by writing \nmy way into them. I focus on the characters without trying to attach significance to their actions. I \ndo not look for symbols. For as long as I can, I remain purposefully blind to the machinery of the story \nand only partially cognizant of the world my story creates. I work from a kind of half-knowledge. In \nthe drafts that follow, I listen to what has made it to the page. Invariably, things have arrived that \nI did not invite, and they are often the most interest­ing things in the story. By refusing to fully \nknow the world, I hope to discover unusual formations in the landscape, and strange desires in the characters. \nBy declining to analyze the story, I hope to keep it open to surprise. Each new draft revises the world \nbut does not explain or define it. I work through many drafts, progressively abandoning the familiar. \nWhat I can see is always dwarfed by what I cannot know. What the characters come to understand never \nsurpasses that which they cannot grasp. The world remains half-known.  There can be no discovery in \na world where every­thing is known. A crucial part of the writing endeavor is to practice remaining in \nthe dark. [27] In the cycle of explore-discover-understand, creative acts take place in the discover \nphase, where abduction guess­ing happens. Exploring with an open mind perhaps with defocused attention \nan artist or scientist might guess / hyo­thesize that something might be the case or might be worth turning \ninto a work of art. Then in understanding the guess either verifying / validating it as a scientist or \nworking out its best artistic expression as an artist, one can then embark on further exploration, further \ndiscovery, and further un­derstanding. The astronomer Heber Curtis had a hunch (a guess con­stituting \na possible discovery) that the entire universe was not the same as the Milky Way (our galaxy), and that \nthe Andromeda Nebula was actually a separate galaxy. This was the subject of the Great Debate in 1920 \nbetween Heber Curtis and Harlow Shapley. Later, Edwin Hubble believed if he could find (explore; discover) \na Cepheid variable star in the Nebula, information about its luminosity and period would tell us how \nfar away it was and settle (understand; verify) whether it was in the Milky Way. And in fact Andromeda \nturned out to be a separate, far away galaxy. This is an example of fractal nature of the explore-discover-understand \nprocess. And also that the process need not occur within one scientist s mind. t But not all scientists \nor even artists work exclusively in the realm of stuff ; not all writers write without a plan, a concept; \nnot all scientists work exclusively from data to hy­pothesis. There is another relevant dimension which \naddresses this objection: the dimension of experimental to conceptual. Artists who have produced experimental \ninnova­tions have been motivated by aesthetic criteria: they have aimed at presenting visual perceptions. \nTheir goals are imprecise, so their procedure is tentative and incremental. The imprecision of their \ngoals means that these artists rarely feel they have succeeded, and their careers are consequently often \ndominated by the pursuit of a single objective. [27] When we first started thinking about art, we believed \nthat all art especially writing was what is called experimental art. We believed that a good writer just \nstarted out in some direction even if he or she planned out the piece in great detail but sooner or later \nthe piece would take over and the writer would be along for the ride. But this isn t true. The poems \nwe just showed you, and to an extent the code as well, are not the product of unbounded ex­ploration \nand discovery. Each of them was based on a concept. In contrast, artists who have made conceptual in­novations \nhave been motivated by the desire to com­municate specific ideas or emotions. Their goals for a particular \nwork can usually be stated precisely, before its production, either as a desired image or a desired process \nfor the work s execution. Conceptual artists consequently make detailed preparatory sketches of plans \nfor their paintings. [28] In the defamiliarized Frost poem, rpg s concept was to use Babelfish to make \na set of ridiculous translations of the well­ known poem in order to free it of its now-familiar wording. \nHe had it translate the poem from English to Greek, then to Korean, then to Japanese, then to German, \nand back to Eng­ lish; he used a set of such cyclic translations as the starting point for his poem. \nThis is conceptual art. For experimental artists: planning a painting is unimportant. The subject selected \nmight be simply a convenient object of study, and frequently the artist returns to work on a motif he \nhas used in the past. Some experimental painters begin without a specific subject in mind, preferring \ninstead to let the subject emerge as they work. Ex­perimental painters rarely make elaborate prepara­tory \nsketches. Their most important decisions are made during the working stage. The artist typically alternates \nbetween applying paint and examining the emerging image; at each point, how he develops the image depends \non his reaction to what he sees. [28] For conceptual artists: planning is the most important stage. Before \nhe begins working, the conceptual artist wants to have a clear vision either of the completed work or \nof the process that will produce it. Conceptual artists con­sequently often make detailed preparatory \nsketches or other plans for a painting. With the difficult deci­sions already made in the planning stage, \nworking and stopping are straightforward. The artist executes the plan and stops when he has completed \nit. ...extreme practitioners...make all the decisions for a work before beginning it. It is unclear, \nhowever, if this is literally possible. There are artists who came close to it, and perhaps achieved \nit, during the 1960s, by making plans for their work and having these plans executed by others. [28] \n In painting, Cézanne is an experimental artist and Picasso is conceptual. Generally and interestingly, \nthe masterpieces of experimental artists are done at an older age than for con­ceptual artists. Back \nin the 1970s, a curmudgeonly professor at the MIT AI Lab noticed the experimental-conceptual dimension. \nJo­seph Weizenbaum is best known for writing the Eliza pro­gram, which pretended in a trivial fashion \nto be a Freud­ian therapist. But he was irked by the programmers at the AI Lab, espe­cially Richard Stallman. \nHe painted a picture of the ordi­nary professional programmer and contrasted it with the hacker, meaning \nsomeone like Stallman. The professional programmer worked like a conceptual artist, making plans in detail, \nand perhaps not even execut­ing them himself, but delegating that to an underling or perhaps an apprentice. \nThe ordinary [professional] programmer will...gen­erally do lengthy preparatory work, such as writing \nand flow diagramming, before beginning work with the computer itself. His sessions with the computer \nmay be comparatively short. He may even let others do the actual console work. He develops his program \nslowly and systematically. When something doesn t work, he may spend considerable time away from the \ncomputer framing careful hypotheses to account for the malfunction and designing crucial experiments \nto test them....When he has finally composed the pro­gram he set out to produce, he is able to complete \na sensible description of it and turn his attention to other things. [29] The hacker whom he delicately \ncalled a compulsive pro­grammer acts like an experimental artist, just digging in with only the dimmest \nglimmer of what to do, and eventu­ally something comes out. The compulsive programmer is usually a superb \ntechnician,...one who knows every detail of the com­puter he works on, its peripheral equipment, the \ncom­puter s operating system, etc....He can write small subsystem programs quickly, that is, in one or \ntwo sessions of, say, 20 hours each....His main interest...is in very large, very ambitious systems of \nprograms.... [T]he systems he undertakes to build have very gran­diose but extremely imprecisely stated \ngoals. Some examples...are: new computer languages to facilitate man-machine communication; a general \nsystem that can be taught to play any board game; a system to Concept Experiment mathematician craftsperson \nEinstein Darwin waterfall engineer Warhol 1970s hacker Picasso Cézanne agile? Science Art make it easier \nfor computer experts to write super­systems. [29] And like the experimental artist or poet, if anything \ngood emerges it s because of technique and skill, not knowledge. Not something to form theories about, \nnot something ame­nable to science. The compulsive programmer...calls what he does hacking. ...He cannot \nset before himself a clearly de­fined long-term goal and a plan for achieving it, for he has only technique, \nnot knowledge. He has nothing he can analyze or synthesize; in short, he has nothing to form theories \nabout.... (It has to be said that not all hackers are pathologi­cally compulsive programmers. Indeed, \nwere it not for the often, in its own terms, highly creative labor of people who proudly claim the title \nhacker, few of today s sophisticated computer time-sharing systems, computer language translators, computer \ngraphics systems, etc., would exist.) [29] t The space of how people work at creative endeavors is at \nleast as complex as depicted in the diagram above. Let s start with conceptual artists. Sometimes they \nare forced into it because their medium is not malleable, not like words on a page or in a file. (Note \nthat the advent of comput­ers for writing made it easier to be an experimental writer for having a much \nmore malleable medium for the words to live on or in.) Experimental artists are like Cézanne, like a \nlot of pre­computer-age poets, like the fiction writer Robert Boswell, like hackers in the 1970s perhaps. \nConceptual scientists are like mathematicians and Ein­stein; like theoretical physicist such as Feynman. \nExperimental scientists are like engineers, or the complex­ity scientists who use agent-based simulations \nto understand systems and try to manipulate them. Conceptual creatives embrace abstractions symbol sys­tems \nor sketches that show only the big ideas; experimental  Paul Cézanne: A Modern Olympia Pablo Picasso: \nLes Demoiselles d Avignon ones like to get their hands or minds around the stuff itself. Kent Beck calls \nsource code stuff. Drew McDermott, a computer scientist at Yale, once said, what I like about Lisp is \nthat you can feel the bits between your toes. Artists believe that the key part of making art is explora­tion \nand discovery, while scientists believe the key part of doing science is understanding and verification. \nNotice that we wrote believe. In fact, generally, artists evaluate their discoveries and re­vise like \ncrazy writers convene circles of friends and work­shops to examine and critique drafts. And in fact, \nscientists have nothing to understand and verify unless they have ex­plored and discovered. Conceptual \nartists and scientists play with and explore abstractions and ideas their stuff. Scientists and artists \nare blind to what they actually do and how they really work. The problem with the diagram on the previous \npage is that it is static everyone working on a cre­ative project moves all over this 2-dimensional space \nwhile working. Because they are all people, and people mostly work the same ways. Sometimes they explore \nand discover, sometimes they verify and control, sometimes they work in the realm of ideas, and sometimes \nthey manipulate materials. Cézanne played. He struggled to develop an authentic observation of the seen \nworld by the most accurate method of representing it in paint that he could find. To this end, he structurally \nordered whatever he perceived into simple forms and color planes (abstractions). His artistic goals were \nthings he could only approach and never achieve, and that s why he kept trying, with his best works coming \nlate in life. His ideas were not concepts that came in a flash, but something he painted and painted \nand painted. He stalked art, he pur­sued it like a series pursues its convergence. Picasso thought of \nhimself as someone from whom art sprung whole. Les Demoiselles d Avignon is considered by many to be \nhis masterpiece. He carefully planned it. The painting portrays five nude prostitutes in a brothel in \nBarce­lona. The figures are physically jarring, none conventionally feminine, all slightly menacing, \nand each is rendered with an angular and disjointed body shape. Two of the women have African-mask-like \nfaces, giving them a savage and mysterious aura. This is a variant of Primitivism. Picasso also abandoned \nperspective in favor of a flat, two-dimensional picture plane. Picasso stated that his art was the result \nof what he had found as opposed to showing his seeking, as Cézanne did but he claimed to not believe \nin research. I can hardly understand the importance given to the word research in connection with modern \npaint­ ing. To find, is the thing.... When I paint my object is to show what I have found, not what I \nam looking for.... I have never made trials or experiments. Whenever I had something to say, I have said \nit in the manner in which I have felt it ought to be said. [30] Yet, for Les Demoiselles d Avignon, \nPicasso did over 400 studies and sketches, a record for artistic preparation. If this isn t playing, \nexperimenting, and researching, we confess to not knowing what those things are. t Artists, scientists, \nand engineers approach their work in similar ways, with nearly the same set of creative and concep­tual \ntools. This seems obvious to us, but maybe not to most, and possibly not to scientists. What if it were \npossible to be a better scientist by using techniques from art? Consider this experiment: Look at the \ngrammar at the bot­tom of the column. A scientist is shown 45 strings of length between 6 and 9 generated \nby it, and asked to copy down each one. The original list and copies are removed, and a short time later, \nthe scientist is asked to look at 60 strings made up of the letters X, V, M, R, &#38; T, 30 of which \nwere generated by that grammar and 30 by a different one; next, the scientist is told that the strings \nhe or she had copied had something in common, and he or she is asked to classify these 60 strings according \nto whether it had that same thing in common. M X    M X R T V  M V T  The classification task \nis a mystery, and coming up with a grammar that corresponds to the original 45 strings requires guessing \nabduction. But, any performed abduction takes place implicitly in the scientist s mind. What s been described \nis a common tool to measure implicit learning or implicit abduction: what grammar can give rise to the \n45 test strings? Now suppose a group of 40 people, broken into two 20-per­son groups, is asked to do \nthe above experiment, but before that, each group is asked to read an illustrated short story. One group \nis asked to read a revision of Kafka s The Country Doctor, which is a (slightly) absurdist story [31]. \nThe other group is asked to read a straightforward version of the same story [31]. What would happen? \nCamus wrote about Kafka: In this fundamental ambiguity lies Kafka s secret. These perpetual oscillations \nbetween the natural and the extraordinary, the individual and the universal, the tragic and the everyday, \nthe absurd and the logi­cal, are found throughout his work and give it both its resonance and its meaning. \n[32] Travis Proulx and Steven J. Heine did this experiment, and found that the group that read the absurd \nversion of the story were 26% more accurate (correctly identified strings from the grammar) than the \nother, and classified 33% more strings as belonging to the grammar (ignoring whether they were right \nor wrong) [33]. Proulx and Heine claim this lat­ter result is because of increased motivation, but perhaps \nit s just increased energy. The straightforward version of the story is linear and bor­ing. It doesn \nt require any quesswork to get its meaning, which in this case is nothing more than its (dull) plot and \nhappy ending. The absurd version is not particularly crazy or surreal, but it does call for abduction \nto try to make sense of it. Like many surreal and absurdist stories, no abductions work well, and the \nreader is left with a sense of mystery and strangeness. But the brain is hard at work abducing and be­coming \ndefamiliarized, just as we saw other artists doing. No wonder, then, that with the mind open to far-flung \nconnec­tions it is able to learn a little more effectively and confidently. t Over the past century \nor so, there have been persistent and dedicated efforts to scientifically control development and production \nprocesses. Such efforts have made a big dif­ference to the quality of manufacturing though we can t say \nit s helped the quality of design much. Scientific processes have also been pushed in the realm of software \ndevelopment, and we believe this is a significant error an error based on misperceiving how work actually \ntakes place in designing and creating software. Scientific processes, whether for product development, \nmanufacturing, or service delivery, seek to minimize vari­ances in task execution through the imposition \nof tight con­straints, measurement systems, and feedback control. An artistic process tolerates or even \nwelcomes a variety of inputs and works to produce the best (or at least an accept­able) result given \nthe inputs and the situations encountered while executing the process. In particular, an artistic process \ncan adapt to very poorly stated requirements or even no re­quirements at all (aside from the production \nof something of value). Artistic processes endeavor to invent and blaze new trails. In many cases the \nvalue of the outcome of an artistic process will be determined only after the product has been produced, \nthough it s often possible to make some judgments along the way. [34] Many aspects of software development \nrequire an artistic approach, an approach that acknowledges that sometimes exploration and discovery \nare required. Sometimes artistic processes are experimental because source code and soft­ware are malleable \nand subject to play but sometimes they are conceptual, achieved through blackboard designs, role playing, \nsimulations, and modeling. Moving through the art / science / concept / experiment space is fractal. \nArtistic approaches work best when requirements are sparse, incomplete, or even simply wrong or poorly \nstated. They also work where invention is desired. Yet, pressure continues to be placed on software creation \nto fall in line with scientific processes. This is because, we believe, people would really like to see \nsoftware creation con­form to their caricature of an engineering discipline. Software creation is not \nthere yet. The manufacturing metaphor came to be when producing code a line at a time looked a lot like \nlaborers laying sleepers and rails. But even producing software where everything is well un­derstood, \nmistakes are made and programmers spend their time trying to wrangle the code into behaving the way they \nclearly see it in their minds. Always, the creation of software requires at least one cycle through the \nexplore discover understand space if for no other reason than vision, requirements, and specifications \nare a mystery, while design and code are abductions. When we bother to watch how work gets done regardless \nof the theory that sits in your head about how it should be done we see this everywhere in software development. \nAnd this isn t only a local phenomenon it happens at all levels. This is what Weizenbaum missed when \nhe watched or­dinary professional programmers even though they didn t sully their hands with actually \npunching in code and over­seeing its execution, they were forced to reconsider, replan, and reformulate, \njust as Picasso did in his sketchbooks: they played with stuff that happened to be abstract. The real \nproblem with the scientific approach to software isn t that it s wrong all the time; it s just that it \ns not right all the time. It s a one-size fits all philosophy. People who dig into the nature of software \ncreation recognize that in many cases there is a cycle of exploration and discovery with a heavy dose \nof getting it to work. This is in part because when we de­velop software we are creating novel worlds \nwithout imposed constraints on what s possible there are only the constraints we imagine up to put in \nplace. Circumstances dictate the ap­propriate process. Perhaps now we can begin to distinguish conditions \nwhen it is likely to pay to go abductive / creative / artistic rather than deductive / scientific. t \nWe need to look closely at what creative work is really like and adopt techniques and processes that \nsupport it. Education is part of it. Possibly artistry has been pushed aside because it s not well understood. \nA common definition of an artist is a person who expresses himself through a medium. Cer­tainly some \nartists do this, but not all, and perhaps not the majority. It would be just as true to say that an engineer \nis a person who expresses himself through bridges. t Explore: wander / defamiliarize Discover: guess \n/ abduce Understand: validate / ask did you build the right thing?  References [1] Knott, Bill. Nights \nof Naomi. Barn Dream Press. Bos­ton. 1971. [2] Wikipedia. Superstring Theory. [3] yesyesnono photostream. \nFlickr.com. 2010. [4] Jackson Pollock. [5] Sanda Illescu. [6] Kevin J. Sullivan. Personal communication. \n[7] Kuhn, Thomas. The Structure of Scientific Revolutions. University Of Chicago Press. 1996. [8] Wikipedia. \nPositivism. [9] Lakatos, Imre; Feyerabend, Paul. For and Against Method. Edited by Matteo Motterlini. \nUniversity of Chicago Press, Chicago &#38; London. 1999. [10] Latour, Bruno. Science in Action: How \nto Follow Scien­tists and Engineers through Society. Harvard University Press. Cambridge, MA. 1988. [11] \nCrawford, Matthew, B. Shop Class as Soulcraft: An In­quiry Into the Value of Work. Penguin. New York. \n2009. [12] Langley, Pat; Simon, Herbert A.; Bradshaw, Gary L; Zytkow, Jan M. Scientific Discovery: Computational \nExplorations of the Creative Processes. The MIT Press. Cambridge, MA. 1987. [13] Turchi, Peter. Maps \nof the Imagination: The Writer as Cartographer. Trinity University Press. 2004. [14] Stafford, William. \nWriting the Australian Crawl. Uni­versity of Michigan Press. Ann Arbor. 1987. [15] Hass, Robert. Personal \ncommunication. Squaw Valley, CA. 2008. [16] Okrent, Arika. In the Land of Invented Languages: Es­peranto \nRock Stars, Klingon Poets, Loglan Lovers, and the Mad Dreamers Who Tried to Build A Perfect Lan­guage. \nSpiegel &#38; Grau. New York. 2009. [17] Baniassad, Elisa; Myers, Clayton. An Exploration of Program \nas Language. Proceedings of the 24th ACM SIGPLAN Conference on Object-Oriented Program­ming, Systems, \nLanguages, and Applications. Orlando. 2009. [18] Frost, Robert. New Hampshire. Henry Holt. New York. \n1923. [19] Hartshorne, Charles; Weiss, Paul. Collected Papers of Charles Sanders Peirce, Volumes I and \nII: Principles of Philosophy and Elements of Logic. Harvard University Press. Cambridge, MA. 1958. [20] \nFeynman, Richard. A Life in Science. Dutton. New York. 1997. [21] Burch, Robert. Charles Sanders Peirce. \nZalta, Ed­ward-N. ed. The Stanford Encyclopedia of Philosophy. Stanford University. Winter 2008 edition. \n2008. [22] Aliseda-Llera, Atocha. Seeking Explanations: Abduc­tion in Logic, Philosophy of Science, and \nArtificial Intel­ligence. Stanford University Ph.D. Dissertation, De­partment of Philosophy. 1997. [23] \nHanson, N. R. Patterns of Scientific Discovery. Cam­bridge University Press. New York. 1961. [24] Paavola, \nSami. Abduction as a logic and methodology of discovery: The importance of strategies. Founda­tions of \nScience, 9(3):267 283. 2004. [25] Itoh, Toshio. A New Approach to Future Enterprises: Abduction for Creativity. \nOhmsha, Ltd. Tokyo. 1996. [26] Martin, Roger. The Design of Business: Why Design is the Next Competitive \nAdvantage. Harvard Business Press. Boston, MA. 2009. [27] Boswell, R., The Half-Known World: On Writing \nFic­tion. Graywolf Press. St. Paul, MN. 2008. [28] Galenson, David W. Old Masters and Young Geniuses: \nThe Two Lifecycles of Artistic Creativity. Princeton Uni­versity Press. Princeton, NJ. 2007. [29] Weizenbaum, \nJoseph. Computer Power and Human Reason. Penguin. New York. 1984. [30] Picasso, Pablo. 1923 interview. \n[31] http://dreamsongs.com/Files/ImplicitLearningStories.pdf. From Proulx &#38; Heine [33]. [32] Camus, \nAlbert. An Absurd Reasoning. The Myth of Sisyphus and other essays. J. O Brien editor and trans­lator. \nVintage Books. New York. 1955. [33] Proulx, Travis; Heine, Steven J. Connections From Kafka: Exposure \nto Meaning Threats Improves Implic­it Learning of an Artificial Grammar. Psychological Science. Vol. \n20, No. 9. 2009. [34] Hall, Joseph M.; Johnson, M. Eric. When Should a Process Be Art, Not Science? Harvard \nBusiness Re­view. Cambridge, MA. March 2009.  \n\t\t\t", "proc_id": "1869459", "abstract": "<p>How do artists and scientists work? The same.</p>", "authors": [{"name": "Richard P. Gabriel", "author_profile_id": "81100654724", "affiliation": "IBM Research, Hawthorne, NY, USA", "person_id": "P2354184", "email_address": "", "orcid_id": ""}, {"name": "Kevin J. Sullivan", "author_profile_id": "81100395111", "affiliation": "University Of Virginia, Charlottesville, VA, USA", "person_id": "P2354185", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1869459.1869533", "year": "2010", "article_id": "1869533", "conference": "OOPSLA", "title": "Better science through art", "url": "http://dl.acm.org/citation.cfm?id=1869533"}