{"article_publication_date": "04-01-1993", "fulltext": "\n Addendum to the Proceedings OOPSLA I Washington, DC-26September-7 October, 7993 Panel Session Status \nof Object-Oriented COBOL Reported by: Joel Van Stee (Moderator) IBM Corporation Members of the panel: \nMegan Adams, Hewlett-Packard Company Dmitry Lenkov, Hewlett-Packard Company Raymond Obin, Micro Focus \nHenry Saade, IBM Corporation The goal of the panel was to inform the audience of the history of the effort \nto define the object-oriented extensions to COBOL, provide a current status, and answer any questions \nfrom the audience. Just over 100 people attended this panel discussion. Joel Van Stee started the discussion \nwith an introduction of the panel members and a brief history of the task group generating the extensions. \nThe original sponsor of the group was CODASYL, the ANSI COBOL committee s design group. When CODASYL \nwas absorbed by the ANSI COBOL committee, X3J4, the object-oriented committee was separately organized \nas a subcommittee of X3J4, and is now known as X3J4.1. It exists only as long as the parent ANSI COBOL \ncommittee considers this independent effort required. The aim of the two groups is to have a single COBOL \nstandard targeted for publication in 1997. Dmitry Lenkov followed with a discussion of the early history \nand direction of the committee. Dmitry provided valuable information for positioning where the effort \nis today pointing out the continued popularity of COBOL for commercial applications, with both a large \nbase of programs and programmers. This discussion recognized that the O-O COBOL committee drew upon the \nexperience of existing languages and existing user and implementer approved techniques. The initial design \ndecisions included assuring that the large base of code would not be invalidated by the object-oriented \nextensions. The bulk of the discussion by the panel was given by Raymond Obin. The object-oriented COBOL \ncommittee considers O-O COBOL to be the logical conclusion for object orientation. When commercial programming \nis done using the O-O paradigm (i.e. O-O COBOL is in general use> object orientation will come of age. \nThe strategy of O-O COBOL was to combine what is good in COBOL with what is good in object orientation. \nObject orientation will not change the readability and maintainability of COBOL programs nor while it \nchange the fact that lots of COBOL programs and COBOL programmers exist in the world. Programs written \nwith the new extensions will still resemble COBOL. Object orientation will add those elements to COBOL \nto make it the O-O language of choice for commercial programmers: objects, classes, methods, multiple \ninheritance, persistence, polymorphism, early and late binding, garbage collection, interfaces, and user-defined \nexceptions. Addendum to the Proceedings OOPSLA 93  \n\t\t\t", "proc_id": "260303", "abstract": "", "authors": [{"name": "Joel Van Stee", "author_profile_id": "81332533250", "affiliation": "IBM Corporation", "person_id": "P142332", "email_address": "", "orcid_id": ""}, {"name": "Megan Adams", "author_profile_id": "81100312928", "affiliation": "Hewlett-Packard Company", "person_id": "P195501", "email_address": "", "orcid_id": ""}, {"name": "Dmitry Lenkov", "author_profile_id": "81100422576", "affiliation": "Hewlett-Packard Company", "person_id": "P67667", "email_address": "", "orcid_id": ""}, {"name": "Raymond Obin", "author_profile_id": "81100162584", "affiliation": "Micro Focus", "person_id": "P240017", "email_address": "", "orcid_id": ""}, {"name": "Henry Saade", "author_profile_id": "81100374681", "affiliation": "IBM Corporation", "person_id": "P109661", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260303.260318", "year": "1993", "article_id": "260318", "conference": "OOPSLA", "title": "Status of object-oriented COBOL (panel)", "url": "http://dl.acm.org/citation.cfm?id=260318"}