{"article_publication_date": "04-01-1993", "fulltext": "\n Washington, DC-26 September-7 October, 7993 Panel Session 11 Integrating Security Technology and Object-Oriented \nTechnology Panel Chair: Bhavani Thuraisingham The MITRE Corporation Panelists: T. C. Ting, University \nof Connecticut Peter Sell, Department of Defense Ravi Sandhu, George Mason University Thomas Keefe, Pennsylvania \nState University  1. Introduction In order to promote the exchange of ideas on security for object-oriented \nsystems between the security Object-oriented systems are gaining increasing community and object-oriented \ncommunity, wepopularity due to their inherent ability to represent organized a panel on integrating security \ntechnology andconceptual entities as objects, which is similar to the object-oriented technology at the \nOOPSLA 93 way humans view the world. This power of Conference. The panel addressed two aspects. First \nonerepresentation has led to the development of new was on incorporating multilevel security as well \nas generation applications such as Multimedia information discretionary security into object-oriented \nsystems toprocessing, Artificial Intelligence, CAD/CAM, and produce secure object-oriented systems. The \nsecond Process control systems. In addition to the power of aspect was on the use of object-oriented \ndesign and representation, object-oriented approaches are also modeling techniques for designing secure \napplications. being used to design software components and to This was the first panel on security to \nbe part of an interconnect heterogeneous database systems. OOPSLA Conference. The position papers of \nthe panel However, the increasing popularity of object-oriented chair and the panelists were published \nin the systems should not obscure the need to maintain OOPSLA 93 Conference Proceedings. In this paper, \nwe security of operation. That is, it is important that such describe the presentations of the panel \nchair, the systems operate securely in order to overcome any panelists, and the discussions that took \nplace at the malicious corruption of data as well as to prohibit panel. unauthorized access to and use \nof classified data. For applications such as C41, it is also important to provide 2. Presentations \nmultilevel security. ConsequentIy, multilevel secure object-oriented systems are needed in order to ensure \nThe panel chair Dr. Bhavani Thuraisingham opened the that users cleared to different security levels \naccess and session with a discussion of the developments on share a database with data at different security \nlevels in integrating security and object-oriented technologies. such a way that they obtain only the \ndata classified at or She discussed the developments incorporating security below their level. Recently \nseveral research efforts have into object-oriented systems as well as the use of been reported on incorporating \nmultilevel security into object-oriented technology for designing secure object-oriented systems. In \naddition, much work has applications. She also stated some of the novel areas also been done on incorporating \ndiscretionary security that are being explored, such as security for extended into object-oriented systems. \nWith discretionary relational systems and ACTOR-based systems. The security, users are granted access \nto the objects based four panelists were subsequently introduced. on their identification. Many commercial \nproducts The first panelist was Prof. T. C. Ting of the University enforce some discretionary access \ncontrol measures. of Connecticut. T. C. started his presentation with a While progress has been made \non applying security to discussion of MAC (mandatory access control) and object-oriented systems, object-oriented \ntechnology is DAC (discretionary access control) and the differences also being applied to design secure \napplications. The between them. He mentioned that while MAC has main focus has been on medical applications \nand received much attention, DAC should be an important multilevel secure applications. consideration \nin designing secure applications. DAC Addendum to the Proceedings OOPSLA 93 could actually be much broader \nand include the need-to- know concept also. DAC should also include statements as to how to use the data \nand also content and context dependent access to the data. T. C. stressed that security requirements \nshould be considered at the onset of the application design and not as an afterthought. He then went \non to explain where object-oriented technology would come into play. He stated that concepts in object-oriented \nmodels such as encapsulation could facilitate the design of secure applications. He described a methodology \nthat he and his colleagues have developed at the University of Connecticut called User Role-based System \n(URBS). The key feature in URBS is to use roles for separation of duty. He stated that the notion of \ngroup may not be sufficient and went on to explain how roles would satisfy some DAC requirements. The \nsecond panelist was Mr. Peter Sell of the Department of Defense. Peter described how Rumbaugh et. al \ns OMT could be extended to design multilevel secure database applications. He then discussed the essential \npoints of a methodology called MOMT (multilevel object modeling technique). The analysis phase of MOMT \nconsists of an object model, dynamic model, and a functional model. The object model of MOMT extends \nthe object model of OMT with support for handling different classification levels. The dynamic model \ncaptures scenarios and points potential security problems to the designer. The functional model uses \ndata flow diagrams and subsequently generates the methods and the execution levels of the methods. Peter \nexplained the concepts with examples. The third panelist was Prof. Ravi Sandhu of George Mason University. \nRavi started his presentation by stating that security has multidimensional objectives. They are: secrecy, \nintegrity, availability, and control of usage of information assets. Secrecy deals with users only getting \nthe information that they are authorized to know. Integrity deals with protecting the information from \nunauthorized modification. Availability deals with the information being accessible especially in critical \nsituations. Control of usage of assets is a recent objective and it deals with controls on how the information \nis used (such as copyright laws for software). These objectives conflict with one another, and when a \nsystem is designed, it must be determined as to which objectives are important. Ravi also pointed out \nthat security does not stand by itself. It is coupled with functionality and ease of use. Again one needs \nto achieve a balance between these feature. In designing a system, first a policy must be specified. \nSubsequently the mechanism to implement the policy is designed. Finally, assurance will determine how \nwell the design meets the objectives. Ravi then went on to discuss application independent vs application \ndependent security. With application independent security, one usually uses primitives such as read and \nwrite. This way, one could get higher assurance as there are fewer primitives. With application dependent \nsecurity, the primitives are defined in terms of the application. For a banking application, one could \nuse the primitives debit and credit. With more primitives, achieving higher assurance may be difficult. \nSince object-oriented applications are rich in semantics, the main issue here is whether one can obtain \nhigher assurance. Although encapsulation might provide better security, if this feature is bypassed, \nthen the system is not secure. Ravi ended his presentation with an important question: Is the object-oriented \napproach really better for security? The fourth panelist was Prof. Thomas (Tom) Keefe of Pennsylvania \nState University. He started his presentation with a discussion of some security terms. Then he took \na simple object model which is basically a directed graph and discussed some of the security features. \nThere are three concerns. One is the object ID. What does one mean by classifying the object ID? Does \none classify the name itself or the relationship to another object? He then talked about modifiable vs. \nunmodifiable objects. In the case of a modifiable object, its value can be changed only if its new level \ndominates the old level, With unmodifiable objects, one would create several copies of the objects which \nmay not be good for large databases. Tom finally addressed the issues of transactions. If transactions \nare single-level transactions, then they will execute at a single security level. This may limit their \nuse. For example, with such transactions, one cannot debit money from one account and credit money to \nanother account if the two accounts are at different security levels. So, the other choice is to have \nmultilevel transactions. Such transactions are more useful, but may require some trust. With respect \nto the object model, the question is, what impact will multilevel transactions have on method execution? \n 3. Discussion In the discussion that took place following the panel presentations, the panelists answered \nthe questions that were posed. Below we state some of the questions and the answers given by the various \npanelists. The first question was the following. With method invocation, wouldn t it be difficult to \nobtain high assurance? Ravi replied that the idea is to minimize the trusted code. This is the case in \nthe case of application programs such as mail systems, Only thing is that we don t usually worry about \nsuch programs as we do not consider them to be part of the system, whereas in an object-oriented system, \none considers methods to be part of the model. That is, similar problems exist with non object-oriented \nsystems also. T. C. added that encapsulation is the key and that this feature should not be bypassed. \nRavi then stated that one could develop a secure object-oriented system with the strict enforcement of \nBell and LaPadula policy, but this may not be realistic Another question was whether it would be between \nto use static languages like ADA rather than languages like Smalltalk. Ravi replied that with languages \nlike ADA, the question is do you trust your compiler. Trusting a compiler is a big issue. T. C. stated \nthat features like polymorphism needs to be explored further to see if there are potential security problems. \nAnother question was whether there were client-server systems which enforce security, and whether these \nsystem use Kerberos. Ravi replied that there are systems such as DCE, Telnet, and Rlogin which probably \nuse Kerberos. Bhavani stated that most object-oriented database management systems are based on client-server \narchitectures and enforce discretionary security. A member of the audience remarked that some critical \nsystems are developed using a subset of ADA. Washington, D.C. September 26-October 1,1993 Similarly secure \nobject-oriented systems could be developed using a subset of C++. He also commented on T. C. s presentation \non the distinction between groups and roles. He felt that role is a policy and group is an implementation \nof the policy. T. C. described some of the key points in the URBS model and also stated that with the \nclass hierarchy one could get the group concept, but groups alone were not sufficient for the separation \nof duty. Another related question was whether the role/group relationship is similar to the class/subclass \nrelationship. T. C. replied that this could be the case. For example there could be a group, of medical \nstaff with individual roles such as nurse, doctor, etc. Another question was to discuss the security \nimpact on inheritance. Tom explained some of the different cases. For example, if one assumes that the \nclass hierarchy is strictly monotonically nondecreasing, then all of the methods of the superclass may \nbe inherited. But if this is not the case, then there might some problems. Bhavani stated that at the \nOOPSLA 93 Conference Workshop on Security for Object-Oriented Systems, there was a discussion as to whether \nsuch a restriction should be imposed on the class hierarchy. She then quoted a paper that was presented. \nRavi mentioned that in the paper quoted it was stated that additional trust may be needed if one is to \navoid such a restriction. There was a question specifically for Peter. It was stated that some of the \nrestrictions placed on the MOMT methodology was not necessary. Peter replied that MOMT has a lot more \nthan what was presented, but also added that some issues do need more investigation. T.C. mentioned that \nthe problems mentioned were not specific to MOMT, but will be present for any methodology for secure \napplications and gave an example. The last question was on the use of encryption and whether it might \nalleviate some of the trusted code. The panelists all felt that encryption was needed and that one should \npay more attention to encryption. However, encryption alone was not sufficient. Finally the panelists \nstressed how important it is that security should be considered at the onset and not as an afterthought. \nWith respect to the object-oriented approach, one needs to take a step back and examine whether it is \nreally better for security. Addendum to the Proceedings OOPSLA 93 \n\t\t\t", "proc_id": "260303", "abstract": "", "authors": [{"name": "Bhavani Thuraisingham", "author_profile_id": "81100621824", "affiliation": "The MITRE Corporation", "person_id": "PP40029135", "email_address": "", "orcid_id": ""}, {"name": "T. C. Ting", "author_profile_id": "81452604319", "affiliation": "University of Connecticut", "person_id": "PP43124881", "email_address": "", "orcid_id": ""}, {"name": "Peter Sell", "author_profile_id": "81332526551", "affiliation": "Department of Defense", "person_id": "P225217", "email_address": "", "orcid_id": ""}, {"name": "Ravi Sandhu", "author_profile_id": "81312485832", "affiliation": "George Mason University", "person_id": "PP43123890", "email_address": "", "orcid_id": ""}, {"name": "Thomas Keefe", "author_profile_id": "81100317689", "affiliation": "Pennsylvania State University", "person_id": "P280952", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260303.260320", "year": "1993", "article_id": "260320", "conference": "OOPSLA", "title": "Integrating security technology and object-oriented technology (panel)", "url": "http://dl.acm.org/citation.cfm?id=260320"}