{"article_publication_date": "04-01-1993", "fulltext": "\n Addendum to the Proceedings OOPSLA I Washington, DC-26 Sepfeember-I October, 1993 Workshop Advanced \nTechniques for Understanding, Profiling, and Debugging Object Oriented Systems Organizers: Chris Laffra \nand Ashok Malhotra IBM T.J. Watson Research Center, USA Vicki de Mey University of Geneva, Switzerland. \n Report by: Chris Laffra This workshop was held on Sunday, prior to the actual conference. Participants \nwere invited, based on a short position paper in which they explained what they think is missing in currently \navailable tools for understanding, profiling and debugging of 00 systems. Half the people that responded \ncame from academia, the other half from the software industry. Which was a nicely balanced participation. \nThe phrase workshop suggests that participants have to work. However, our experiences from a couple of \nworkshops, was that many of them look more like mini-conferences. Typically, there are too many paper \npresentations, and people are often forced to be much too passive. As a contrast, the nature of our workshop \nwas intended to have no paper presentations at all. Instead, the participants very briefly presented \nwho they were, told the rest where they came from, and were given an opportunity to show at most two \nslides. After these short presentations, we started the process of gathering issues. Very quickly, a \nlist of issues was developed, and smaller groups were formed to discuss the topics in more detail. Some \ntopics were more popular than others. After these sessions, the groups merged again for a session of \nissue gathering At the end of the day, we tried to collect some interesting conclusions to be presented \nas a panel at the panel sessions, to be started on Monday, the next day. This collection process was \na little bit difficult, and kind of reflects the learning experience from a workshop with such an intensive \nnature. We did not have paper presentations, but people had a lot of interesting discussions, and it \nis very difficult to report on the results of a collection of many different discussions among enthusiastic \npeople held during the day. This paper will show how to get your hands on the list of position papers \nthat were sent in by the participants. This will give you an idea of the state-of-the-art of this subject. \nFurthermore, the issues that were raised in the different sessions will be discussed.  Background As \nobject-oriented systems become larger and more complex, it is becoming increasingly important to leverage \naudio and visual techniques in tools for program understanding, debugging, and tuning. When profiling \na given 00 system, visual techniques become valuable, even indispensable, when determining clusters of \ninstances or classes that appear to consume most processing power. The majority of the relationships \nbetween object instances are naturally expressed in a visual fashion. Therefore, it seems logical to \nuse visual techniques for monitoring and debugging 00 systems. Another potentially appropriate technique \nis sound. Sound might have a wider information bandwidth than text, at the very least it has an attention \ngetting power that is quite useful. Other techniques might very well included virtual reality or sensory \ninputs other than visual or audio. The people at the workshop all have one thing in common: they are \nconvinced that this topic is an exciting, interesting AND necessary area to explore. Displaying networks \nof object instances, maybe customized representations of objects that are normally difficult to trace \nas they are manipulated during the execution of the system? These are all definitely important issues. \nA number of tools were demonstrated that show how visualization can enhance the understanding of an 00 \nprogram (IBM T. J. Watson). Other contributions concentrated on specific techniques (Carleton Univ.), \non debugging (Siemens, Univ. of Toronto), on large complex systems (Univ. of Tokyo, Sun, Stanford Univ.), \non embedding in other Addendum to the Proceedings OOPSLA 93 environments (Centerline), on constraints \n(Arhus Univ.), on visual composition (Univ. of Geneva), on multimedia aspects (AT&#38;T), and on specifying \nthe dynamic behavior of objects (Univ. of Wales).  issues Raised The following issues were raised prior \nto the first session of small group discussions. People were asked to name any related subject they found \nimportant or relevant to the workshop. Basically, people expressed the wish to talk about: Query mechanisms \nfor filtering (dynamic) info. Meta information. What do you see? Is this what you want to see? Want \nto believe? 3D. 4D. Customization of views. Abstractions on data and views. Novice users versus novice \nprogrammers. Software Engineering aspects: tools for separate steps? Sound? multimedia. Mappings between \n00 and visual techniques. How to combine different paradigms (right and left side of brain). Requirements \nfor compilers and runtime systems. Cognitive aspects (how does the programmer think?). Smoothly scaling \nup (for large/huge programs).  Fundamental Problems After the first session some initial statements \nand conclusions were made. One collection of them was grouped as a list of fundamental problems related \nto the understanding of (large) object-oriented programs. Holistic view (how can we inspect details, \nbut still have a good idea on the overall structure of the system?). How can we track objects that are \nout of our focus? Sound is promising Fish eye views? How to hide the uninteresting information? How do \nwe match dynamic runtime behavior to the static (class) descriptions? These two can be very different. \nHow to find the patterns? How can tools help us with that?  Why isn t textual enough? Textual techniques \nwere naturally assumed to be insufficient. To make this assumption a little bit more concrete, the following \nreasons were given: Visual techniques contain more information. Visual techniques shows trends/anomalies. \nVisual techniques applies processes that work in  other domains. . 1 picture = 1000 words (sorry, we \nhad to mention it). Sound (people are experimenting with it). Textual representations are bad to represent \nDYNAMICS ! Visual techniques tell you behavior of the program. Textual techniques inhibit an interactive \nprocess. Visual techniques use cognitive associations.  It turned out to be more a discussion of Why \nis visual better than textual? but the title is the one that originally came up. Perhaps, this shows \nthat the two most obvious areas to be discovered are visualization and soundification of 00 programs. \n Infrastructure In order to allow tools to collect information and to present it to the user to enhance \nthe understanding of the executing 00 program, first some infrastructure related aspects need to be considered: \nHow do we do event collection? Instrumentation (both by the user and by automated tools), runtime annotation \nthrough code-patching, and reflection each are different possibilities Synchronization between the program \nand inspection tools Minimizing intrusiveness of instrumentation What info do you need? How to handle \nlarge amounts of information? Storage Race conditions Link to objects and code? Assimilation Reduction \nof size  What we need is: Techniques to understand how our 00 program works. There should be a graceful \npath from high level to fine details, using 00 concepts. We need to be able to zero in on a problem. \nIf you don t know what is wrong, how do you find it out? Conclusions: The panel on Monday listed the \nfollowing topics. In addition, some projects discussed at the workshop were presented also. Goal: Bridge \nthe chasm between static class structures and the dynamic object interactions  Techniques Online video \ndocumentation Introducing new abstractions Multiple views of concepts Animation of dynamic behavior Visualization \nto identify trends and anomalies Sound Washington, D.C. September 26-October 1,1993 Issues: Orthogonal \ndimensions: + determine who we are dealing with to motivate the techniques Large quantities of information \n0 Need for holistic views  The response from the audience was enormous. A lot of Centerline, USA (Robert \nBrazile, Webb Stacey) IBM T. J. Watson Research Center, USA (Chris Laffra, Ashok Malhotra, John Vlissides, \nand Wim de Pauw) DMR Group, Montreal, Canada (Richard Helm) Sun Microsystems Lab. Inc., USA (Lars Bak, \nDavid Ungar) AT&#38;T Bell Laboratories, USA (Shirley S. Huang) UBILAB of Union Bank of Switzerland \npeople said that they would certainly try and attend a similar workshop at OOPSLA 94, if it would be \nheld. Personally, I am convinced that next year we will see many more tools on the market that employ \nvisual techniques in presenting the dynamic behavior of 00 programs. The tools that are on the market \nnowadays are insufficient to develop any large scale application, despite the promise of 00 techniques. \n List of Workshop Participants The workshop participants represented the following institutes: University \nof Toronto, Canada (Arthur Tateishi) University of Geneva, Switzerland (Vicki de Mey) University of Tokyo, \nJapan (Jeff McAffer) OTI, Canada (Jeff McAffer) University of Washington, USA (Craig Chambers, Jeff \nDean) University of Auckland, New Zealand (John Hosking) Stanford University, USA (Urs Hoelzle) Carlton \nUniversity, Canada (John Bryant, Ron Casselman) University of Wales, UK (Lynda Thomas) Arhus University, \nDenmark (Bjom N. Freeman-Benson) (Walter Bischofberger, Bruno Schaeffer) Siemens Nixdorf, Germany (Lutz \nHilken) Johannes Kepler University of Linz, Austria (Wolfgang Pree) Franz Inc., USA (Chris Richardson) \nLucid, USA (Dave Williams).  Contact Information: More information about this subject can be obtained \nfmm Chris Laffra or Ashok Malhotra, IBM T. J. Watson Research Center,  P.O. Box 704, Yorktown Heights, \nNY 10598, USA. Tel: (914) 784 7644, Fax: (914) 784 7455 Email: {laffra, petsa} @Matson. ibmconz Thanks \nto Urs Hoelzle, the list of submitted position papers for the workshop can be retrieved through anonymous \nftp from selfstanford.edu in: /pub/papers/OOPSLA93-WS2/all-position-papers. OOPSLA 93  \n\t\t\t", "proc_id": "260303", "abstract": "", "authors": [{"name": "Chris Laffra", "author_profile_id": "81100050141", "affiliation": "IBM T.J. Watson Research Center", "person_id": "PP31024849", "email_address": "", "orcid_id": ""}, {"name": "Ashok Malhotra", "author_profile_id": "81100086504", "affiliation": "IBM T.J. Watson Research Center", "person_id": "PP14041165", "email_address": "", "orcid_id": ""}, {"name": "Vicki de Mey", "author_profile_id": "81100432405", "affiliation": "University of Geneva, Switzerland", "person_id": "P290670", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260303.260326", "year": "1993", "article_id": "260326", "conference": "OOPSLA", "title": "Advanced techniques for understanding, profiling, and debugging object oriented systems", "url": "http://dl.acm.org/citation.cfm?id=260326"}