{"article_publication_date": "04-01-1993", "fulltext": "\n Addendum to the Proceedings OOPSLA Washington, DC-26 September-l October, 1993 Workshop The Role of \na Corporate Object Technology Center Report by: Timothy Korson Consortium for the Management of Emerging \nSoftware Technologies 1.0 Workshop Premise, Goals, and Attendance 1 .I Premise and Goals Corporations \nthat wish to adopt object-oriented technology on a large scale face a complex set of technical, cultural, \norganizational, management, and policy issues. To facilitate this adoption, a number of organizations \nhave set up a corporate object technology center (OTC). The primary goal was to share insights, experiences, \nand approaches amongst organizations who have established a corporate object technology center. 1.2 Attendance \nThe workshop was organized and run by: Tom Guinane, IBM Object-Oriented Technology Center (guinane@stlvm7.vnet.ibm.com) \nTim Korson, Consortium for the Management of Emerging Technologies (COMSOFT) (korson@cs.clemson.edu) \nTom Kristek, IBM Object-Oriented Technology Center (scuba@pkedvm9.vnet.ibm.com) Gerard Meszaros, Bell \nNorthern Research (gerard@bnr.ca) Vijay Vaishnavi, Comsoft and Georgia State (cisvkv@gsugi2.gsu.edu) \nThe following people participated in the workshop. Ron Adams II, American Airlines Andrew Baer, American \nManagement Systems (andrew-baer@ mail.amsinc.com) Judy Cohen, American Management Systems John Cunningham, \nThe Travelers (judy-cohen@mail.amsinc.com) Jamie Erbes, Wiltel (jerbes@wiltel.com) Steven Fraser, Bell \nNorthern Research (sdfraser@bnr.ca) Barry Glicklich, Tellabs (barry@tellabs. corn) Addendum to the Proceedings \nKathryn Grady, Wisconsin Electric Power Company (wi.electric@mixcom.com) Ray Kruger, Coming, Inc. (kruger-rc \n@Corning. corn) Katherine Lato, AT&#38;T Bell Labs (lato@ihlpm.att.com) Marco Mulazzani, Alcatel (m.mulazzani@rcvie.co.at) \nRobert Marcus, Boeing (rmarcus@atc.boeing.com) Paul Richards, Electronic Data Systems (prichaol @ddex.ets.gmeds.com) \nKenny Rubin, ParcPlace Systems (krubin@parcplace.com) Kathy Yglesias, IBM Reuse Technology Support Center \n(yglesias@pkedvm9.vnet.ibm.com) Bing Yu, Union Switch and Signal, Inc. (yubing%atg @switch. corn) Neil \nThomson, Bell Northern Research (neilt@bnr.cal Position papers describing the approaches and status of \n13 different corporate object technology centers were received. Space constraints preclude the summarization \nof those position papers here, but, the full version of this report, which includes those summaries, \ncan be obtained from Tom Kristek (scuba@pkedvm9.vnet,ibm.com).   2.0 Discussion on Challenges The \nworkshop began with a discussion of each object technology center, the successes they ve achieved, and \nthe challenges they ve faced. The challenges were captured and prioritized. The top challenges were then \neither assigned to a work group for in depth discussion or were discussed briefly amongst the whole group. \nThe top challenges facing object technology centers were: Does object technology solve business problems? \nMetrics for object technology Structure and staffing of an Object Technology Center (work group) OOPSLA \n93 131 Defining a repeatable process for using object technology Does object technology scale to large \nprojects Object Technology and Reuse (work group) All attendees participated in discussion on the following \n4 topics. 2.1 Does Object Technology Solve Business Problems? This discussion was directed toward the \nquestion: How do we justify the investment in object technology to management? A key point made was that \napproaching management purely with the technical aspects of this, or any, new technology is not effective. \nYou have to use the basic motivational tools: Fear and Greed. If you can demonstrate that similar projects \nare getting improved quality, improved productivity, more products out the door, then management is going \nto be interested. The technical aspects can argument this argument. There is plenty of anecdotal evidence \nof productivity gains that can be used to begin to make the needed business case for adoption of the \ntechnology, but, there is still much work needed in the development and use of common sets of metrics \nfor object technology. These metrics are necessary to be able to compare object technology projects consistently \nand to be able to compare back to business as usual projects. Thus, there is growing evidence that can \nbe used by the object technology center to demonstrate that object technology, applied correctly, can \nyield code bulk reductions, maintenance cost reductions, quality improvements, and productivity gains. \nThe challenge to a particular OTC is to cast the technology and those gains into their set of business \nchallenges. 2.2 Metrics for Object Technology The discussion centered on the fact that metrics are fundamentally \ndifferent for object technology and are critical for many reasons including the aforementioned determination \nof the benefits the technology, estimating projects, and tracking projects. The OTC should be pushing \nany corporate measurement body for the development, validation, and adoption of unbiased, open metrics. \nMetrics or data that development groups are sensitive about (e.g.. measurements of failures) are problematic. \nThe OTCs need to help drive the development of these metrics by working with projects to understand and \nvalidate what types of data are important to collect. If a goal of new technologies is to get to market \nfaster with better quality, then the metrics collected must be able to be analyzed for such results. \nThe key is that the metrics must be beneficial to the providers of the data. Both internal and external \nmetrics are needed. External metrics would be public and could be used in general to understand the the \nimpacts of object technology on the business. Internal metrics would be private to the project and used \nfor tracking, estimating, and to drive improvements in the development process. The OTC must try to collect \nmetrics across all projects in order to build a comprehensive set of data. This data can then be used \nas appropriate in selling the technology, assessing its impact on the business, making changes in the \nway the technology is used, and refining the set of metrics that should be collected. 2.3 Defining A \nRepeatable Process for Using Object Technology The beginning of this conversation centered on whether \nand how the Software Engineering Institute Maturity Matrix relates to object technology. IBM has developed \nan maturity matrix based on the SE1 model but for measuring and improving one s understanding and use \nof the technology. Process is a component of this but is not the only component. Processes need to be \nflexible but there are certain indicators such as the ability to repeat parts that work effectively, \nthe ability for all participants in a process to understand their roles, and having documentation on \nhand at some level, that lend themselves well to the SE1 model ParcPlace s experience is that you don \nt want to get too bogged down on the notion of repeatability since some projects are either first of \na kind, or a major variation on a theme and the process must be highly flexible to adapt to these changes. \n 2.4 Does Object Technology Scale to Large Projects One problem in addressing this question is that large \nis relative. Where one participant defined large as a five person project, another viewed it as 500 people. \nWhereas some groups want to keep projects small in scale in order to avoid huge management problems, \nothers by the sheer size of their legacy systems must have large teams. The key problems in scaling the \ntechnology are similar to scaling any technology. Change management is difficult and a critical issue \nto address through strict process definitions. Tools and environments probably are not yet where they \nneed to grow to in order to effectively support such large scale object technology projects. And across \nlarge domains, the problems of defining, building, and using reusable parts are compounded. In many ways \nthis is a communication problem. So, the feeling was that the technology will scale but that the people \ndoing the first mega-projects in the industry will be going through a lot of inventing and a lot of growing \npains. Some comfort is taken in that some big, successful projects have been managed as a traditional \ndevelopment project might be and this approach has worked. Washington, D.C. September 26-October 1,1993 \n 3.0 Work Group Reports The attendees broke off into one of three work groups to discuss a particular \ntopic in detail. The groups then came back and reported on their discussions and recommendations to the \nwhole group. The work of these groups is summarized below. ;;nCi; Structure of an Object Technology \nThis group was to discuss how a Corporate Object Technology Center should be structured, what its mission \nshould be, and what its specific tasks should be. They took an approach that there are similarities in \nall technology transfer that would apply to any center of competence. Thus they tried to be generic in \ntheir description in order to create an approach that is generic, Their recommendations to the group, \nand to other potential OTC s in industry, are presented below in list fcxm: Some of the goals presented \nbelow in this report were actually discussed amongst the full work shop group. Goals of an Object Technology \nCenter . Respond to corporate goats in a balanced way . Technology insertion through documentation, \nhot lines, consulting, and special events . Generate interest in a bottom-up pull of the technology . \nGet top down support for investment in the technology . Provide recommendations on process, standards, \ntools, parts, reuse, etc. . Provide training . Ensure methodology promotes real software engineering \n. Drive a common understanding amongst all technology practitioners . Manage rapid development so it \nis used properly . Put selves out of business as technology becomes business as usual The following \nare the roles recommended for an OTC by this work group: 1. Education / knowledge broker Book library \nNewsletters seminars Education/knowledge services Speakers on topics of interest  2. Technology transfer \nMentoring Training the how to Pilot projects Apprenticeships  3. Technology support/service/adaptation \n 00 hot line Customizing the technology to the organization Getting a pulse on project status  4. Coordination \nof efforts/communication  Drive information across projects Build infrastructure for cross organization \nuse 5. Change the culture/values 6. Asset management (reuse management) 7. Manage external vendor \nrelationships  Coordinating training Single point of contact for acquisition of tools Licensing Vendor/tool \nevaluations Suppliers present unified view within the corporation 8. Business strategy synchronization \n 9. Evaluate for appropriateness for classes of projects 10. Lobby management to get an OCT going Meets \nbusiness needs, provides value 11. Networking consultation to provide common architecture vision 12. \nEvaluation and Research . Contribute to the technology state-of-art . Developing custom methodologies \n. Develop reusable frameworks  13. Standards/guidelines .  Production of handbooks . Design review \nguidelines . Reuse process guidelines 14. Promotion/selling/PR Presentations to management for OOT Promotion \nof company activities outside Lobbying for appropriate support This group urged all participating companies \nin the work shop to build a case study of their efforts for sharing with each other and other companies \ninterested in beginning an OTC. The case studies are to take the form Of: Background and introduction \non how the group got started and what was the motivation What are the goals and objectives of the OTC? \nWhat roles and services from the above list (and others) are provided? What successes and challenges \nhas the group experienced. Addendum to the Proceedings OOPSLA 93  3.2 Affecting Culture and Literacy \nThis group discussed how an OTC could and should affect the culture and literacy of a group or corporation \nmaking a move to object technology. Some of its thoughts are listed below: Any approach must be planned \nin detail Expectations must be managed in order to not have people expect more than the technology can \ndeliver Education on the technology (including expectations) must be directed in an appropriate way for \nall levels of people in the company (Executives,management, technical team) Publicity for the technology \nand what is needed to adapt it should be corporate wide An OTC should try to be in the right place at \nthe right time in terms of being ready to sell the technology at the time the company is ready to listen \nIf you sell the respected system architects, eventually others will follow. Peer-to-Peer testimonies \nare critical in getting an organization to buy into the culture change Focus on the points that are important \nto your organization in both selling and priorities for education Reuse Cycle time reductions 9 Flexibility \nof the technology The ability to get early results through rapid prototypes and iterations . Make sure \neveryone understands the costs up front . Build a training plan that covers education and pilot projects \n. Provide education roadmaps and tips (and of course courses) . Provide expert mentors particularly on \npilot projects . Provide maturity guides that give hints on where people really stand with their understanding \nof the technology and what steps they can take to improve . Build accessible document libraries that \ntell your developers what they need to know about object technology across the entire life cycle: Process \nMethodologies Tools Compilers and Libraries Metrics Education Conventions and Standards Etc. . Maintain \na highly visible presence . Continually assess and upgrade your offerings  3.3 00 and Reuse This group \ndiscussed the implications of realizing the full benefits of reuse when utilizing object technology. \nIts recommendations to the group are listed below: Build a strategy for implementation of a reuse program \nSet up a vision for an architecture Based on business goals Bottom up approach--create architecture by \nraising level of abstraction Incenting people for reuse Make sure the goals and expectations are realistic \nKnow what Granularity of Reuse you are looking for . Architecture . Frameworks Components Utility Code \nReuse is less attractive at the lower levels Manage reusable assets Need to track various types of information \nNeed the Proper Tools Identification, retrieval, storage, and maintenance of parts Transfer pricing May \nneed to determine value of the library assets Address Liability Issues Copyright and infringement Certificates \nof originality Prevent others from copyright as well Leveraging for training and standardization Balancing \ninnovation and reuse How to prevent enforcement of reuse from stifling reuse  4.0 Follow-On and Summary \nThe group agreed that this type of session was useful, and that follow-on sessions could be beneficial \nif they start to focus more on specific problems and solutions. The organizers will attempt to reconvene \nthe group to continue discussions at some appropriate Many different approaches for building an effective \nObject Technology Center were presented. Despite the differences some of the core problems of building \nexperienced staff, affecting culture and literacy, selling the technology, effectively establishing reuse \nin the corporation, and beginning and completing successful projects are the same. The workshop began \na high level discussion of some of the challenges facing OTCs and provided some insight into possible \napproaches to address these issues. Listed Workshop Organizers: Timothy Korson, Consortium for the Management \nof Emerging Software Technologies Tom Kristek, IBM Object Technology Center Gerard Meszaros, BNR Washington, \nD.C. September 26-October 1,1993  \n\t\t\t", "proc_id": "260303", "abstract": "", "authors": [{"name": "Timothy Korson", "author_profile_id": "81100619404", "affiliation": "Consortium for the Management of Emerging Software Technologies", "person_id": "PP39051299", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/260303.260362", "year": "1993", "article_id": "260362", "conference": "OOPSLA", "title": "The role of a corporate object technology center", "url": "http://dl.acm.org/citation.cfm?id=260362"}