{"article_publication_date": "05-01-1999", "fulltext": "\n\t\t\t", "proc_id": "301618", "abstract": "With an increasing number of executable binaries generated by optimizing compilers today, providing a clear and correct source-level debugger for programmers to debug optimized code has become a necessity. In this paper, a new framework for debugging globally optimized code is proposed. This framework consists of a new code location mapping scheme, a data location tracking scheme, and an emulation-based forward recovery model. By taking over the control early and emulating instructions selectively, the debugger can preserve and gather the required program state for the recovery of expected variable values at source breakpoints. The framework has been prototyped in the IMPACT compiler and GDB-4.16. Preliminary experiments conducted on several SPEC95 integer programs have yielded encouraging results. The extra time needed for the debugger to calculate the limits of the emulated region and to emulate instructions is hardly noticeable, while the increase in executable file size due to the extra debug information is on average 76% of that of the executable file with no debug information.", "authors": [{"name": "Le-Chun Wu", "author_profile_id": "81100657677", "affiliation": "The Coordinated Science Laboratory, University of Illinois, Urbana, IL", "person_id": "PP39052839", "email_address": "", "orcid_id": ""}, {"name": "Rajiv Mirani", "author_profile_id": "81100425378", "affiliation": "Application Delivery Laboratory, Hewlett-Packard Company, Cupertino, CA", "person_id": "PP14149896", "email_address": "", "orcid_id": ""}, {"name": "Harish Patil", "author_profile_id": "81100485093", "affiliation": "Compaq Computer Corporation, Shrewsbury, MA and Application Delivery Laboratory, Hewlett-Packard Company, Cupertino, CA", "person_id": "P107511", "email_address": "", "orcid_id": ""}, {"name": "Bruce Olsen", "author_profile_id": "81541922656", "affiliation": "Application Delivery Laboratory, Hewlett-Packard Company, Cupertino, CA", "person_id": "PP14203371", "email_address": "", "orcid_id": ""}, {"name": "Wen-mei W. Hwu", "author_profile_id": "81406592242", "affiliation": "The Coordinated Science Laboratory, University of Illinois, Urbana, IL", "person_id": "PP39062231", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/301618.301663", "year": "1999", "article_id": "301663", "conference": "PLDI", "title": "A new framework for debugging globally optimized code", "url": "http://dl.acm.org/citation.cfm?id=301663"}