{"article_publication_date": "10-29-2013", "fulltext": "\n\t\t\t", "proc_id": "2509136", "abstract": "<p>Some programming languages become widely popular while others fail to grow beyond their niche or disappear altogether. This paper uses survey methodology to identify the factors that lead to language adoption. We analyze large datasets, including over 200,000 SourceForge projects, 590,000 projects tracked by Ohloh, and multiple surveys of 1,000-13,000 programmers.</p> <p>We report several prominent findings. First, language adoption follows a power law; a small number of languages account for most language use, but the programming market supports many languages with niche user bases. Second, intrinsic features have only secondary importance in adoption. Open source libraries, existing code, and experience strongly influence developers when selecting a language for a project. Language features such as performance, reliability, and simple semantics do not. Third, developers will steadily learn and forget languages. The overall number of languages developers are familiar with is independent of age. Finally, when considering intrinsic aspects of languages, developers prioritize expressivity over correctness. They perceive static types as primarily helping with the latter, hence partly explaining the popularity of dynamic languages.</p>", "authors": [{"name": "Leo A. Meyerovich", "author_profile_id": "81100521215", "affiliation": "University of California at Berkeley, Berkeley, CA, USA", "person_id": "P4290302", "email_address": "lmeyerov@eecs.berkeley.edu", "orcid_id": ""}, {"name": "Ariel S. Rabkin", "author_profile_id": "81371596484", "affiliation": "Princeton University, Princeton, NJ, USA", "person_id": "P4290303", "email_address": "asrabkin@cs.princeton.edu", "orcid_id": ""}], "doi_number": "10.1145/2509136.2509515", "year": "2013", "article_id": "2509515", "conference": "OOPSLA", "title": "Empirical analysis of programming language adoption", "url": "http://dl.acm.org/citation.cfm?id=2509515"}