{"article_publication_date": "06-05-2010", "fulltext": "\n 2010 Athena Lecture Susan Eggers University of Washington eggers@cs.washington.edu Bio Susan Eggers, \na Professor of Computer Science and Engineering at the University of Washington, joined her department \nin 1989. She received a B.A. in 1965 from Connecticut College and a Ph.D. in 1989 from the University \nof California, Berkeley. Her research interests are in computer architecture and back-end compiler optimization, \nwith an emphasis on experimental performance analysis. With her colleague Hank Levy and their students, \nshe developed the first commercially viable multithreaded architecture, Simultaneous Multithreading, \nadopted by Intel (as Hyperthreading), IBM, Sun and others. Her current research is in the areas of distributed \ndataflow machines, FPGAs and chip multiprocessors. In 1989 Professor Eggers was awarded an IBM Faculty \nDevelopment Award, in 1990 an NSF Presidential Young Investigator Award, in 1994 the Microsoft Professorship \nin Computer Science and Engineering, and in 2009 the ACM-W Athena Lecturer. She is a Fellow of the ACM \nand IEEE, a Fellow of the AAAS, and a member of the National Academy of Engineering. \n\t\t\t", "proc_id": "1806596", "abstract": "<p>Susan Eggers, a Professor of Computer Science and Engineering at the University of Washington, joined her department in 1989. She received a B.A. in 1965 from Connecticut College and a Ph.D. in 1989 from the University of California, Berkeley. Her research interests are in computer architecture and back-end compiler optimization, with an emphasis on experimental performance analysis. With her colleague Hank Levy and their students, she developed the first commercially viable multithreaded architecture, Simultaneous Multithreading, adopted by Intel (as Hyperthreading), IBM, Sun and others. Her current research is in the areas of distributed dataflow machines, FPGAs and chip multiprocessors. In 1989 Professor Eggers was awarded an IBM Faculty Development Award, in 1990 an NSF Presidential Young Investigator Award, in 1994 the Microsoft Professorship in Computer Science and Engineering, and in 2009 the ACM-W Athena Lecturer. She is a Fellow of the ACM and IEEE, a Fellow of the AAAS, and a member of the National Academy of Engineering.</p>", "authors": [{"name": "Susan Eggers", "author_profile_id": "81100262930", "affiliation": "University of Washington, Seattle, WA, USA", "person_id": "P2184517", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/1806596.1806608", "year": "2010", "article_id": "1806608", "conference": "PLDI", "title": "2010 Athena lecture", "url": "http://dl.acm.org/citation.cfm?id=1806608"}