{"article_publication_date": "10-01-1987", "fulltext": "\n\t\t\t", "proc_id": "41625", "abstract": "<p>We study the strictness problem for the untyped lambda-calculus and for an ML-like typed calculus. We establish that strictness is a necessary and sufficient condition for the &#8220;eager&#8221; evaluation of function arguments. For the untyped calculus, we show that the strictness problem is elementary and describe a complete algorithm for strictness analysis of convergent terms. We show that typed terms possess a much richer set of strictness properties. A type-theoretic characterization of strictness is developed and it is shown that the strictness properties of a term can be represented as a collection of types related to the standard term type. A set of type inference rules that support reasoning about strictness related types is given. The inference rules are shown to be invariant under type change by substitution. This provides a sound basis for reasoning about strictness properties of terms by considering only their principal type. For our final result, we describe a practical system that carries out type checking and strictness analysis simultaneously in a unified framework. Our main result is thus the discovery that the problem of strictness analysis is a particular case of type inference.</p>", "authors": [{"name": "T.-M. Kuo", "author_profile_id": "81100421772", "affiliation": "Department of Computer Science, The State University of New York at Stony Brook, Stony Brook, New York", "person_id": "P277132", "email_address": "", "orcid_id": ""}, {"name": "P. Mishra", "author_profile_id": "81339517422", "affiliation": "Department of Computer Science, The State University of New York at Stony Brook, Stony Brook, New York", "person_id": "PP14016029", "email_address": "", "orcid_id": ""}], "doi_number": "10.1145/41625.41638", "year": "1987", "article_id": "41638", "conference": "POPL", "title": "On strictness and its analysis", "url": "http://dl.acm.org/citation.cfm?id=41638"}